<?php

namespace Database\Seeders;

use App\Models\Families;
use App\Models\FamilyMoto;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class MotoFamiliesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $familyData = [
            'type' => "adventure",
            'mainBikeLogoImage' => [
                'url' => 'adventure/mainBikeLogo.png',
                'alt' => 'Adventure Main Bike Logo',
            ],
            'shortDesc' => [
                'Explore a world of adventure, with motorcycles built to always reach the end of the road, ready to go anywhere and accomplish anything.'
            ],
            'familyPageBannerDesc' => [
                'The next generation Tiger has arrived. The state-of-the-art adventure bikes with exciting distinctive three-cylinder engines, pioneering progressive technology and equipment, rider ergonomics for ultimate control, and flexible neutral handling. Every Tiger is built with maximum capabilities to take you anywhere in style, comfort and control. The Triumph Tiger is the ultimate adventure series of adventure bikes that allow you to test every moment.'
            ],
            'familyPageBannerVideo' => [
                'adventure/adventureHeroVideo.webm'
            ],
            'topSectionInfo' => [
                'image' => [
                    'src' => '/images/adventure/firstSectionImage.avif',
                    'alt' => 'Adventure Bikes',
                ],
                'title' => 'Направен за Авантури',
                'desc1' => 'Секој моторцикл во "Tigеr" фамилијата е роден со вистински дух за авантура.',
                'desc2' => 'Познато по нивното агилно управување, командна позиција на возење, итн.',
            ],
            'promo' => [
                [
                    'title' => 'Tiger 1200 Gt, GT Pro & Gt Explorer',
                    'subFamilyType' => 'tiger-1200-gt',
                    'desc' => 'Врвни, патничко-авантуристички мотори, спремни и за интерконтинентални патувања.',
                    'image' => '/images/adventure/adventurePromoTiger1200Gt.avif',
                    'btnBlack' => true
                ],
                [
                    'title' => 'TIGER 1200 RALLY PRO AND RALLY EXPLORER',
                    'subFamilyType' => 'tiger-1200-rally',
                    'desc' => 'Со уште поголем off-road карактер и способности, најдобрата all-terrain авантуристичка серија.',
                    'image' => '/images/adventure/adventurePromoTiger1200Rally.avif',
                    'btnBlack' => false
                ],
                [
                    'title' => 'TIGER SPORT 660',
                    'subFamilyType' => 'tiger-sport-660',
                    'desc' => 'Tiger Sport 660, со ефикасен три-цилиндричен мотор, врвни перформанси, комфорт а сепак агилен и со најниски трошоци за одржување во класата. Сето ова од  €9,590.00.',
                    'image' => '/images/adventure/adventurePromoTiger660.avif',
                    'btnBlack' => false
                ],
                [
                    'title' => 'TIGER 900 GT',
                    'subFamilyType' => 'tiger-900-gt',
                    'desc' => 'Дизајниран за авантури по асфалт и комфорт, Tiger 900 GT серијата е фокусирана на возачот и нуди многу опрема и технологија на располагање.',
                    'image' => '/images/adventure/adventurePromoTiger900Gt.avif',
                    'btnBlack' => false
                ],
                [
                    'title' => 'TIGER 900 RALLY',
                    'subFamilyType' => 'tiger-900-rally',
                    'desc' => 'Возбудлив Tiger серија, дизајнирана за максимално off-road доживување, комфорт и исклучително врвна контрола врз моторот со погон од најмоќниот три-цилиндричен Triumph мотор.',
                    'image' => '/images/adventure/adventurePromoTiger900Rally.avif',
                    'btnBlack' => true
                ]
            ],
            'configPageInfo' => [
                'desc' => 'Истражете го светот на авантурите, со мотоцикли изградени за секогаш да стигнат до крајот на патот, подготвени да одат каде било и да постигнат сè.',
                'link' => '/configure/families/adventure',
            ],
            'configFamilyPageInfo' => [
                'image' => [
                    'src' => '/images/adventure/configFamilyBanner.avif',
                    'alt' => 'Adventure Bikes Banner'
                ],
                  'title' => 'Додајте аксесоари на вашиот мотор',
                  'link' => '/configure/bikes'
            ],
            'subFamilies' => [
                'tiger-900' => [
                    'id' => 1,
                    'subFamilyName' => 'tiger-900',
                    'title' => 'Нова Tiger 900 Серија',
                    'price' => 'Наскоро',
                    'url' => '/motorcycles/adventure/tiger-900',
                    'subFamilyPageInfo' => [
                        'heroSlogans' => ["НОВИОТ", "TIGER 900"],
                        'youtubeVideo' => 'https://www.youtube.com/embed/-eXK5VwysTA',
                        'fullSpecs' => [
                            'engineTransmission' => [
                                [
                                    'title' => 'Тип на Мотор',
                                    'desc' => 'водно ладење, 12 вентили, DOHC, линиски 3-цилиндри'
                                ],
                                [
                                    'title' => 'капацитет',
                                    'desc' => '888 cc'
                                ],
                                [
                                    'title' => 'диаметар',
                                    'desc' => '78 mm'
                                ],
                                [
                                    'title' => 'рута',
                                    'desc' => '61.9 mm'
                                ],
                                [
                                    'title' => 'компресија',
                                    'desc' => '11.27:1'
                                ],
                                [
                                    'title' => 'Мах. Коњски Сила',
                                    'desc' => '95.2 PS / 93.9 bhp (70 kW) @ 8,750 rpm'
                                ],
                                [
                                    'title' => 'Мах. Обртен Момент',
                                    'desc' => '87 Nm @ 7,250 rpm'
                                ],
                                [
                                    'title' => 'Систем за убризгување',
                                    'desc' => 'Multipoint sequential electronic fuel injection'
                                ],
                                [
                                    'title' => 'Систем за Издувни гасови',
                                    'desc' => '3 во 1 не-раѓосувачки челик'
                                ],
                                [
                                    'title' => 'Финална Трансмисија',
                                    'desc' => 'O-ring chain'
                                ],
                                [
                                    'title' => 'Квачило',
                                    'desc' => 'Multipoint sequential electronic fuel injection'
                                ],
                                [
                                    'title' => 'Менувачка Кутија',
                                    'desc' => '6 брзини'
                                ],
                            ],
                            'frame' => [
                                [
                                    'title' => 'шасија',
                                    'desc' => 'тубуларна челична шасија'
                                ],
                                [
                                    'title' => 'вилушка',
                                    'desc' => 'алуминиум'
                                ],
                                [
                                    'title' => 'предно тркало',
                                    'desc' => 'Tubeless, 21 x 2.15 in'
                                ],
                                [
                                    'title' => 'задно тркало',
                                    'desc' => 'Tubeless, 17 x 4.25 in'
                                ],
                                [
                                    'title' => '"предна гума',
                                    'desc' => '90/90-21'
                                ],
                                [
                                    'title' => 'задна гума',
                                    'desc' => '150/70R17'
                                ],
                                [
                                    'title' => 'предна суспензија',
                                    'desc' => 'Showa превртена 45мм вилушка, мануелно подесување за јачина на одбивање, 240мм опсег на работа'
                                ],
                                [
                                    'title' => 'задна суспензија',
                                    'desc' => 'Showa задна вилушка, мануелно подесување за јачина на одбивање, 230мм опсег на работа'
                                ],
                                [
                                    'title' => 'предни сопирачки',
                                    'desc' => 'Дупли 320мм дискови, Brembo Stylema 4 piston Monoblock клешти. Преден цилиндар за течност, Оптимизиран ABS систем'
                                ],
                                [
                                    'title' => 'задна сопирачка',
                                    'desc' => 'Brembo'
                                ],
                            ],
                            'dimension' => [
                                [
                                    'title' => 'ширина на волан',
                                    'desc' => '935 mm'
                                ],
                                [
                                    'title' => 'висина без ретровизори',
                                    'desc' => '1452-1502 mm'
                                ],
                                [
                                    'title' => 'Solar height',
                                    'desc' => '860-880 mm'
                                ],
                                [
                                    'title' => 'мегу-осовинско растојание ',
                                    'desc' => '1551 mm'
                                ],
                                [
                                    'title' => 'Custer Corner',
                                    'desc' => '24.4 º'
                                ],
                                [
                                    'title' => 'Trace',
                                    'desc' => '145.8 mm'
                                ],
                                [
                                    'title' => 'Тежина',
                                    'desc' => '201 kg'
                                ],
                                [
                                    'title' => 'капацитет на резервоар',
                                    'desc' => '20 L'
                                ],
                            ],
                            'fuelConsumption' => [
                                [
                                    'title' => 'Потрошувачка',
                                    'desc' => '5.2l /100km (55.4 MPG)'
                                ],
                                [
                                    'title' => 'CO2 загадување',
                                    'desc' => 'Euro 5 Стандарди. (119g /km CO2) измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини.'
                                ]
                                ],
                        'service' => [['title' => 'Сервисен Интервал', 'desc' => '10,000 km или 12 месеци']]
                        ],
                        'grayCarousell' => [
                            [
                                'id' => 'carouselItem1',
                                'title' => 'Инспириран од ARAGÓN',
                                'desc' => 'Креиран како инспирација од доминантниот победнички перформанса на Tiger 900 Rally Pro на Baja Aragon 2022.',
                                'image' => '/images/adventure/tiger900/tiger900GrayCaro1.avif'
                            ],
                            [
                                'id' => 'carouselItem2',
                                'title' => 'Стандарди',
                                'desc' => 'Лидер во класата по спецификации од почеток до крај, со квалитетни компоненти оптимизирани и за на пат и за “off-road“ средини.',
                                'image' => '/images/adventure/tiger900/tiger900GrayCaro2.avif'
                            ],
                            [
                                'id' => 'carouselItem3',
                                'title' => 'Технологија',
                                'desc' => 'Најновата технологија фокусирана на возачот понудува комфорт, самодоверба, сигурност и перформанси.',
                                'image' => '/images/adventure/tiger900/tiger900GrayCaro3.avif'
                            ],
                            [
                                'id' => 'carouselItem4',
                                'title' => 'Сервисен Интервал',
                                'desc' => 'Долгиот сервисен интервал додатно со две годишната гаранција која не истекува по одреден број поминати километри, со сигурност потврдува дека ќе имате безгрижни авантури и мали трошоци за одржување.',
                                'image' => '/images/adventure/tiger900/tiger900GrayCaro4.avif'
                            ]

                            ],
                        'audioSection' => [
                                'title' => 'Уникатни Перформанси и Звук.',
                                'desc' => 'Новиот 900сс три-цилиндричен мотор на Tiger 900 испорачува препознатлив длабок звук и длабок виок, со возбудливи вибрации при средни фреквенции и прекрасни звуци при финиш.',
                                'audio' => '/images/adventure/tiger900/tiger900Sound.mp3'
                            ],
                        'specNumbers' => [
                            ['data' => '900', 'info' => 'cc Мотор'],
                            ['data' => '87', 'info' => 'Nm обртен момент' ],
                            ['data' => '95', 'info' => 'PS - Максимална Сила' ],
                            ['data' => '+65', 'info' => 'Аксесоари' ]
                        ]
                    ],
                    'reasonsToDrive' => [
                        'banner' => [
                            'image' => '/images/adventure/tiger900/tiger900GrayCaro2.avif'
                        ],
                        'infoText' => [
                            'title' => 'Tiger 900 - најкомплетниот, флексибилен и динамичен авантуристички мотор со средна зафатнина на моторот.',
                            'desc' => 'Значително полесен од неговиот претходник, со зачудувачки високи спецификации, новиот Tiger 900 поставува нов репер за нај-агилниот, нај-динамичниот нај-способниот мотор од средна зафатнина на пазарот.'
                        ],
                        'reasons' => [
                            [
                                'title' => 'Возбудливи Авантуристички Опции',
                            'desc' => 'Доколку сакате моќен авантуристички мотр со многу технологија, конфорт и додатоци тогаш Tiger 900 серијата е создадена за вас. Серијата се состои од мотори кои се создадени за секојдненевно користење, авантуриза со “off-road“ дотатоци. Тигар 900 GT. Создаден за максимално урбано уживање, одлично за патувања на долги релации, но и за екскурзии на секое растојание помеѓу, палетата GT има перформанси, опрема и технологија за збогатување на секое возење, со самодоверба и возбуда. Тигар 900 рели. Најнапредните велосипеди со двојна намена што некогаш сме ги направиле. Тие беа дизајнирани за возбудливи авантури надвор од асфалтот, но и за секојдневно возење со апсолутна контрола и удобност. Серијата Tiger 900 Rally поставува нов репер во однос на управувањето, спецификацијата и стилот.',
                            'image' => '/images/adventure/tiger900/tiger900ReasonsImage1.avif'
                            ],
                            [
                                'title' => 'Нов 3-цилиндарски мотор од 900сс',
                                'desc' => 'Новиот 3-цилиндричен мотор од 900 cc има поголема зафатнина, е во согласност со Euro 5 и нуди подобрени перформанси на Tiger 900. Вграден е нов тајминг на палењето за да се обезбеди поживо искуство во возењето на Тигар, со до 9% поголема моќност опсегот на вртежи, како и висока максимална моќност од 95 КС при 8.750 вртежи во минута. и 10% поголем вртежен момент од претходникот Tiger 800. Новиот тајминг на Tiger 900 го подобри карактерот и звукот на моторот, нудејќи поагресивен и привлечен звук со 3 цилиндри и изразито впечатливо татнеж.'
                            ],
                            [
                                'title' => 'Дифинира Нови Стандарди',
                                'desc' => 'Максимална флексибилност и одлично ракување. Новиот Tiger 900 е до 5 килограми полесен. Комбинацијата на новата лесна рамка, новиот полесен мотор, системот за суспензија со високи спецификации и врвните ексклузивни сопирачки на Brembo, нуди големо подобрување во агилноста и способноста на велосипедот, обезбедувајќи одлично управување во сите услови на возење. Центарот на гравитација на Tiger 900 е ревидиран и поместен за 40 mm напред и 20 mm надолу, во споредба со претходниот модел од 800cc. Нуди подобра распределба на тежината меѓу тркалата и подобра рамнотежа при мали брзини, во сите услови на возење, додека го одржува одличното растојание од подлогата карактеристично за моделите Tiger.Подобрена ергономија. Потесниот профил на велосипедот ја подобрува удобноста на возачот, особено при стартување и запирање. Рачките сега се 10 mm поблиску до возачот, обезбедувајќи поудобна исправена положба на возење. Положбата на стапалата е дизајнирана специјално за секој модел на Tiger 900, во зависност од неговата ориентација. Прилагодлива висина на седиштето. Сите модели располагаат со интегриран механизам за прилагодување на висината на седлото во две позиции кој лесно се прилагодува, кој му овозможува на возачот да ја смени висината на седлото за 20 mm до положбата што најмногу му одговара. Tiger 900, Tiger 900 GT и Tiger 900 GT Pro имаат висина на седлото од 810 – 830 mm, Tiger 900 Rally и Tiger 900 Rally Pro имаат висина на седлото од 850 – 870 mm, додека верзијата Tiger 900 GT Low Ride Height има висина од седло 760 - 780 mm.',
                                'image' => '/images/adventure/tiger900/tiger900ReasonsImage2.avif'
                            ],
                            [
                                'Специјално изработени сопирачки и суспензија',
                                'Моделите Tiger 900 и Tiger 900 GT се карактеризираат со специјално дизајниран систем за потпирање на тркалата кој поставува нов репер за целиот авантуристички сегмент со средно поместување.Моделите 900 и GT ја имаат превртената вилушка на Marzocchi од 45 mm, која обезбедува 180 mm патување на тркалата. Кај моделите GT и GT Pro има и рачно прилагодување на амортизацијата за компресија и враќање.Задната суспензија нуди 170 километри патување. Моделот GT има рачно приспособување за предоптоварување и повратно прилагодување.Врвната специфика GT Pro RSU нуди ново електронски прилагодливо поставување на суспензијата, развиено во соработка со Marzocchi.Tiger 900 Rally - За поддршка на одличните теренски перформанси на серијата Tiger 900 Rally, врвните перформанси на суспензијата се обезбедени со конфигурацијата дизајнирана од Showa.И двата модели на Rally се опремени со превртена вилушка од 45 mm со рачно претходно оптоварување, враќање и прилагодување на амортизацијата на компресија, што обезбедува 240 mm патување на тркалата. На задното тркало има гасен шок RSU, кој може да се прилагоди за амортизирање пред оптоварување и враќање. Тој нуди 230 километри патување на задните тркала.Сите модели од новата гама на Tiger 900 имаат сопирачки Brembo Stylema® со врвни спецификации. Овие сопирачки ги вклучуваат највисоките перформанси на Brembo, најлесните и најмалите клешти. Намалениот волумен околу клиповите и влошките го намалува внатрешниот простор што го зафаќаат течностите за сопирачките и обезбедува понепосредна реакција и зголемен проток на воздух околу влошките, помагајќи им на клештите да се ладат побрзо и да работат уште подобро.'
                            ],
                            [
                                'title' => 'Напредна Технологија',
                                'desc' => 'Голем број технолошки иновации се вклучени во новата гама на мотоцикли Tiger 900.Моделите Tiger 900 GT и Rally со средна и висока спецификации располагаат со нов 7“ TFT дисплеј за инструменти во боја кој прикажува сеопфатни информации, како и нови ABS во свијоци и системи за контрола на тракцијата за уште подобро искуство во возењето. Опсегот нуди до шест режими на возење, за целосно прилагодување на преференциите на возачот. Технологијата на сите модели GT и Rally е на многу високо ниво и вклучува целосно LED осветлување, загреани рачки, контрола на патувањето и безбедно складирање на мобилен телефон со приклучок за полнење. Врвната технологија на моделите GT Pro и Rally Pro го вклучува вградениот систем за поврзување My Triumph Bluetooth® кој е стандарден и овозможува управување со телефонски повици, репродукција на музика, навигација чекор по свиок и контрола на камерата GoPro преку прекинувачите. Сите функции се прикажани на TFT екранот. Тука е и системот за помош на менувачот на Triumph, кој овозможува менување на брзините и спуштање без употреба на спојката, како и систем за следење на притисокот во гумите за дополнителна безбедност и удобност. Дополнително, загреаното седиште за возачот и совозачот, како и LED светлата за магла се стандардна опрема.'
                            ],
                            [
                                'title' => 'Нов Агресивен Изглед и Карактер',
                                'desc' => 'Покрај целосно новиот дизајн, новиот ексклузивен костум на Tiger ги рефлектира ревидираните завршетоци и почистите линии што му даваат на Tiger 900 поизразен и доминантен авантуристички изглед, при што секој модел има подобрени детали и карактеристики кои ја подобруваат двојната употреба или неговиот надворешен пат. ориентација.Новиот Tiger 900 ги нагласува своите можности за сите терени, како и неговата мала тежина и агилност, со тесен профил, полесен преден дел, намален целокупен волумен, поагресивно дизајниран резервоар и нова полесна рамка.Серијата GT и Rally се достапни во три ексклузивни бои, со опции Pure White, Sapphire Black и Korosi Red за моделите GT и GT Pro и Pure White, Sapphire Black и Matt Khaki за моделите Rally и Rally Pro. Основниот модел Tiger 900 е достапен во чиста бела боја.',
                                'image' => '/images/adventure/tiger900/tiger900ReasonsImage3.avif'

                            ],
                            [
                                'title' => 'Многу Аксесоари',
                                'desc' => 'Додадете можности за вашата авантура со два комплети за инспирација и повеќе од 65 оригинални додатоци на Triumph дизајнирани да ја подобрат практичноста, удобноста, перформансите и стилот на Tiger 900. Вклучувајќи нова палета на системи за багаж и заштитни додатоци. Комплетот за инспирација Trekker обединува импресивен асортиман на авантуристички багаж и додатоци за патување кои се идеални за палетата Tiger 900 GT, додека комплетот за инспирација Expedition ги подобрува теренските способности на гамата Tiger 900 Rally..'
                            ],
                            [
                                'title' => 'Ниска позиција на седиштето',
                                'desc' => 'Моделот Tiger 900 GT е достапен и во уште попристапна верзија со мала висина на седиштето. Низа меѓусебно поврзани карактеристики на дизајнот, вклучувајќи посебна вилушка, RSU амортизери и специјална конфигурација на подесувањето на суспензијата, овозможија висина на седиштето што е 50 mm пониска од основниот модел Tiger 900. Како и кај сите модели на Tiger 900, оваа верзија има вградено прилагодување на висината на седиштата од 20 mm, што му овозможува на Tiger 900 GT LRH да има висина на седиштето од 760 - 780 mm, во споредба со стандардната висина од 810 - 830 mm.'
                            ],
                            [
                                'title' => 'Додатна - висока спецификација',
                                'desc' => 'Ако барате Tiger 900 со врвни спецификации, ова се дополнителните „Pro“ карактеристики што ќе ви го разнесат умот.Карактеристики на Tiger 900 GT Pro - Новата електронски контролирана единица за задна суспензија му овозможува на возачот да го прилагоди претходното оптоварување и амортизацијата на задната суспензија преку TFT инструментите, со четири поставки за претходно оптоварување (Rider, Rider & Bagage, Rider & Pillion и Rider & Baggage & Pillion). Ова може да се комбинира со девет различни нивоа на амортизација за да се постигне идеална комбинација. Ексклузивно за врвните спецификации Pro е новиот Triumph Shift Assist систем, кој овозможува непречено и удобно менување на брзините без употреба на спојката.Има и петти режим на возење, како и режими за пат, дожд, теренски и спортски стандардни GT. GT Pro располага со исклучително корисна програмабилна програма Rider која му овозможува на возачот фино да го подеси својот велосипед за да одговара на условите. Системот за следење на притисокот во гумите (TPMS) го предупредува возачот ако притисокот во гумите падне под оптималните нивоа и е клучна карактеристика на Tiger 900 GT Pro со врвни спецификации. Дополнително, вградениот систем за поврзување My Triumph е уште една клучна карактеристика што овозможува телефонски повици, GoPro камера и управување со GPS, додека загреаното седиште за возачот и совозачот го максимизира комфорот и осветлените прекинувачи обезбедуваат одличен стил и подобрена контрола.Карактеристики на Tiger 900 Rally Pro – Ексклузивно за моделите Pro со врвни спецификации е новиот Triumph Shift Assist систем, кој обезбедува непречено и удобно менување брзини без употреба на спојката.Додека моделот Rally има четири режими на возење (Road, Rain, Off-Road и Sport), моделот Rally Pro има два дополнителни режими на возење - Rider-Programmable и Off-Road Pro - кои нудат прецизна конфигурација, за уште поекстремни возење надвор од патот и поголеми можности на нечистотија. Системот за следење на притисокот во гумите (TPMS) го предупредува возачот ако притисокот во гумите падне под оптималните нивоа и е клучна карактеристика на Tiger 900 Rally Pro со врвни спецификации. За да ја надополни врвната спецификација на Tiger 900, моделот Rally Pro располага со интегриран систем за поврзување My Triumph, загреани седишта за возачи и совозачи и иновативни прекинувачи со позадинско осветлување за уште поголемо задоволство при возењето..'
                            ],
                        ]
                    ],
                    'accessory' => [
                        'banner' => [
                            'image' => '/images/adventure/tiger900/tiger900AccessoriesHeroImage.avif'
                        ],
                        'infoText' => [
                            'title' => 'Додајте ваш белег врз Speed 400',
                            'desc' => 'На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција.'
                        ],
                        'accessoryTypes' => [
                            [
                                'title' => 'TREKKER PACK',
                                'desc' => 'Багаж ориентиран за користење на патишта за подолги патувања. Trekker Pack вклучува:.',
                                'itemsList' => [
                                    "Централен куфер и Рам за Монтирање",
                                    "Странични Куфери и Рамови за Монтирање",
                                    "Потпирач за патник за задниот куфер",
                                    "Заштита за Резервоар",
                                    "Додатно заштитно ветробранско стакло"
                                ]
                            ],
                            [
                                'title' => 'EXPEDITION PACK',
                                'desc' => 'Специјално Дизајниран Багаж за “Off-Road“ Авантури',
                                'itemsList' => [
                                    "Странични Куфери и Рамови за Монтирање",
                                    "Штитници за вилушки",
                                    "Протектор за ладник",
                                    "Заштита за резервоар",
                                    "Штитник за светло",
                                    "Торба со капацитет од 40л"
                                ]
                            ]
                        ],
                        'gallery' => [
                            'modelImage' => [
                                'src' => '/images/adventure/tiger900GtModel.png',
                                'alt' => 'Tiger 900 Range Model Image'
                            ],
                            'subFamilyHeroVideo' => [
                                'src' => '/images/adventure/tiger900E1/tiger900HeroVideo.webm',
                                'alt' => 'Tiger 900 Hero Video'
                            ],
                            'subFamilyTopSectionImage' => [
                                'src' => '/images/adventure/tiger900/tiger900TopSectionImage.avif',
                                'alt' => 'Tiger 900 Range Top-Section Image'
                            ],
                            'subFamilyTopSectionBGImage' => [
                                'src' => '/images/adventure/tiger900/tiger900TopSectionImageBG.avif',
                                'alt' => 'Tiger 900 Range Top-Section Image'
                            ]

                        ]
                    ]
                    ],
                    'tiger-sport-660' => [
                    'id' => 2,
                    'subFamilyName' => 'tiger-sport-660',
                    'title' => 'Tiger Sport 660',
                    'price' => '9590',
                    'url' => '/motorcycles/adventure/tiger-sport-660',
                    'shortDesc' => 'Тројна предност во перформансите, водечка моќ и спецификации во класата и удобна употребливост при возење - сето тоа со одлична вредност.',
                    'subFamilyPageInfo' => [
                        'heroSlogans' => ['Автентичност', 'Версатилен', '3-цилиндричен'],
                        'topSection' => [
                            'title' => 'АВТЕНТИЧНА ВИТАЛНОСТ НА ТРИ ЦИЛИНДРИ',
                            'desc' => 'Перформансна предност, класно лидерство во моќност, спецификации и удобно возење - сè тоа на одлична вредност',
                            'subtitle' => 'Дизајниран како перфектен секојдневен, градски мотор но и за уживање за време на викенд'
                        ],
                        'fullSpecs' => [
                            'engineTransmission' => [
                                [
                                    'title' => 'Тип на Мотор',
                                    'desc' => 'водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии'
                                ],
                                [
                                    'title' => 'капацитет',
                                    'desc' => '660 cc'
                                ],
                                [
                                    'title' => 'диаметар',
                                    'desc' => '74.04 mm'
                                ],
                                [
                                    'title' => 'рута',
                                    'desc' => '51.1 mm'
                                ],
                                [
                                    'title' => 'компресија',
                                    'desc' => '11.95:1'
                                ],
                                [
                                    'title' => 'Мах. Коњски Сила',
                                    'desc' => '81 PS / 80 bhp (59.6 kW) @ 10,250 rpm'
                                ],
                                [
                                    'title' => 'Мах. Обртен Момент',
                                    'desc' => '64 Nm @ 6,250 rpm'
                                ],
                                [
                                    'title' => 'Систем за убризгување',
                                    'desc' => 'Multipoint sequential electronic fuel injection with electronic throttle control'
                                ],
                                [
                                    'title' => 'Систем за Издувни гасови',
                                    'desc' => '3 во 1 не-раѓосувачки челик'
                                ],
                                [
                                    'title' => 'Финална Трансмисија',
                                    'desc' => 'X-ring chain'
                                ],
                                [
                                    'title' => 'Квачило',
                                    'desc' => 'Wet, multi-plate, slip'
                                ],
                                [
                                    'title' => 'Менувачка Кутија',
                                    'desc' => '6 брзини'
                                ]
                            ],
                            'frame' => [
                                [
                                    'title' => 'шасија',
                                    'desc' => 'тубуларна челична шасија'
                                ],
                                [
                                    'title' => 'вилушка',
                                    'desc' => 'алуминиум'
                                ],
                                [
                                    'title' => 'предно тркало',
                                    'desc' => '19 x 2.5 die-cast легура '
                                ],
                                [
                                    'title' => 'задно тркало',
                                    'desc' => '17 x 4.25 die-cast легура '
                                ],
                                [
                                    'title' => 'предна гума',
                                    'desc' => '100/90-19'
                                ],
                                [
                                    'title' => 'задна гума',
                                    'desc' => '150/70R17'
                                ],
                                [
                                    'title' => 'предна суспензија',
                                    'desc' => 'Marzocchi Inverted Fork 45mm'
                                ],
                                [
                                    'title' => 'задна суспензија',
                                    'desc' => 'Marzocchi задна суспензија со систем за подесување'
                                ],
                                [
                                    'title' => 'предни сопирачки',
                                    'desc' => 'Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS'
                                ],
                                [
                                    'title' => 'задна сопирачка',
                                    'desc' => 'Еден 255 mm диск. Brembo single piston floating caliper, ABS'
                                ],
                                [
                                    'title' => 'инструментна плочка',
                                    'desc' => '5 TFT екран'
                                ]
                            ],
                            'dimension' => [
                                [
                                    'title' => 'ширина на волан',
                                    'desc' => '830 mm'
                                ],
                                [
                                    'title' => 'висина без ретровизори',
                                    'desc' => '1410-1460 mm'
                                ],
                                [
                                    'title' => 'Solar height',
                                    'desc' => '820-840 mm'
                                ],
                                [
                                    'title' => 'мегу-осовинско растојание ',
                                    'desc' => '1556 mm'
                                ],
                                [
                                    'title' => 'Custer Corner',
                                    'desc' => '24.6 º'
                                ],
                                [
                                    'title' => 'Trace',
                                    'desc' => '133.3 mm'
                                ],
                                [
                                    'title' => 'Тежина',
                                    'desc' => '192 kg'
                                ],
                                [
                                    'title' => 'капацитет на резервоар',
                                    'desc' => '20 L'
                                ]
                            ],
                            'fuelConsumption' => [
                                [
                                    'title' => 'Потрошувачка',
                                    'desc' => '5.2l /100km'
                                ],
                                [
                                    'title' => 'CO2 загадување',
                                    'desc' => 'Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини.'
                                ]
                            ],
                            'grayCarousell' => [
                                [
                                    'id' => 'carouselItem1',
                                    'title' => 'Три-цилиндрични перформанси',
                                    'desc' => 'Располага со спортски карактер произведен од три-цилиндричниот мотор со перфектен баланс помеѓу обртен момент при мала апликација на гас и возбудлива моќност при висока апликација на гас.',
                                    'image' => '/images/adventure/tigerSport850/tiger850Caro1.avif'
                                ],
                                [
                                    'id' => 'carouselItem2',
                                    'title' => 'Технологија фокусирана на возачот',
                                    'desc' => 'Технологија од врвно ниво, сопирачки и одлична суспензија за подобро секојдневно возење со максимално чувство на самодоверба, перформанси и сигурност.',
                                    'image' => '/images/adventure/tigerSport850/tiger850Caro2.avif'
                                ],
                                [
                                    'id' => 'carouselItem3',
                                    'title' => 'Комбинација помеѓу карактер и перформанси',
                                    'desc' => 'Соилуета по која сите се вртат, со агресивни линии и ексклузивни детали .',
                                    'image' => '/images/adventure/tigerSport850/tiger850Caro3.avif'
                                ],
                                [
                                    'id' => 'carouselItem4',
                                    'title' => 'Дизајниран да инспирира самодоверба',
                                    'desc' => 'Лесно прилагодлив за сечиј возачки стил, од височината на седиштето, до воланот па се до ерканот, Tiger 850 е спремен да се прилагоди на вас.',
                                    'image' => '/images/adventure/tigerSport850/tiger850Caro4.avif'
                                ]
                            ],
                            'specNumbers' => [
                                ['data' => '660', 'info' => 'cc Мотор'],
                                ['data' => '81', 'info' => 'РЅ Коњски сили'],
                                ['data' => '64', 'info' => 'Nm Максимален Обртен Момент'],
                                ['data' => '16,000', 'info' => 'KM СЕРВИСЕН ИНТЕРВАЛ'],
                            ],
                            'youtubeVideo' => 'https://www.youtube.com/embed/QvVCEk4t8IE',
                            'audioSection' => [
                                'audio' => '/images/adventure/tigerSport660/tiger660Audio.mp3',
                                'title' => 'Богато Три-Цилиндрично Грмење',
                                'desc' => 'Звукот е снимен во живо на реален пат.',
                                'logo' => null
                            ]
                        ]
                    ],
                    'reasonsToDrive' => [
                        'banner' => [
                            'image' => '/images/adventure/tigerSport660/tiger660ReasonsBanner.avif'
                        ],
                        'infoText' => [
                            'title' => 'Дефиницијата за разноликост е да се биде најдобар во се.',
                            'desc' => 'Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто:'
                        ],
                        'reasons' => [
                            [
                                'title' => 'Перформанси од Tiger Sport Серијата',
                                'desc' => 'Equipped with the proven 660 three-cylinder engine, it is the lightest and most versatile Tiger yet. Designed to increase rider confidence from the moment you ride it, with an effortless feel on the Tiger 660. Its smooth 6-speed gearbox has been optimized for fun and agility, while the slip and assist clutch provides light engagement that reduces rider fatigue. rider, allowing you to enjoy the bike even more. The 660 delivers usable three-cylinder power with the twist of the wrist. Central to the versatility and exciting performance is the 660cc engine. A three-cylinder Triumph that beats the two-cylinder competition, delivering strong torque from low to high in the rev range, peaking at 64Nm @ 6,250rpm. Power is class-leading and utterly thrilling, peaking at 81PS @ 10,250rpm. It is smooth and linear, sporty and fun, for your daily commute or weekend pleasures.',
                                'image' => '/images/adventure/tigerSport660/tiger660ReasonsListImage1.avif'
                            ],
                            [
                                'title' => 'Перфектна Хармонија Помеѓу Моторциклот и Возачот ',
                                "desc" => 'Harmonizing with Tiger s rhythm comes naturally. It is the ultimate combination of practical performance and top thrills. The Tiger Sport 660 can be limited to an A2 license, opening doors to new adventure experiences, from touring to flexible fun driving. Designed to excite but tamed to build the confidence you need. Whether it is your first bike, your first motorcycle adventure, or a flexible means of transportation you are looking for, the Tiger Sport 660 has the technology and flair to revitalize your riding experience.'
                            ],
                            [
                                "title" => "Инспирира Самодоверба",
                                "desc" => "Riding confidence is at the forefront of the adventure, setting off for a ride knowing that Tiger Sport's rider-focused technology and premium brakes and suspension are there to support you every moment. The upright stance with the lightweight frame and nimble engine make for a nimble and easy feel, without ever being intimidating. Add in the narrow riding position for easy ground contact, the low 835mm seat height and the excellent ergonomics setup and you have a bike with great agility and handling in any riding scenario.",
                                "image" => "/images/adventure/tigerSport660/tiger660ReasonsImage2.avif"
                            ],
                            [
                                "title" => "Направен за Вас",
                                "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                            ],
                            [
                                "title" => "Секој ден, Цел Ден",
                                "desc" => "It's the journey that counts, not the destination, but the Tiger Sport 660 is designed to offer the ultimate in road adventure comfort. Featuring premium Showa 41mm separate function forks, Showa monoshock with remote hydraulically adjustable preload, slip and assist clutch, Road and Rain riding programs and the latest Triumph ABS technology and traction control program deactivation. From top to bottom the Tiger is designed to reduce fatigue and enhance your comfort to continue your adventure, with or without a passenger."
                            ],
                            [
                                "title" => "Максимална искористливост",
                                "desc" => "With its 17-litre fuel tank and top-of-the-line specification, the new Tiger Sport is ready for any adventure. Whether it's your daily commute, epic journeys with friends or maneuvering in tight urban spaces, the ride is anything but boring. The Tiger Sport's lightweight frame, road adventure setup and sporty feel make it the ultimate companion. Ready for the hard work of your daily commute revitalizing your work week but also fully capable of weekend jaunts and touring fun.",
                                "image" => "/images/adventure/tigerSport660/tiger660ReasonsImage3.avif"
                            ],
                            [
                                "title" => "Прекрасна Зделка",
                                "desc" => "The Tiger Sport 660's state-of-the-art technology, high-spec brakes, tires and suspension, confidence-inspiring agile handling, thrilling performance from the three-cylinder engine, unique styling and a very competitive price all combine to make it the perfect sporty choice. mid-range adventure - and the perfect entry point to the Triumph range. A leading service interval of 16,000km (or 12 months) and the lowest required service time in the segment also contribute to incredibly low running costs."
                            ],
                            [
                                "title" => "Уникатен Стил",
                                "desc" => "A new generation Tiger Sport in every way, with all the benefits of Triumph's class-redefining 660cc three-cylinder engine. Strong. Versatile. And with its thoughtful design, it embodies the modern Triumph style and character. The upright and imposing adventure stance, the protective gel and refined ergonomics promise comfort and thrills throughout your ride. All-new Tiger Sport 660 color schemes, class-leading premium finish and over 40 accessories will make the bike an absolute eye-catcher. Unmistakably Triumph, and the new perfectly-rounded mid-range adventure sports bike."
                            ]
                        ]
                    ],
                    "accessory" => [
                        "banner" => [
                            "image" => "/images/adventure/tigerSport660/tigerSport660AccesoryHero.avif"
                          ],
                          "infoText" => [
                            "title" => "Персонализирајте го вашиот Tiger Sport 660"
                          ],
                          "accessoryTypes" => [
                            [
                                "title" => "Додатоци",
                                "desc" => "Подобрете ја способноста за патување на долги растојанија со целосно интегрирани панталони и средишна покривка од 47 литри со капацитет за две кациги, сите во бојата на велосипедот. Елегантниот дизајн со единствена брава со единствен клуч ќе ги одржува вашите работи суви, заштитени и безбедни. Без разлика дали чувате лаптоп, два шлемови за цело лице или вреќи за спиење, стилскиот багаж ќе додаде практичност и флексибилност во вашиот секојдневен живот. Tiger Sport 660 доаѓа со дискретно интегрирани држачи како стандард, овозможувајќи лесно монтирање на додатоците за обложување, а истовремено задржувајќи го целиот чист стил на Tiger на задната страна кога не се инсталирани табли. Додајте ги целосно водоотпорните внатрешни кеси за да ги заштитите вашите работи од елементите, кои лесно се отстрануваат кога ќе стигнете до вашата дестинација. Други додатоци вклучуваат:",
                                "itemsList" => [
                                    "Целосно Интегрирани Куфери",
                                    "Централен Куфер за Две Кациги",
                                    "Водо-отпорни Торби",
                                    "Алуминиумски Држачи за Куфери со Интегрирани Рачки за Патникот",
                                    "Централен Држач за Монтирање на Куфер",
                                    "Заден Потпирач за Патникот"
                                  ],
                                  "image1" => [
                                    "src" => "/images/adventure/tigerSport660/tigerSport660Accessory1.avif",
                                    "alt" => "Tiger Sport 660 Luggage"
                                  ]
                            ],
                            [
                                "title" => "Заштита",
                                "desc" => "Стравот од пад не треба да виси над вас - додадете ја потребната заштита за мир на умот во секој маневар. Возете самоуверено со капаците на моторот, заштитниците на рамката и вилушката и комплетирајте го изгледот со јаболката и рачките во боја на велосипедот.",
                                "itemsList" => [
                                    "Заштитник на мотор",
                                    "Заштитник на шасија",
                                    "Заштита на вилушки",
                                    "Заштита на Боја",
                                    "Штитници за Дланки",
                                    "Гумена заштита на резервоар"
                                  ],
                                  'image1' => [
                                    "src" => "/images/adventure/tigerSport660/tigerSport660Accessory2.avif",
                                    "alt" => "Tiger Sport 660 Safety"
                                  ]
                            ],
                            [
                                "title" => "технологија",
                                "desc" => "Задржете се во бојата на мотоциклот Додадете повеќе практичност и интеракција со возачот со единицата My Triumph Connectivity, овозможувајќи навигација чекор-по-сврт, контрола на камерата GoPro, функционалност на телефонот и музиката, сето тоа контролирано преку прекинувачите на рачката и прикажано на TFT екранот. Чувајте ги вашите лични уреди наполнети за секое возење со пригодниот приклучок за полнење USB под седлото и опцијата за приклучок од 12V што се наоѓа на левата страна од кокпитот. Има и Triumph Shift Assist брз менувач за брзи поместувања без спојка додека се одржува позицијата на гасот. Исто така, за поудобно возење во текот на целата година, внатрешните жици на воланот се веќе инсталирани ако изберете да го додадете комплетот за грип со греење. Ова обезбедува три поставки за температура, избрани преку паметно интегрираното копче. Можете исто така да додадете тркалачки LED индикатори и светли LED помошни светла за зголемена видливост и комплетен авантуристички стил (во зависност од земјата) . Системот за следење на притисокот во гумите (TPMS) е исто така одлична безбедносна помош што ќе ве предупреди рано за секое губење на притисокот во гумите. На споредливите пазари, комплетот за конверзија на лиценца А2 со држач за вртење APS и ексклузивно подесување на моторот ќе го ограничи велосипедот на 35 kW. Ова е лесно реверзибилно од дилер на Triumph штом ќе се добие целосното ослободување.",
                                'itemList' => [
                                    "Triumph Connectivity ",
                                    "USB и 12 волтни влезови за полнење под седиштето",
                                    "Triumph Shift Assist",
                                    "Интегрирани Греачи на Рачки на Волан",
                                    "LED Трапкачи",
                                    "LED Дополнителни Светла",
                                    "Мониторинг за Притисок На Пневматици",
                                    "A2 Fold Limit Ki"
                                ],
                                'image1' => [
                                    "src" => "/images/adventure/tigerSport660/tigerSport660Accessory3.avif",
                                    "alt" => "Tiger Sport 660 Luggage"
                                ]
                            ],
                            [
                                "title" => "Сигурност",
                                "desc" => "Во зависност од достапноста на локалниот пазар, алармот Triumph Protect+ или тракерот Triumph Track+ може да ги одврати потенцијалните крадци и да помогне во обновувањето доколку се случи незамисливото. Овие безбедносни уреди одобрени од Тачам доаѓаат со луксузни клучеви од брендот Triumph.",
                                'itemsList' => [
                                    "Triumph Connectivity ",
                                    "USB и 12 волтни влезови за полнење под седиштето",
                                    "Triumph Shift Assist",
                                    "Интегрирани Греачи на Рачки на Волан",
                                    "LED Трапкачи",
                                    "LED Дополнителни Светла",
                                    "Мониторинг за Притисок На Пневматици",
                                    "A2 Fold Limit Ki"
                                ],
                                'image1' => [
                                    "src" => "/images/adventure/tigerSport660/tigerSport660Accessory4.avif",
                                    "alt" => "Tiger Sport 660 Security"
                                ],
                                'image2' => [
                                    "src" => "/images/adventure/tigerSport660/tigerSport660Accessory5.avif",
                                    "alt" => "Tiger Sport 660"
                                ]
                            ]

                          ]
                    ],
                    "shortSpecInfo" => [
                        "info1" => "660cc мотор",
                        "info2" => "Водечки во класата по способност и ракување",
                        "info3" => "Далечински прилагодлива Showa суспензија"
                    ],
                    "gallery" => [
                        "modelImage" => [
                            "src" => "/images/adventure/tigerSport660Model.png",
                            "alt" => "Tiger Sport 660 Range Model Image"
                        ],
                        'subFamilyHeroVideo' => [
                            "src" => "/images/adventure/tigerSport660/heroVideo.webm",
                            "alt" => "Tiger Sport 660 Range Hero Image"
                        ],
                        'subFamilyTopSectionImage' => [
                            "src" => "/images/adventure/tigerSport660/tiger660TopSection.avif",
                            "alt" => "Tiger Sport 660 Range Top-Section Image"
                        ],
                        'subFamilyTopSectionBGImage' => [
                            "src" => "/images/adventure/tigerSport660/tiger660TopSectionBG.avif",
                            "alt" => "Tiger Sport 660 Range Top-Section Image"
                        ]
                    ]
                    ],
                    "tiger-850-sport" => [
                    "id" => 3,
                    "subFamilyName" => 'tiger-850-sport',
                    "title" => "Tiger 850 Sport",
                    "price" => 12890,
                    "url" => "/motorcycles/adventure/tiger-850-sport",
                    "shortDesc" => "Прилагодлив на секој предизвик а сепак карактерот, агилноста и перформансите на Tiger, со завидувачки дизајн  и адаптабилност за сите потреби.",
                    "subFamilyPageInfo" => [
                        "heroSlogans" =>  ["практичен", "неверојатен"],
                        "topSection" => [
                            "title" => "ПЕРФОРАМАНСИ КОИ ИНСПИРИРААТ",
                            "desc" => "Tiger 850 Sport поставува нови стандарди за на патиштата, во градска средина, за патување и за било која голема животна авантура.",
                            "subtitle" => "перфектен - повеќенамеснки мотор, со одличен баланс помеѓу пристапност и дневното користење"
                        ],
                    "fullSpecs" => [
                        "engineTransmission" => [
                            [
                                "title" => "Тип на Мотор",
                                "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                            ],
                            [
                                "title" => "капацитет",
                                "desc" => "660 cc"
                            ],
                            [
                                "title" => "диаметар",
                                "desc" => "74.04 mm"
                            ],
                            [
                                "title" => "рута",
                                "desc" => "51.1 mm"
                            ],
                            [
                                "title" => "компресија",
                                "desc" => "11.95:1"
                            ],
                            [
                                "title" => "Мах. Коњски Сила",
                                "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                            ],
                            [
                                "title" => "Мах. Обртен Момент",
                                "desc" => "64 Nm @ 6,250 rpm"
                            ],
                            [
                                "title" => "Систем за убризгување",
                                "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                            ],
                            [
                                "title" => "Систем за Издувни гасови",
                                "desc" => "3 во 1 не-раѓосувачки челик"
                            ],
                            [
                                "title" => "Финална Трансмисија",
                                "desc" => "X-ring chain"
                            ],
                            [
                                "title" => "Квачило",
                                "desc" => "Wet, multi-plate, slip"
                            ],
                            [
                                "title" => "Менувачка Кутија",
                                "desc" => "6 брзини"
                            ]
                        ],
                        "frame" => [
                            [
                                "title" => "шасија",
                                "desc" => "тубуларна челична шасија"
                            ],
                            [
                                "title" => "вилушка",
                                "desc" => "алуминиум"
                            ],
                            [
                                "title" => "предно тркало",
                                "desc" => "19 x 2.5' die-cast легура "
                            ],
                            [
                                "title" => "задно тркало",
                                "desc" => "17 x 4.25' die-cast легура "
                            ],
                            [
                                "title" => "предна гума",
                                "desc" => "100/90-19"
                            ],
                            [
                                "title" => "задна гума",
                                "desc" => "150/70R17"
                            ],
                            [
                                "title" => "предна суспензија",
                                "desc" => "Marzocchi Inverted Fork 45mm"
                            ],
                            [
                                "title" => "задна суспензија",
                                "desc" => "Marzocchi задна суспензија со систем за подесување"
                            ],
                            [
                                "title" => "предни сопирачки",
                                "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                            ],
                            [
                                "title" => "задна сопирачка",
                                "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                            ],
                            [
                                "title" => "инструментна плочка",
                                "desc" => "5 TFT екран"
                            ]
                        ],
                        "dimension" => [
                            [
                                'title' => 'ширина на волан',
                                'desc' => '830 mm'
                            ],
                            [
                                "title" => "висина без ретровизори",
                                "desc" => "1410-1460 mm"
                            ],
                            [
                                "title" => "Solar height",
                                "desc" => "820-840 mm"
                            ],
                            [
                                "title" => "мегу-осовинско растојание ",
                                "desc" => "1556 mm"
                            ],
                            [
                                "title" => "Custer Corner",
                                "desc" => "24.6 º"
                            ],
                            [
                                "title" => "Trace",
                                "desc" => "133.3 mm"
                            ],
                            [
                                "title" => "Тежина",
                                "desc" => "192 kg"
                            ],
                            [
                                "title" => "капацитет на резервоар",
                                "desc" => "20 L"
                            ]
                        ],
                        "fuelConsumption" => [
                            [
                                "title" => "Потрошувачка",
                                "desc" => "5.2l /100km"
                            ],
                            [
                                "title" => "CO2 загадување",
                                "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                            ]
                        ]
                    ],
                    "grayCarousell" => [
                        [
                            "id" => "carouselItem1",
                            "title" => "Возбудлив Три Цилиндарски Мотор",
                            "desc" => "Почувствувајте го карактерот на моторот и чувството на лесно управување со иновативната T-crank радалица и најновиот 850 три-цилиндричен мотор.",
                            "image" => "/images/adventure/tigerSport850/tiger850Caro1.avif"
                        ],
                        [
                            "id" => "carouselItem2",
                            "title" => "Технологија фокусирана на возачот",
                            "desc" => "Технологија од врвно ниво, сопирачки и одлична суспензија за подобро секојдневно возење со максимално чувство на самодоверба, перформанси и сигурност.",
                            "image" => "/images/adventure/tigerSport850/tiger850Caro2.avif"
                        ],
                        [
                            "id" => "carouselItem3",
                            "title" => "Комбинација помеѓу карактер и перформанси",
                            "desc" => "Соилуета по која сите се вртат, со агресивни линии и ексклузивни детали .",
                            "image" => "/images/adventure/tigerSport850/tiger850Caro3.avif"
                        ],
                        [
                            "id" => "carouselItem4",
                            "title" => "Дизајниран да инспирира самодоверба",
                            "desc" => "Лесно прилагодлив за сечиј возачки стил, од височината на седиштето, до воланот па се до ерканот, Tiger 850 е спремен да се прилагоди на вас.",
                            "image" => "/images/adventure/tigerSport850/tiger850Caro4.avif"
                        ],
                    ],
                    "soundSection" => [
                        "desc" => "Уникатен звук произведен од три-цилиндричниот мотор со T-crank радалица.",
                        "audio" => "/images/adventure/tiger850Sport/tigerSound.mp3"
                    ],
                    "specNumbers" => [
                        [ "data" => "888", "info" => "cc Мотор" ],
                        [ "data" => "85", "info" => "РЅ Коњски сили" ],
                        [ "data" => "82", "info" => "Nm Максимален Обртен Момент" ],
                        [ "data" => "60+", "info" => "Аксесоари" ]
                    ]
                    ],
                    "reasonsToDrive" => [
                    "banner" => [
                        "image" => "/images/adventure/tigerSport660/tiger660ReasonsBanner.avif"
                    ],
                    "infoText" => [
                        "title" => "Дефиницијата за разноликост е да се биде најдобар во се.",
                        "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто:"
                    ],
                    "reasons" => [
                        [
                        "title" => "Перформанси од Tiger Sport Серијата",
                        "desc" => "Equipped with the proven 660 three-cylinder engine, it is the lightest and most versatile Tiger yet. Designed to increase rider confidence from the moment you ride it, with an effortless feel on the Tiger 660. Its smooth 6-speed gearbox has been optimized for fun and agility, while the slip and assist clutch provides light engagement that reduces rider fatigue. rider, allowing you to enjoy the bike even more. The 660 delivers usable three-cylinder power with the twist of the wrist. Central to the versatility and exciting performance is the 660cc engine. A three-cylinder Triumph that beats the two-cylinder competition, delivering strong torque from low to high in the rev range, peaking at 64Nm @ 6,250rpm. Power is class-leading and utterly thrilling, peaking at 81PS @ 10,250rpm. It is smooth and linear, sporty and fun, for your daily commute or weekend pleasures.",
                        "image" => "/images/adventure/tigerSport660/tiger660ReasonsListImage1.avif"
                        ],
                        [
                        "title" => "Перфектна Хармонија Помеѓу Моторциклот и Возачот ",
                        "desc" => "Harmonizing with Tiger's rhythm comes naturally. It is the ultimate combination of practical performance and top thrills. The Tiger Sport 660 can be limited to an A2 license, opening doors to new adventure experiences, from touring to flexible fun driving. Designed to excite but tamed to build the confidence you need. Whether it's your first bike, your first motorcycle adventure, or a flexible means of transportation you're looking for, the Tiger Sport 660 has the technology and flair to revitalize your riding experience."
                        ],
                        [
                        "title" => "Инспирира Самодоверба",
                        "desc" => "Riding confidence is at the forefront of the adventure, setting off for a ride knowing that Tiger Sport's rider-focused technology and premium brakes and suspension are there to support you every moment. The upright stance with the lightweight frame and nimble engine make for a nimble and easy feel, without ever being intimidating. Add in the narrow riding position for easy ground contact, the low 835mm seat height and the excellent ergonomics setup and you have a bike with great agility and handling in any riding scenario.",
                        "image" => "/images/adventure/tigerSport660/tiger660ReasonsImage2.avif"
                        ],
                        [
                        "title" => "Направен за Вас",
                        "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                        [
                        "title" => "Секој ден, Цел Ден",
                        "desc" => "It's the journey that counts, not the destination, but the Tiger Sport 660 is designed to offer the ultimate in road adventure comfort. Featuring premium Showa 41mm separate function forks, Showa monoshock with remote hydraulically adjustable preload, slip and assist clutch, Road and Rain riding programs and the latest Triumph ABS technology and traction control program deactivation. From top to bottom the Tiger is designed to reduce fatigue and enhance your comfort to continue your adventure, with or without a passenger."
                        ],
                        [
                        "title" => "Максимална искористливост",
                        "desc" => "With its 17-litre fuel tank and top-of-the-line specification, the new Tiger Sport is ready for any adventure. Whether it's your daily commute, epic journeys with friends or maneuvering in tight urban spaces, the ride is anything but boring. The Tiger Sport's lightweight frame, road adventure setup and sporty feel make it the ultimate companion. Ready for the hard work of your daily commute revitalizing your work week but also fully capable of weekend jaunts and touring fun.",
                        "image" => "/images/adventure/tigerSport660/tiger660ReasonsImage3.avif"
                        ],
                        [
                        "title" => "Прекрасна Зделка",
                        "desc" => "The Tiger Sport 660's state-of-the-art technology, high-spec brakes, tires and suspension, confidence-inspiring agile handling, thrilling performance from the three-cylinder engine, unique styling and a very competitive price all combine to make it the perfect sporty choice. mid-range adventure - and the perfect entry point to the Triumph range. A leading service interval of 16,000km (or 12 months) and the lowest required service time in the segment also contribute to incredibly low running costs."
                        ],
                        [
                        "title" => "Уникатен Стил",
                        "desc" => "A new generation Tiger Sport in every way, with all the benefits of Triumph's class-redefining 660cc three-cylinder engine. Strong. Versatile. And with its thoughtful design, it embodies the modern Triumph style and character. The upright and imposing adventure stance, the protective gel and refined ergonomics promise comfort and thrills throughout your ride. All-new Tiger Sport 660 color schemes, class-leading premium finish and over 40 accessories will make the bike an absolute eye-catcher. Unmistakably Triumph, and the new perfectly-rounded mid-range adventure sports bike."
                        ]
                    ]
                    ],
                    "accessory" => [
                    "banner" => [
                        "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                    ],
                    "infoText" =>[
                    "title" => "Додајте ваш белег врз Speed 400",
                    "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                    ],
                    "accessoryTypes" => [
                    [
                    "title" => "Стил и Комфорт",
                    "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                    "itemsList" => [
                        "Bullet type LED flash",
                        "Штитници за колена",
                        "Комфортно Седло"
                    ],
                    "image1" => [
                    "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                    "alt" => "Speed 400 On The Road"
                    ],
                    "image2" => [
                    "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                    "alt" => "Speed 400 PaintJob"
                    ]
                    ],
                    [
                    "title" => "Багаж",
                    "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                        "itemsList" => [
                          "Цврсти Куфери за Багаж",
                          "Држач за Багаж",
                          "Најлонска торба за на резервоар",
                          "Најлонска Торба Roll "
                        ],
                    "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                        "alt" => "Speed 400 Luggage"
                        ]
                    ],
                    [
                        "title" => "Заштита ",
                        "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                        "itemsList" => [
                          "Гелатин",
                          "Заштита за ладник",
                          "Решетка за светло",
                          "Алуминиумска заштита",
                          "Заштита од Кал",
                          "Цевки за Заштита на Мотор (Горни и Долни)"
                        ],
                        "image1" => [
                          "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                          "alt" => "Speed 400 Head"
                        ],
                        "image2" => [
                          "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                          "alt" => "speed 400 Accessory Radiator Protection"
                        ]
                    ]

                 ]
                    ],
                    "shortSpecInfo" => [
                    "info1" => "888cc T-plane мотор",
                    "info2" => "Авантуристичко настроен патнички мотор",
                    "info3" => "20 литарски резервоар",
                    "info4" => "60+ аксесоари"
                    ],
                    "gallery" => [
                    "modelImage" => [
                        "src" => "/images/adventure/tiger850Sport.png",
                        "alt" => "Tiger 850 Sport Model Image"
                    ],
                    "subFamilyHeroVideo" => [
                        "src" => "/images/adventure/tigerSport850/tigerSport850HeroVideo.webm",
                        "alt" => "Tiger Sport 850 Range Hero Image"
                    ],
                    "subFamilyTopSectionImage" => [
                        "src" => "/images/adventure/tigerSport850/tiger850TopSection.avif",
                        "alt" => "Tiger Sport 850 Range Top-Section Image"
                    ],
                    "subFamilyTopSectionBGImage" => [
                        "src" => "/images/adventure/tigerSport850/tigerSport850TopSectionBG.avif",
                        "alt" => "Tiger Sport 850 Range Top-Section Image"
                    ]
                 ]

                ],
                "tiger-1200-gt" => [
                    "id" => 4,
                    "subFamilyName" => "tiger-1200-gt",
                    "title" => "Tiger 1200 GT",
                    "price" => 20990,
                    "url" => "/motorcycles/adventure/tiger-1200-gt",
                    "shortDesc" => "Врвен авантуристички мотор фокусиран за асфалтни подлоги. Интер-континентални можности, со висока комоција, перформанси и стил.",
                    "subFamilyPageInfo" => [
                      "heroSlogans" => ["Вие ја ", "креирате", "авантурата"],
                      "topSection" => [
                        "title" => "ТРАНСФОРМИРАЈТЕ ЈА ВАШАТА АВАНТУРА",
                        "desc" => "Ултимативниот авантуристички моторцикл фокусиран на асфалтот. Интерконтинентални можности, неверојатен комфорт, перформанси и стил.",
                        "subtitle" => "Нај-способниот, нај-версатилниот, и агилен мотор, со најголемата зафатнина на мотор во целиот свет"
                      ],
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "660 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "74.04 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "51.1 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "11.95 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "64 Nm @ 6,250 rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "X-ring chain"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Wet, multi-plate, slip"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "тубуларна челична шасија"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "19 x 2.5' die-cast легура "
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "17 x 4.25' die-cast легура "
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "100/90-19"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "150/70R17"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Marzocchi Inverted Fork 45mm"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Marzocchi задна суспензија со систем за подесување"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                          ],
                          [
                            "title" => "инструментна плочка",
                            "desc" => "5 TFT екран"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "830 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1410-1460 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "820-840 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1556 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "24.6 º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "133.3 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "192 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "20 L"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "5.2l /100km"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                          ]
                        ]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "Возбудлив Три Цилиндарски Мотор",
                          "desc" => "Почувствувајте го карактерот на моторот и чувството на лесно управување со иновативната T-crank радалица и најновиот 850 три-цилиндричен мотор.",
                          "image" => "/images/adventure/tigerSport850/tiger850Caro1.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "Технологија фокусирана на возачот",
                          "desc" => "Технологија од врвно ниво, сопирачки и одлична суспензија за подобро секојдневно возење со максимално чувство на самодоверба, перформанси и сигурност.",
                          "image" => "/images/adventure/tigerSport850/tiger850Caro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Комбинација помеѓу карактер и перформанси",
                          "desc" => "Соилуета по која сите се вртат, со агресивни линии и ексклузивни детали .",
                          "image" => "/images/adventure/tigerSport850/tiger850Caro3.avif"
                        ],
                        [
                          "id" => "carouselItem4",
                          "title" => "Дизајниран да инспирира самодоверба",
                          "desc" => "Лесно прилагодлив за сечиј возачки стил, од височината на седиштето, до воланот па се до ерканот, Tiger 850 е спремен да се прилагоди на вас.",
                          "image" => "/images/adventure/tigerSport850/tiger850Caro4.avif"
                        ]
                      ],
                      "specNumbers" => [
                        [ "data" => "888", "info" => "cc Мотор" ],
                        [ "data" => "85", "info" => "РЅ Коњски сили" ],
                        [ "data" => "82", "info" => "Nm Максимален Обртен Момент" ],
                        [ "data" => "60+", "info" => "Аксесоари" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/adventure/tigerSport660/tiger660ReasonsBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Дефиницијата за разноликост е да се биде најдобар во се.",
                        "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                      ],
                      "reasons" => [
                        [
                          "title" => "Перформанси од Tiger Sport Серијата",
                          "desc" => "Equipped with the proven 660 three-cylinder engine, it is the lightest and most versatile Tiger yet. Designed to increase rider confidence from the moment you ride it, with an effortless feel on the Tiger 660. Its smooth 6-speed gearbox has been optimized for fun and agility, while the slip and assist clutch provides light engagement that reduces rider fatigue. rider, allowing you to enjoy the bike even more. The 660 delivers usable three-cylinder power with the twist of the wrist. Central to the versatility and exciting performance is the 660cc engine. A three-cylinder Triumph that beats the two-cylinder competition, delivering strong torque from low to high in the rev range, peaking at 64Nm @ 6,250rpm. Power is class-leading and utterly thrilling, peaking at 81PS @ 10,250rpm. It is smooth and linear, sporty and fun, for your daily commute or weekend pleasures.",
                          "image" => "/images/adventure/tigerSport660/tiger660ReasonsListImage1.avif"
                        ],
                        [
                          "title" => "Перфектна Хармонија Помеѓу Моторциклот и Возачот ",
                          "desc" => "Harmonizing with Tiger's rhythm comes naturally. It is the ultimate combination of practical performance and top thrills. The Tiger Sport 660 can be limited to an A2 license, opening doors to new adventure experiences, from touring to flexible fun driving. Designed to excite but tamed to build the confidence you need. Whether it's your first bike, your first motorcycle adventure, or a flexible means of transportation you're looking for, the Tiger Sport 660 has the technology and flair to revitalize your riding experience."
                        ],
                        [
                          "title" => "Инспирира Самодоверба",
                          "desc" => "Riding confidence is at the forefront of the adventure, setting off for a ride knowing that Tiger Sport's rider-focused technology and premium brakes and suspension are there to support you every moment. The upright stance with the lightweight frame and nimble engine make for a nimble and easy feel, without ever being intimidating. Add in the narrow riding position for easy ground contact, the low 835mm seat height and the excellent ergonomics setup and you have a bike with great agility and handling in any riding scenario.",
                          "image" => "/images/adventure/tigerSport660/tiger660ReasonsImage2.avif"
                        ],
                        [
                          "title" => "Направен за Вас",
                          "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                        [
                          "title" => "Секој ден, Цел Ден",
                          "desc" => "It's the journey that counts, not the destination, but the Tiger Sport 660 is designed to offer the ultimate in road adventure comfort. Featuring premium Showa 41mm separate function forks, Showa monoshock with remote hydraulically adjustable preload, slip and assist clutch, Road and Rain riding programs and the latest Triumph ABS technology and traction control program deactivation. From top to bottom the Tiger is designed to reduce fatigue and enhance your comfort to continue your adventure, with or without a passenger."
                        ],
                        [
                          "title" => "Максимална искористливост",
                          "desc" => "With its 17-litre fuel tank and top-of-the-line specification, the new Tiger Sport is ready for any adventure. Whether it's your daily commute, epic journeys with friends or maneuvering in tight urban spaces, the ride is anything but boring. The Tiger Sport's lightweight frame, road adventure setup and sporty feel make it the ultimate companion. Ready for the hard work of your daily commute revitalizing your work week but also fully capable of weekend jaunts and touring fun.",
                          "image" => "/images/adventure/tigerSport660/tiger660ReasonsImage3.avif"
                        ],
                        [
                          "title" => "Прекрасна Зделка",
                          "desc" => "The Tiger Sport 660's state-of-the-art technology, high-spec brakes, tires and suspension, confidence-inspiring agile handling, thrilling performance from the three-cylinder engine, unique styling and a very competitive price all combine to make it the perfect sporty choice. mid-range adventure - and the perfect entry point to the Triumph range. A leading service interval of 16,000km (or 12 months) and the lowest required service time in the segment also contribute to incredibly low running costs."
                        ],
                        [
                          "title" => "Уникатен Стил",
                          "desc" => "A new generation Tiger Sport in every way, with all the benefits of Triumph's class-redefining 660cc three-cylinder engine. Strong. Versatile. And with its thoughtful design, it embodies the modern Triumph style and character. The upright and imposing adventure stance, the protective gel and refined ergonomics promise comfort and thrills throughout your ride. All-new Tiger Sport 660 color schemes, class-leading premium finish and over 40 accessories will make the bike an absolute eye-catcher. Unmistakably Triumph, and the new perfectly-rounded mid-range adventure sports bike."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Стил и Комфорт",
                          "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                          "itemsList" => [
                            "Bullet type LED flash",
                            "Штитници за колена",
                            "Комфортно Седло"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                            "alt" => "Speed 400 On The Road"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                            "alt" => "Speed 400 PaintJob"
                          ]
                        ],
                        [
                          "title" => "Багаж",
                          "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                          "itemsList" => [
                            "Цврсти Куфери за Багаж",
                            "Држач за Багаж",
                            "Најлонска торба за на резервоар",
                            "Најлонска Торба Roll "
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                            "alt" => "Speed 400 Luggage"
                          ]
                        ],
                        [
                          "title" => "Заштита ",
                          "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                          "itemsList" => [
                            "Гелатин",
                            "Заштита за ладник",
                            "Решетка за светло",
                            "Алуминиумска заштита",
                            "Заштита од Кал",
                            "Цевки за Заштита на Мотор (Горни и Долни)"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                            "alt" => "Speed 400 Head"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                            "alt" => "speed 400 Accessory Radiator Protection"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "1,160 cc T-plane мотор",
                      "info2" => "Мотор со високи перформанси",
                      "info3" => "3 години гаранција"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/adventure/tiger1200GtModel.png",
                        "alt" => "Tiger 1200 Gt Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/adventure/tiger1200GT/tiger1200GTHeroVideo.webm",
                        "alt" => "Tiger Sport 850 Range Hero Image"
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/adventure/tiger1200GT/tiger1200GTTopSection.avif",
                        "alt" => "Tiger Sport 850 Range Top-Section Image"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/adventure/tiger1200GT/tiger1200GTTopSectionBG.avif",
                        "alt" => "Tiger Sport 850 Range Top-Section Image"
                      ]
                    ]
                ],

                "tiger-1200-rally" => [
                    "id" => 5,
                    "subFamilyName" => "tiger-1200-rally",
                    "title" => "Tiger 1200 Rally",
                    "price" => 21990,
                    "url" => "/motorcycles/adventure/tiger-1200-gt",
                    "shortDesc" => "",
                    "subFamilyPageInfo" => [
                      "heroSlogans" => ["оживеј", "ја", "авантурата"],
                      "topSection" => [
                        "title" => "Откриј ја Авантурата",
                        "desc" => "Изграден за секаков пат. Најновиот авантуристички шампион ве води низе светот, низ пустина и совладува планини.",
                        "subtitle" => "Новиот репер за авантури. Нај-возбудливиот нај-способниот, комфортен и версатилен Tiger 1200 мотор досега."
                      ],
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "660 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "74.04 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "51.1 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "11.95 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "64 Nm @ 6,250 rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "X-ring chain"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Wet, multi-plate, slip"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "тубуларна челична шасија"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "19 x 2.5' die-cast легура "
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "17 x 4.25' die-cast легура "
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "100/90-19"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "150/70R17"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Marzocchi Inverted Fork 45mm"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Marzocchi задна суспензија со систем за подесување"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                          ],
                          [
                            "title" => "инструментна плочка",
                            "desc" => "5 TFT екран"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "830 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1410-1460 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "820-840 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1556 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "24.6 º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "133.3 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "192 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "20 L"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "5.2l /100km"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                          ]
                        ]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "Возбудлив Три Цилиндарски Мотор",
                          "desc" => "Почувствувајте го карактерот на моторот и чувството на лесно управување со иновативната T-crank радалица и најновиот 850 три-цилиндричен мотор.",
                          "image" => "/images/adventure/tigerSport850/tiger850Caro1.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "Технологија фокусирана на возачот",
                          "desc" => "Технологија од врвно ниво, сопирачки и одлична суспензија за подобро секојдневно возење со максимално чувство на самодоверба, перформанси и сигурност.",
                          "image" => "/images/adventure/tigerSport850/tiger850Caro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Комбинација помеѓу карактер и перформанси",
                          "desc" => "Соилуета по која сите се вртат, со агресивни линии и ексклузивни детали .",
                          "image" => "/images/adventure/tigerSport850/tiger850Caro3.avif"
                        ],
                        [
                          "id" => "carouselItem4",
                          "title" => "Дизајниран да инспирира самодоверба",
                          "desc" => "Лесно прилагодлив за сечиј возачки стил, од височината на седиштето, до воланот па се до ерканот, Tiger 850 е спремен да се прилагоди на вас.",
                          "image" => "/images/adventure/tigerSport850/tiger850Caro4.avif"
                        ]
                      ],
                      "specNumbers" => [
                        [ "data" => "888", "info" => "cc Мотор" ],
                        [ "data" => "85", "info" => "РЅ Коњски сили" ],
                        [ "data" => "82", "info" => "Nm Максимален Обртен Момент" ],
                        [ "data" => "60+", "info" => "Аксесоари" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/adventure/tigerSport660/tiger660ReasonsBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Дефиницијата за разноликост е да се биде најдобар во се.",
                        "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                      ],
                      "reasons" => [
                        [
                          "title" => "Перформанси од Tiger Sport Серијата",
                          "desc" => "Equipped with the proven 660 three-cylinder engine, it is the lightest and most versatile Tiger yet. Designed to increase rider confidence from the moment you ride it, with an effortless feel on the Tiger 660. Its smooth 6-speed gearbox has been optimized for fun and agility, while the slip and assist clutch provides light engagement that reduces rider fatigue. rider, allowing you to enjoy the bike even more. The 660 delivers usable three-cylinder power with the twist of the wrist. Central to the versatility and exciting performance is the 660cc engine. A three-cylinder Triumph that beats the two-cylinder competition, delivering strong torque from low to high in the rev range, peaking at 64Nm @ 6,250rpm. Power is class-leading and utterly thrilling, peaking at 81PS @ 10,250rpm. It is smooth and linear, sporty and fun, for your daily commute or weekend pleasures.",
                          "image" => "/images/adventure/tigerSport660/tiger660ReasonsListImage1.avif"
                        ],
                        [
                          "title" => "Перфектна Хармонија Помеѓу Моторциклот и Возачот ",
                          "desc" => "Harmonizing with Tiger's rhythm comes naturally. It is the ultimate combination of practical performance and top thrills. The Tiger Sport 660 can be limited to an A2 license, opening doors to new adventure experiences, from touring to flexible fun driving. Designed to excite but tamed to build the confidence you need. Whether it's your first bike, your first motorcycle adventure, or a flexible means of transportation you're looking for, the Tiger Sport 660 has the technology and flair to revitalize your riding experience."
                        ],
                        [
                          "title" => "Инспирира Самодоверба",
                          "desc" => "Riding confidence is at the forefront of the adventure, setting off for a ride knowing that Tiger Sport's rider-focused technology and premium brakes and suspension are there to support you every moment. The upright stance with the lightweight frame and nimble engine make for a nimble and easy feel, without ever being intimidating. Add in the narrow riding position for easy ground contact, the low 835mm seat height and the excellent ergonomics setup and you have a bike with great agility and handling in any riding scenario.",
                          "image" => "/images/adventure/tigerSport660/tiger660ReasonsImage2.avif"
                        ],
                        [
                          "title" => "Направен за Вас",
                          "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                        [
                          "title" => "Секој ден, Цел Ден",
                          "desc" => "It's the journey that counts, not the destination, but the Tiger Sport 660 is designed to offer the ultimate in road adventure comfort. Featuring premium Showa 41mm separate function forks, Showa monoshock with remote hydraulically adjustable preload, slip and assist clutch, Road and Rain riding programs and the latest Triumph ABS technology and traction control program deactivation. From top to bottom the Tiger is designed to reduce fatigue and enhance your comfort to continue your adventure, with or without a passenger."
                        ],
                        [
                          "title" => "Максимална искористливост",
                          "desc" => "With its 17-litre fuel tank and top-of-the-line specification, the new Tiger Sport is ready for any adventure. Whether it's your daily commute, epic journeys with friends or maneuvering in tight urban spaces, the ride is anything but boring. The Tiger Sport's lightweight frame, road adventure setup and sporty feel make it the ultimate companion. Ready for the hard work of your daily commute revitalizing your work week but also fully capable of weekend jaunts and touring fun.",
                          "image" => "/images/adventure/tigerSport660/tiger660ReasonsImage3.avif"
                        ],
                        [
                          "title" => "Прекрасна Зделка",
                          "desc" => "The Tiger Sport 660's state-of-the-art technology, high-spec brakes, tires and suspension, confidence-inspiring agile handling, thrilling performance from the three-cylinder engine, unique styling and a very competitive price all combine to make it the perfect sporty choice. mid-range adventure - and the perfect entry point to the Triumph range. A leading service interval of 16,000km (or 12 months) and the lowest required service time in the segment also contribute to incredibly low running costs."
                        ],
                        [
                          "title" => "Уникатен Стил",
                          "desc" => "A new generation Tiger Sport in every way, with all the benefits of Triumph's class-redefining 660cc three-cylinder engine. Strong. Versatile. And with its thoughtful design, it embodies the modern Triumph style and character. The upright and imposing adventure stance, the protective gel and refined ergonomics promise comfort and thrills throughout your ride. All-new Tiger Sport 660 color schemes, class-leading premium finish and over 40 accessories will make the bike an absolute eye-catcher. Unmistakably Triumph, and the new perfectly-rounded mid-range adventure sports bike."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Стил и Комфорт",
                          "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                          "itemsList" => [
                            "Bullet type LED flash",
                            "Штитници за колена",
                            "Комфортно Седло"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                            "alt" => "Speed 400 On The Road"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                            "alt" => "Speed 400 PaintJob"
                          ]
                        ],
                        [
                          "title" => "Багаж",
                          "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                          "itemsList" => [
                            "Цврсти Куфери за Багаж",
                            "Држач за Багаж",
                            "Најлонска торба за на резервоар",
                            "Најлонска Торба Roll "
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                            "alt" => "Speed 400 Luggage"
                          ]
                        ],
                        [
                          "title" => "Заштита ",
                          "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                          "itemsList" => [
                            "Гелатин",
                            "Заштита за ладник",
                            "Решетка за светло",
                            "Алуминиумска заштита",
                            "Заштита од Кал",
                            "Цевки за Заштита на Мотор (Горни и Долни)"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                            "alt" => "Speed 400 Head"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                            "alt" => "speed 400 Accessory Radiator Protection"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "1,160 cc T-plane мотор",
                      "info2" => "Мотор со високи перформанси",
                      "info3" => "3 години гаранција"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/adventure/tiger1200RallyModel.png",
                        "alt" => "Tiger 1200 Rally Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/adventure/tiger1200Rally/tiger1200RallyHeroVideo.webm",
                        "alt" => "Tiger 1200 Rally Range Hero Image"
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/adventure/tiger1200Rally/tiger1200Rally.avif",
                        "alt" => "Tiger 1200 Rally Range Top-Section Image"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/adventure/tiger1200Rally/tiger1200RallyTopSectionBG.avif",
                        "alt" => "Tiger 1200 Rally Range Top-Section Image"
                      ]
                    ]
                  ],


                  "tiger-900-2023" => [
                    "id" => 6,
                    "subFamilyName" => "tiger-900-2023",
                    "title" => "Tiger 900 - MY23",
                    "price" => 16290,
                    "url" => "/motorcycles/adventure/tiger-900-2023",
                    "subFamilyPageInfo" => [
                      "heroDesc" => [
                        "desc" => "Голем чекор напред во поглед на можностите, за максимални авантури секој ден.",
                        "logo" => "/images/adventure/mainBikeLogo.png"
                      ],
                      "topSection" => [
                        "title" => "Дефиниција за способност",
                        "desc" => "Tiger 900 фамилијата претставува огромен скок на-напред во способноста, со две серии што отвораат други погледи за тоа како треба да излгедаат авантурите во урбаното патување и долгите, екстремни off-road рути.",
                        "subtitle" => "Tiger 900 ги носи способностите на моторите на повисоко ниво, се со цел за максимално уживање во авантурите."
                      ],
                      "youtubeVideo" => "https://www.youtube.com/embed/-eXK5VwysTA",
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "888 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "78 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "61.9 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "11.27 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "95.2 PS / 93.9 bhp (70 kW) @ 8,750 rpm"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "87 Nm @ 7,250 rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Multipoint sequential electronic fuel injection"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "O-ring chain"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Wet, multi-plate"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "тубуларна челична шасија"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "Tubeless, 21 x 2.15 in"
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "Tubeless, 17 x 4.25 in"
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "90/90-21"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "150/70R17"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Showa превртена 45мм вилушка, мануелно подесување за јачина на одбивање, 240мм опсег на работа"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Showa задна вилушка, мануелно подесување за јачина на одбивање, 230мм опсег на работа"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Дупли 320мм дискови, Brembo Stylema 4 piston Monoblock клешти. Преден цилиндар за течност, Оптимизиран ABS систем"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Brembo"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "935 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1452-1502 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "860-880 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1551 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "24.4 º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "145.8 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "201 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "20 L"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "5.2l /100km (55.4 MPG)"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "Euro 5 Стандарди. (119g /km CO2) измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                          ]
                        ],
                        "service" => [["title" => "Сервисен Интервал", "desc" => "10,000 km или 12 месеци"]]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "Инспириран од ARAGÓN",
                          "desc" => "Креиран како инспирација од доминантниот победнички перформанса на Tiger 900 Rally Pro на Baja Aragon 2022.",
                          "image" => "/images/adventure/tiger900/tiger900GrayCaro1.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "Стандарди",
                          "desc" => "Лидер во класата по спецификации од почеток до крај, со квалитетни компоненти оптимизирани и за на пат и за “off-road“ средини.",
                          "image" => "/images/adventure/tiger900/tiger900GrayCaro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Технологија",
                          "desc" => "Најновата технологија фокусирана на возачот понудува комфорт, самодоверба, сигурност и перформанси.",
                          "image" => "/images/adventure/tiger900/tiger900GrayCaro3.avif"
                        ],
                        [
                          "id" => "carouselItem4",
                          "title" => "Сервисен Интервал",
                          "desc" => "Долгиот сервисен интервал додатно со две годишната гаранција која не истекува по одреден број поминати километри, со сигурност потврдува дека ќе имате безгрижни авантури и мали трошоци за одржување.",
                          "image" => "/images/adventure/tiger900/tiger900GrayCaro4.avif"
                        ]
                      ],
                      "audioSection" => [
                        "title" => "Уникатни Перформанси и Звук.",
                        "desc" => "Новиот 900сс три-цилиндричен мотор на Tiger 900 испорачува препознатлив длабок звук и длабок виок, со возбудливи вибрации при средни фреквенции и прекрасни звуци при финиш.",
                        "audio" => "/images/adventure/tiger900/tiger900Sound.mp3"
                      ],
                      "specNumbers" => [
                        [ "data" => "900", "info" => "cc Мотор" ],
                        [ "data" => "87", "info" => "Nm обртен момент" ],
                        [ "data" => "95", "info" => "PS - Максимална Сила" ],
                        [ "data" => "+65", "info" => "Аксесоари" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/adventure/tiger900/tiger900GrayCaro2.avif"
                      ],
                      "infoText" => [
                        "title" => "Tiger 900 - најкомплетниот, флексибилен и динамичен авантуристички мотор со средна зафатнина на моторот.",
                        "desc" => "Значително полесен од неговиот претходник, со зачудувачки високи спецификации, новиот Tiger 900 поставува нов репер за нај-агилниот, нај-динамичниот нај-способниот мотор од средна зафатнина на пазарот."
                      ],
                      "reasons" => [
                        [
                          "title" => "Возбудливи Авантуристички Опции",
                          "desc" => "Доколку сакате моќен авантуристички мотр со многу технологија, конфорт и додатоци тогаш Tiger 900 серијата е создадена за вас. Серијата се состои од мотори кои се создадени за секојдненевно користење, авантуриза со “off-road“ дотатоци. Тигар 900 GT. Создаден за максимално урбано уживање, одлично за патувања на долги релации, но и за екскурзии на секое растојание помеѓу, палетата GT има перформанси, опрема и технологија за збогатување на секое возење, со самодоверба и возбуда. Тигар 900 рели. Најнапредните велосипеди со двојна намена што некогаш сме ги направиле. Тие беа дизајнирани за возбудливи авантури надвор од асфалтот, но и за секојдневно возење со апсолутна контрола и удобност. Серијата Tiger 900 Rally поставува нов репер во однос на управувањето, спецификацијата и стилот.",
                          "image" => "/images/adventure/tiger900/tiger900ReasonsImage1.avif"
                        ],
                        [
                          "title" => "Нов 3-цилиндарски мотор од 900сс",
                          "desc" => "Новиот 3-цилиндричен мотор од 900 cc има поголема зафатнина, е во согласност со Euro 5 и нуди подобрени перформанси на Tiger 900. Вграден е нов тајминг на палењето за да се обезбеди поживо искуство во возењето на Тигар, со до 9% поголема моќност опсегот на вртежи, како и висока максимална моќност од 95 КС при 8.750 вртежи во минута. и 10% поголем вртежен момент од претходникот Tiger 800. Новиот тајминг на Tiger 900 го подобри карактерот и звукот на моторот, нудејќи поагресивен и привлечен звук со 3 цилиндри и изразито впечатливо татнеж. "
                        ],
                        [
                          "title" => "Дифинира Нови Стандарди",
                          "desc" => "Максимална флексибилност и одлично ракување. Новиот Tiger 900 е до 5 килограми полесен. Комбинацијата на новата лесна рамка, новиот полесен мотор, системот за суспензија со високи спецификации и врвните ексклузивни сопирачки на Brembo, нуди големо подобрување во агилноста и способноста на велосипедот, обезбедувајќи одлично управување во сите услови на возење. Центарот на гравитација на Tiger 900 е ревидиран и поместен за 40 mm напред и 20 mm надолу, во споредба со претходниот модел од 800cc. Нуди подобра распределба на тежината меѓу тркалата и подобра рамнотежа при мали брзини, во сите услови на возење, додека го одржува одличното растојание од подлогата карактеристично за моделите Tiger.Подобрена ергономија. Потесниот профил на велосипедот ја подобрува удобноста на возачот, особено при стартување и запирање. Рачките сега се 10 mm поблиску до возачот, обезбедувајќи поудобна исправена положба на возење. Положбата на стапалата е дизајнирана специјално за секој модел на Tiger 900, во зависност од неговата ориентација. Прилагодлива висина на седиштето. Сите модели располагаат со интегриран механизам за прилагодување на висината на седлото во две позиции кој лесно се прилагодува, кој му овозможува на возачот да ја смени висината на седлото за 20 mm до положбата што најмногу му одговара. Tiger 900, Tiger 900 GT и Tiger 900 GT Pro имаат висина на седлото од 810 – 830 mm, Tiger 900 Rally и Tiger 900 Rally Pro имаат висина на седлото од 850 – 870 mm, додека верзијата Tiger 900 GT Low Ride Height има висина од седло 760 - 780 mm.",
                          "image" => "/images/adventure/tiger900/tiger900ReasonsImage2.avif"
                        ],
                        [
                          "title" => "Специјално изработени сопирачки и суспензија",
                          "desc" => "Моделите Tiger 900 и Tiger 900 GT се карактеризираат со специјално дизајниран систем за потпирање на тркалата кој поставува нов репер за целиот авантуристички сегмент со средно поместување.Моделите 900 и GT ја имаат превртената вилушка на Marzocchi од 45 mm, која обезбедува 180 mm патување на тркалата. Кај моделите GT и GT Pro има и рачно прилагодување на амортизацијата за компресија и враќање.Задната суспензија нуди 170 километри патување. Моделот GT има рачно приспособување за предоптоварување и повратно прилагодување.Врвната специфика GT Pro RSU нуди ново електронски прилагодливо поставување на суспензијата, развиено во соработка со Marzocchi.Tiger 900 Rally - За поддршка на одличните теренски перформанси на серијата Tiger 900 Rally, врвните перформанси на суспензијата се обезбедени со конфигурацијата дизајнирана од Showa.И двата модели на Rally се опремени со превртена вилушка од 45 mm со рачно претходно оптоварување, враќање и прилагодување на амортизацијата на компресија, што обезбедува 240 mm патување на тркалата. На задното тркало има гасен шок RSU, кој може да се прилагоди за амортизирање пред оптоварување и враќање. Тој нуди 230 километри патување на задните тркала.Сите модели од новата гама на Tiger 900 имаат сопирачки Brembo Stylema® со врвни спецификации. Овие сопирачки ги вклучуваат највисоките перформанси на Brembo, најлесните и најмалите клешти. Намалениот волумен околу клиповите и влошките го намалува внатрешниот простор што го зафаќаат течностите за сопирачките и обезбедува понепосредна реакција и зголемен проток на воздух околу влошките, помагајќи им на клештите да се ладат побрзо и да работат уште подобро."
                        ],
                        [
                          "title" => "Напредна Технологија",
                          "desc" => "Голем број технолошки иновации се вклучени во новата гама на мотоцикли Tiger 900.Моделите Tiger 900 GT и Rally со средна и висока спецификации располагаат со нов 7“ TFT дисплеј за инструменти во боја кој прикажува сеопфатни информации, како и нови ABS во свијоци и системи за контрола на тракцијата за уште подобро искуство во возењето. Опсегот нуди до шест режими на возење, за целосно прилагодување на преференциите на возачот. Технологијата на сите модели GT и Rally е на многу високо ниво и вклучува целосно LED осветлување, загреани рачки, контрола на патувањето и безбедно складирање на мобилен телефон со приклучок за полнење. Врвната технологија на моделите GT Pro и Rally Pro го вклучува вградениот систем за поврзување My Triumph Bluetooth® кој е стандарден и овозможува управување со телефонски повици, репродукција на музика, навигација чекор по свиок и контрола на камерата GoPro преку прекинувачите. Сите функции се прикажани на TFT екранот. Тука е и системот за помош на менувачот на Triumph, кој овозможува менување на брзините и спуштање без употреба на спојката, како и систем за следење на притисокот во гумите за дополнителна безбедност и удобност. Дополнително, загреаното седиште за возачот и совозачот, како и LED светлата за магла се стандардна опрема."
                        ],
                        [
                          "title" => "Нов Агресивен Изглед и Карактер",
                          "desc" => "Покрај целосно новиот дизајн, новиот ексклузивен костум на Tiger ги рефлектира ревидираните завршетоци и почистите линии што му даваат на Tiger 900 поизразен и доминантен авантуристички изглед, при што секој модел има подобрени детали и карактеристики кои ја подобруваат двојната употреба или неговиот надворешен пат. ориентација.Новиот Tiger 900 ги нагласува своите можности за сите терени, како и неговата мала тежина и агилност, со тесен профил, полесен преден дел, намален целокупен волумен, поагресивно дизајниран резервоар и нова полесна рамка.Серијата GT и Rally се достапни во три ексклузивни бои, со опции Pure White, Sapphire Black и Korosi Red за моделите GT и GT Pro и Pure White, Sapphire Black и Matt Khaki за моделите Rally и Rally Pro. Основниот модел Tiger 900 е достапен во чиста бела боја.",
                          "image" => "/images/adventure/tiger900/tiger900ReasonsImage3.avif"

                        ],
                        [
                          "title" => "Многу Аксесоари",
                          "desc" => "Додадете можности за вашата авантура со два комплети за инспирација и повеќе од 65 оригинални додатоци на Triumph дизајнирани да ја подобрат практичноста, удобноста, перформансите и стилот на Tiger 900. Вклучувајќи нова палета на системи за багаж и заштитни додатоци. Комплетот за инспирација Trekker обединува импресивен асортиман на авантуристички багаж и додатоци за патување кои се идеални за палетата Tiger 900 GT, додека комплетот за инспирација Expedition ги подобрува теренските способности на гамата Tiger 900 Rally.."
                        ],
                        [
                          "title" => "Ниска позиција на седиштето",
                          "desc" => "Моделот Tiger 900 GT е достапен и во уште попристапна верзија со мала висина на седиштето. Низа меѓусебно поврзани карактеристики на дизајнот, вклучувајќи посебна вилушка, RSU амортизери и специјална конфигурација на подесувањето на суспензијата, овозможија висина на седиштето што е 50 mm пониска од основниот модел Tiger 900. Како и кај сите модели на Tiger 900, оваа верзија има вградено прилагодување на висината на седиштата од 20 mm, што му овозможува на Tiger 900 GT LRH да има висина на седиштето од 760 - 780 mm, во споредба со стандардната висина од 810 - 830 mm."
                        ],
                        [
                          "title" => "Додатна - висока спецификација",
                          "desc" => "Ако барате Tiger 900 со врвни спецификации, ова се дополнителните „Pro“ карактеристики што ќе ви го разнесат умот.Карактеристики на Tiger 900 GT Pro - Новата електронски контролирана единица за задна суспензија му овозможува на возачот да го прилагоди претходното оптоварување и амортизацијата на задната суспензија преку TFT инструментите, со четири поставки за претходно оптоварување (Rider, Rider & Bagage, Rider & Pillion и Rider & Baggage & Pillion). Ова може да се комбинира со девет различни нивоа на амортизација за да се постигне идеална комбинација. Ексклузивно за врвните спецификации Pro е новиот Triumph Shift Assist систем, кој овозможува непречено и удобно менување на брзините без употреба на спојката.Има и петти режим на возење, како и режими за пат, дожд, теренски и спортски стандардни GT. GT Pro располага со исклучително корисна програмабилна програма Rider која му овозможува на возачот фино да го подеси својот велосипед за да одговара на условите. Системот за следење на притисокот во гумите (TPMS) го предупредува возачот ако притисокот во гумите падне под оптималните нивоа и е клучна карактеристика на Tiger 900 GT Pro со врвни спецификации. Дополнително, вградениот систем за поврзување My Triumph е уште една клучна карактеристика што овозможува телефонски повици, GoPro камера и управување со GPS, додека загреаното седиште за возачот и совозачот го максимизира комфорот и осветлените прекинувачи обезбедуваат одличен стил и подобрена контрола.Карактеристики на Tiger 900 Rally Pro – Ексклузивно за моделите Pro со врвни спецификации е новиот Triumph Shift Assist систем, кој обезбедува непречено и удобно менување брзини без употреба на спојката.Додека моделот Rally има четири режими на возење (Road, Rain, Off-Road и Sport), моделот Rally Pro има два дополнителни режими на возење - Rider-Programmable и Off-Road Pro - кои нудат прецизна конфигурација, за уште поекстремни возење надвор од патот и поголеми можности на нечистотија. Системот за следење на притисокот во гумите (TPMS) го предупредува возачот ако притисокот во гумите падне под оптималните нивоа и е клучна карактеристика на Tiger 900 Rally Pro со врвни спецификации. За да ја надополни врвната спецификација на Tiger 900, моделот Rally Pro располага со интегриран систем за поврзување My Triumph, загреани седишта за возачи и совозачи и иновативни прекинувачи со позадинско осветлување за уште поголемо задоволство при возењето.."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/adventure/tiger900/tiger900AccessoriesHeroImage.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "TREKKER PACK",
                          "desc" => "Багаж ориентиран за користење на патишта за подолги патувања. Trekker Pack вклучува =>.",
                          "itemsList" => [
                            "Централен куфер и Рам за Монтирање",
                            "Странични Куфери и Рамови за Монтирање",
                            "Потпирач за патник за задниот куфер",
                            "Заштита за Резервоар",
                            "Додатно заштитно ветробранско стакло"
                          ]
                        ],
                        [
                          "title" => "EXPEDITION PACK",
                          "desc" => "Специјално Дизајниран Багаж за “Off-Road“ Авантури",
                          "itemsList" => [
                            "Странични Куфери и Рамови за Монтирање",
                            "Штитници за вилушки",
                            "Протектор за ладник",
                            "Заштита за резервоар",
                            "Штитник за светло",
                            "Торба со капацитет од 40л"
                          ]
                        ]

                      ]
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/adventure/tiger900GtModel.png",
                        "alt" => "Tiger 900 Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/adventure/tiger900/tiger900HeroVideo.webm",
                        "alt" => "Tiger 900 Range Hero Video"
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/adventure/tiger900/tiger900TopSectionImage.avif",
                        "alt" => "Tiger 900 Range Top-Section Image"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/adventure/tiger900/tiger900TopSectionImageBG.avif",
                        "alt" => "Tiger 900 Range Top-Section Image"
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "Потполно нов, возбудлив 900cc мотор осо три цилиндри",
                      "info2" => "Градски мотор со високо ниво на технолошки додатоци",
                      "info3" => "Комфортен и флексибилен"
                    ]
                ],

            ],

        ];


        $familyDataTwo = [
            "id" => 2,
            "type" => "classics",
            "shortDesc" => "Triumph builds ground-breaking motorcycles and incredible three-cylinder engines with an emphasis on power, torque and instant response.",
            "familyPageBannerVideo" => "adventure/adventureHeroVideo.webm",
            "promo" => [
              [
                "title" => "Нова 'Truxton Final-Edition' Серија",
                "subFamilyType" => "truxton-final-edition",
                "desc" => "Крајот на една ера - последната продукциска серија на иконата во Triumph серијата. Откријте повеќе за ексклузивното Thruxton Final Edition.",
                "image" => "/images/classics/thruxtonFinalEdition.avif",
                "btnBlack" => true
              ],
              [
                "title" => "Нова 'Stealth' Серија",
                "subFamilyType" => "stealth-edition",
                "desc" => "Темно и софистицирано, но сепак смело и живо. Достапна само една година, оваа неверојатна колекција се одликува со неверојатен финиш на боја по ваша нарачка.",
                "image" => "/images/classics/stealthEdition.avif",
                "btnBlack" => true
              ]
            ],
            "configPageInfo" => [
              "desc" => "Легендарната 'Bonneville' крвна линија е вградена во нашите модерни класици, со неспоредлива историја на изведби, тркачки успех и културно влијание.",
              "link" => "/configure/families/classics"
            ],
            "configFamilyPageInfo" => [
              "image" => [
                "src" => "/images/classics/configFamilyBanner.avif",
                "alt" => "Classic Bikes Banner"
              ],
              "title" => "Додајте аксесоари на вашиот мотор",
              "link" => "/configure/bikes"
            ],
            "subFamilies" => [
              "speed-400" => [
                "id" => 1,
                "subFamilyName" => "speed-400",
                "title" => "Speed 400",
                "price" => 5690,
                "url" => "/motorcycles/classics/speed-400",
                "shortDesc" => "Граден по скици од неговите предци, Speed 400 во својата ДНК го поседува уникатниот 'roadster' дизајн на Triumph.",
                "subFamilyPageInfo" => [
                  "heroSlogans" => ["Пронајдете ја", "вашата", "слобода"],
                  "topSection" => [
                    "title" => "Автентичност",
                    "desc" => "Speed 400 - иконата на Triumph, перфектен стил, перформанси и лидер во класата по квалитет..",
                    "subtitle" => "Преубав, агилен, версатилен и изграден со највисоки стандарди, Speed 400 ги поставува границите во својата категорија"
                  ],
                  "youtubeVideo" => "https://www.youtube.com/embed/QvVCEk4t8IE",
                  "fullSpecs" => [
                    "engineTransmission" => [
                      [
                        "title" => "Тип на Мотор",
                        "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                      ],
                      [
                        "title" => "капацитет",
                        "desc" => "660 cc"
                      ],
                      [
                        "title" => "диаметар",
                        "desc" => "74.04 mm"
                      ],
                      [
                        "title" => "рута",
                        "desc" => "51.1 mm"
                      ],
                      [
                        "title" => "компресија",
                        "desc" => "11.95 =>1"
                      ],
                      [
                        "title" => "Мах. Коњски Сила",
                        "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                      ],
                      [
                        "title" => "Мах. Обртен Момент",
                        "desc" => "64 Nm @ 6,250 rpm"
                      ],
                      [
                        "title" => "Систем за убризгување",
                        "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                      ],
                      [
                        "title" => "Систем за Издувни гасови",
                        "desc" => "3 во 1 не-раѓосувачки челик"
                      ],
                      [
                        "title" => "Финална Трансмисија",
                        "desc" => "X-ring chain"
                      ],
                      [
                        "title" => "Квачило",
                        "desc" => "Wet, multi-plate, slip"
                      ],
                      [
                        "title" => "Менувачка Кутија",
                        "desc" => "6 брзини"
                      ]
                    ],
                    "frame" => [
                      [
                        "title" => "шасија",
                        "desc" => "тубуларна челична шасија"
                      ],
                      [
                        "title" => "вилушка",
                        "desc" => "алуминиум"
                      ],
                      [
                        "title" => "предно тркало",
                        "desc" => "19 x 2.5' die-cast легура "
                      ],
                      [
                        "title" => "задно тркало",
                        "desc" => "17 x 4.25' die-cast легура "
                      ],
                      [
                        "title" => "предна гума",
                        "desc" => "100/90-19"
                      ],
                      [
                        "title" => "задна гума",
                        "desc" => "150/70R17"
                      ],
                      [
                        "title" => "предна суспензија",
                        "desc" => "Marzocchi Inverted Fork 45mm"
                      ],
                      [
                        "title" => "задна суспензија",
                        "desc" => "Marzocchi задна суспензија со систем за подесување"
                      ],
                      [
                        "title" => "предни сопирачки",
                        "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                      ],
                      [
                        "title" => "задна сопирачка",
                        "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                      ],
                      [
                        "title" => "инструментна плочка",
                        "desc" => "5 TFT екран"
                      ]
                    ],
                    "dimension" => [
                      [
                        "title" => "ширина на волан",
                        "desc" => "830 mm"
                      ],
                      [
                        "title" => "висина без ретровизори",
                        "desc" => "1410-1460 mm"
                      ],
                      [
                        "title" => "Solar height",
                        "desc" => "820-840 mm"
                      ],
                      [
                        "title" => "мегу-осовинско растојание ",
                        "desc" => "1556 mm"
                      ],
                      [
                        "title" => "Custer Corner",
                        "desc" => "24.6 º"
                      ],
                      [
                        "title" => "Trace",
                        "desc" => "133.3 mm"
                      ],
                      [
                        "title" => "Тежина",
                        "desc" => "192 kg"
                      ],
                      [
                        "title" => "капацитет на резервоар",
                        "desc" => "20 L"
                      ]
                    ],
                    "fuelConsumption" => [
                      [
                        "title" => "Потрошувачка",
                        "desc" => "5.2l /100km"
                      ],
                      [
                        "title" => "CO2 загадување",
                        "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                      ]
                    ]
                  ],
                  "grayCarousell" => [
                    [
                      "id" => "carouselItem1",
                      "title" => "Возбудлив Три Цилиндарски Мотор",
                      "desc" => "Почувствувајте го карактерот на моторот и чувството на лесно управување со иновативната T-crank радалица и најновиот 850 три-цилиндричен мотор.",
                      "image" => "/images/adventure/tigerSport850/tiger850Caro1.avif"
                    ],
                    [
                      "id" => "carouselItem2",
                      "title" => "Технологија фокусирана на возачот",
                      "desc" => "Технологија од врвно ниво, сопирачки и одлична суспензија за подобро секојдневно возење со максимално чувство на самодоверба, перформанси и сигурност.",
                      "image" => "/images/adventure/tigerSport850/tiger850Caro2.avif"
                    ],
                    [
                      "id" => "carouselItem3",
                      "title" => "Комбинација помеѓу карактер и перформанси",
                      "desc" => "Соилуета по која сите се вртат, со агресивни линии и ексклузивни детали .",
                      "image" => "/images/adventure/tigerSport850/tiger850Caro3.avif"
                    ],
                    [
                      "id" => "carouselItem4",
                      "title" => "Дизајниран да инспирира самодоверба",
                      "desc" => "Лесно прилагодлив за сечиј возачки стил, од височината на седиштето, до воланот па се до ерканот, Tiger 850 е спремен да се прилагоди на вас.",
                      "image" => "/images/adventure/tigerSport850/tiger850Caro4.avif"
                    ]
                  ],
                  "soundSection" => [
                    "desc" => "Уникатен звук произведен од три-цилиндричниот мотор со T-crank радалица.",
                    "audio" => "/images/adventure/tiger850Sport/tigerSound.mp3"
                  ],
                  "specNumbers" => [
                    [ "data" => "398", "info" => "cc Мотор" ],
                    [ "data" => "37.5", "info" => "Nm обртен момент" ],
                    [ "data" => "TR", "info" => "Мотор Серија" ],
                    [ "data" => "20+", "info" => "Аксесоари" ]
                  ]
                ],
                "reasonsToDrive" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "зошто баш Speed 400 !?",
                    "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                  ],
                  "reasons" => [
                    [
                      "title" => "Безвременски и Автентичен Стил",
                      "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                      "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                    ],
                    [
                      "title" => "Нов Мотор",
                      "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                      "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                    ],
                    [
                      "title" => "Сериозна Забава",
                      "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                      "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                    ],
                    [
                      "title" => "Направен за Вас",
                      "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                    ],
                    [
                      "title" => "Модерна Технологија",
                      "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                    ]
                  ]
                ],
                "accessory" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "Додајте ваш белег врз Speed 400",
                    "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                  ],
                  "accessoryTypes" => [
                    [
                      "title" => "Стил и Комфорт",
                      "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                      "itemsList" => [
                        "Bullet type LED flash",
                        "Штитници за колена",
                        "Комфортно Седло"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                        "alt" => "Speed 400 On The Road"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                        "alt" => "Speed 400 PaintJob"
                      ]
                    ],
                    [
                      "title" => "Багаж",
                      "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                      "itemsList" => [
                        "Цврсти Куфери за Багаж",
                        "Држач за Багаж",
                        "Најлонска торба за на резервоар",
                        "Најлонска Торба Roll "
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                        "alt" => "Speed 400 Luggage"
                      ]
                    ],
                    [
                      "title" => "Заштита ",
                      "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                      "itemsList" => [
                        "Гелатин",
                        "Заштита за ладник",
                        "Решетка за светло",
                        "Алуминиумска заштита",
                        "Заштита од Кал",
                        "Цевки за Заштита на Мотор (Горни и Долни)"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                        "alt" => "Speed 400 Head"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                        "alt" => "speed 400 Accessory Radiator Protection"
                      ]
                    ]
                  ]
                ],
                "shortSpecInfo" => [
                  "info1" => "398cc TR Мотор",
                  "info2" => "Сервис Интервал 16,000 км"
                ],
                "gallery" => [
                  "modelImage" => [
                    "src" => "/images/classics/speed400.avif",
                    "alt" => "Speed 400 Range Model Image"
                  ],
                  "subFamilyHeroImage" => [
                    "src" => "/images/classics/speed400/speed400HeroSubFamilyImage.avif",
                    "alt" => "Speed 400"
                  ],
                  "subFamilyTopSectionImage" => [
                    "src" => "/images/classics/speed400/speed400TopSectionImage.avif",
                    "alt" => "Speed 400 Top Section Image"
                  ],
                  "subFamilyTopSectionBGImage" => [
                    "src" => "/images/classics/speed400/speed400TopSectionImageBG.avif",
                    "alt" => "Speed 400 Top Section Image BG"
                  ]
                ]
              ],
              "scrambler-400-x" => [
                "id" => 2,
                "subFamilyName" => "scrambler-400-x",
                "title" => "Scrambler 400 X",
                "price" => 6390,
                "url" => "/motorcycles/classics/scrambler-400-x",
                "shortDesc" => "Со агилно управување, водечки перформанси во класата и луксузна завршница, Scrambler 400 X е „кул“ и способен за секаков предизвик.",
                "subFamilyPageInfo" => [
                  "heroSlogans" => ["Стартувајте ја", "вашата", "Авантура"],
                  "topSection" => [
                    "title" => "Пристапете Секаде",
                    "desc" => "Прекрасно избалансиран, флексибилен без напор. Scrambler 400 X е направен за сите возачи и сите терени",
                    "subtitle" => "Безвременски Triumph Стил, Модерни Способности. Авантуристички настроениот Scrambler 400  додава забава на сите ваши авантури"
                  ],
                  "youtubeVideo" => "https://www.youtube.com/embed/moLlIk90Ea",
                  "fullSpecs" => [
                    "engineTransmission" => [
                      [
                        "title" => "Тип на Мотор",
                        "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                      ],
                      [
                        "title" => "капацитет",
                        "desc" => "660 cc"
                      ],
                      [
                        "title" => "диаметар",
                        "desc" => "74.04 mm"
                      ],
                      [
                        "title" => "рута",
                        "desc" => "51.1 mm"
                      ],
                      [
                        "title" => "компресија",
                        "desc" => "11.95 =>1"
                      ],
                      [
                        "title" => "Мах. Коњски Сила",
                        "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                      ],
                      [
                        "title" => "Мах. Обртен Момент",
                        "desc" => "64 Nm @ 6,250 rpm"
                      ],
                      [
                        "title" => "Систем за убризгување",
                        "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                      ],
                      [
                        "title" => "Систем за Издувни гасови",
                        "desc" => "3 во 1 не-раѓосувачки челик"
                      ],
                      [
                        "title" => "Финална Трансмисија",
                        "desc" => "X-ring chain"
                      ],
                      [
                        "title" => "Квачило",
                        "desc" => "Wet, multi-plate, slip"
                      ],
                      [
                        "title" => "Менувачка Кутија",
                        "desc" => "6 брзини"
                      ]
                    ],
                    "frame" => [
                      [
                        "title" => "шасија",
                        "desc" => "тубуларна челична шасија"
                      ],
                      [
                        "title" => "вилушка",
                        "desc" => "алуминиум"
                      ],
                      [
                        "title" => "предно тркало",
                        "desc" => "19 x 2.5' die-cast легура "
                      ],
                      [
                        "title" => "задно тркало",
                        "desc" => "17 x 4.25' die-cast легура "
                      ],
                      [
                        "title" => "предна гума",
                        "desc" => "100/90-19"
                      ],
                      [
                        "title" => "задна гума",
                        "desc" => "150/70R17"
                      ],
                      [
                        "title" => "предна суспензија",
                        "desc" => "Marzocchi Inverted Fork 45mm"
                      ],
                      [
                        "title" => "задна суспензија",
                        "desc" => "Marzocchi задна суспензија со систем за подесување"
                      ],
                      [
                        "title" => "предни сопирачки",
                        "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                      ],
                      [
                        "title" => "задна сопирачка",
                        "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                      ],
                      [
                        "title" => "инструментна плочка",
                        "desc" => "5 TFT екран"
                      ]
                    ],
                    "dimension" => [
                      [
                        "title" => "ширина на волан",
                        "desc" => "830 mm"
                      ],
                      [
                        "title" => "висина без ретровизори",
                        "desc" => "1410-1460 mm"
                      ],
                      [
                        "title" => "Solar height",
                        "desc" => "820-840 mm"
                      ],
                      [
                        "title" => "мегу-осовинско растојание ",
                        "desc" => "1556 mm"
                      ],
                      [
                        "title" => "Custer Corner",
                        "desc" => "24.6 º"
                      ],
                      [
                        "title" => "Trace",
                        "desc" => "133.3 mm"
                      ],
                      [
                        "title" => "Тежина",
                        "desc" => "192 kg"
                      ],
                      [
                        "title" => "капацитет на резервоар",
                        "desc" => "20 L"
                      ]
                    ],
                    "fuelConsumption" => [
                      [
                        "title" => "Потрошувачка",
                        "desc" => "5.2l /100km"
                      ],
                      [
                        "title" => "CO2 загадување",
                        "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                      ]
                    ]
                  ],
                  "grayCarousell" => [
                    [
                      "id" => "carouselItem1",
                      "title" => "Стил",
                      "desc" => "Непогрешлив Triumph Scrambler DNA со модерен прилагоден стил, теренски карактер и луксузна завршница што поставува нов стандард во класата.",
                      "image" => "/images/classics/scrambler400X/scrambler400XGrayCaro1.avif"
                    ],
                    [
                      "id" => "carouselItem2",
                      "title" => "Прекрасно Управување И Однесување на Патиштата",
                      "desc" => "Ексклузивната рамка Scrambler 400 X и импозантната ергономија нудат максимална доверба и контрола на возачот.",
                      "image" => "/images/classics/scrambler400X/scrambler400XGrayCaro2.avif"
                    ],
                    [
                      "id" => "carouselItem3",
                      "title" => "Карактер",
                      "desc" => "Scrambler 400 X — насочено управување на сите патишта, заедно со можностите за совпаѓање",
                      "image" => "/images/classics/scrambler400X/scrambler400XGrayCaro3.avif"
                    ],
                    [
                      "id" => "carouselItem4",
                      "title" => "Квалитет",
                      "desc" => "Прекрасно изработен со модерен прилагоден стил, врвен финиш во класата - иконската ДНК Scrambler на Triumph е длабока.",
                      "image" => "/images/classics/scrambler400X/scrambler400XGrayCaro4.avif"
                    ],
                    [
                      "id" => "carouselItem5",
                      "title" => "Вредност",
                      "desc" => "Со најдобри спецификации во класата и ниски трошоци за работа, Scrambler 400 X претставува непобедлива вредност.",
                      "image" => "/images/classics/scrambler400X/scrambler400XGrayCaro5.avif"
                    ]

                  ],
                  "soundSection" => [
                    "desc" => "Уникатен звук произведен од три-цилиндричниот мотор со T-crank радалица.",
                    "audio" => "/images/adventure/tiger850Sport/tigerSound.mp3"
                  ],
                  "specNumbers" => [
                    [ "data" => "398", "info" => "cc Мотор" ],
                    [ "data" => "37.5", "info" => "Nm обртен момент" ],
                    [ "data" => "TR", "info" => "Мотор Серија" ],
                    [ "data" => "20+", "info" => "Аксесоари" ]
                  ]
                ],
                "reasonsToDrive" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "зошто баш Speed 400 !?",
                    "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                  ],
                  "reasons" => [
                    [
                      "title" => "Безвременски и Автентичен Стил",
                      "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                      "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                    ],
                    [
                      "title" => "Нов Мотор",
                      "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                      "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                    ],
                    [
                      "title" => "Сериозна Забава",
                      "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                      "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                    ],
                    [
                      "title" => "Направен за Вас",
                      "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                    ],
                    [
                      "title" => "Модерна Технологија",
                      "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                    ]
                  ]
                ],
                "accessory" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "Додајте ваш белег врз Speed 400",
                    "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                  ],
                  "accessoryTypes" => [
                    [
                      "title" => "Стил и Комфорт",
                      "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                      "itemsList" => [
                        "Bullet type LED flash",
                        "Штитници за колена",
                        "Комфортно Седло"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                        "alt" => "Speed 400 On The Road"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                        "alt" => "Speed 400 PaintJob"
                      ]
                    ],
                    [
                      "title" => "Багаж",
                      "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                      "itemsList" => [
                        "Цврсти Куфери за Багаж",
                        "Држач за Багаж",
                        "Најлонска торба за на резервоар",
                        "Најлонска Торба Roll "
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                        "alt" => "Speed 400 Luggage"
                      ]
                    ],
                    [
                      "title" => "Заштита ",
                      "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                      "itemsList" => [
                        "Гелатин",
                        "Заштита за ладник",
                        "Решетка за светло",
                        "Алуминиумска заштита",
                        "Заштита од Кал",
                        "Цевки за Заштита на Мотор (Горни и Долни)"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                        "alt" => "Speed 400 Head"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                        "alt" => "speed 400 Accessory Radiator Protection"
                      ]
                    ]
                  ]
                ],
                "shortSpecInfo" => [
                  "info1" => "398cc TR Мотор",
                  "info2" => "Сервис Интервал 16,000 км"
                ],
                "gallery" => [
                  "modelImage" => [
                    "src" => "/images/classics/speed400.avif",
                    "alt" => "Scrambler 400 X Range Model Image"
                  ],
                  "subFamilyHeroImage" => [
                    "src" => "/images/classics/scrambler400X/scrambler400XHeroImage.avif",
                    "alt" => "Scrambler 400 X"
                  ],
                  "subFamilyTopSectionImage" => [
                    "src" => "/images/classics/scrambler400X/scrambler400XTopSectionImage.avif",
                    "alt" => "Scrambler 400 X Top Section Image"
                  ],
                  "subFamilyTopSectionBGImage" => [
                    "src" => "/images/classics/scrambler400X/scrambler400XTopSectionImageBG.avif",
                    "alt" => "Scrambler 400 X Top Section Image BG"
                  ]
                ]
              ],
              "speed-twin-900" => [
                "id" => 3,
                "subFamilyName" => "speed-twin-900",
                "title" => "Speed Twin 900",
                "price" => 10390,
                "url" => "/motorcycles/classics/speed-twin-900",
                "shortDesc" => "Возбудливи перформанси и управување што инспирира самодоверба, сега со уште поголема удобност и стил.",
                "subFamilyPageInfo" => [
                  "heroSlogans" => ["Забава", "со", "стил"],
                  "topSection" => [
                    "title" => "Автентичност",
                    "desc" => "Best-seller -от на Triumph, еволуираше во елегантен и луксузен моторцикл",
                    "subtitle" => "Направен за возење и за забава, спремен за ваша персонализација, Speed Twin 900 е мотор со голем карактер и можности"
                  ],
                  "youtubeVideo" => "https://www.youtube.com/embed/moLlIk90Ea",
                  "fullSpecs" => [
                    "engineTransmission" => [
                      [
                        "title" => "Тип на Мотор",
                        "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                      ],
                      [
                        "title" => "капацитет",
                        "desc" => "660 cc"
                      ],
                      [
                        "title" => "диаметар",
                        "desc" => "74.04 mm"
                      ],
                      [
                        "title" => "рута",
                        "desc" => "51.1 mm"
                      ],
                      [
                        "title" => "компресија",
                        "desc" => "11.95 =>1"
                      ],
                      [
                        "title" => "Мах. Коњски Сила",
                        "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                      ],
                      [
                        "title" => "Мах. Обртен Момент",
                        "desc" => "64 Nm @ 6,250 rpm"
                      ],
                      [
                        "title" => "Систем за убризгување",
                        "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                      ],
                      [
                        "title" => "Систем за Издувни гасови",
                        "desc" => "3 во 1 не-раѓосувачки челик"
                      ],
                      [
                        "title" => "Финална Трансмисија",
                        "desc" => "X-ring chain"
                      ],
                      [
                        "title" => "Квачило",
                        "desc" => "Wet, multi-plate, slip"
                      ],
                      [
                        "title" => "Менувачка Кутија",
                        "desc" => "6 брзини"
                      ]
                    ],
                    "frame" => [
                      [
                        "title" => "шасија",
                        "desc" => "тубуларна челична шасија"
                      ],
                      [
                        "title" => "вилушка",
                        "desc" => "алуминиум"
                      ],
                      [
                        "title" => "предно тркало",
                        "desc" => "19 x 2.5' die-cast легура "
                      ],
                      [
                        "title" => "задно тркало",
                        "desc" => "17 x 4.25' die-cast легура "
                      ],
                      [
                        "title" => "предна гума",
                        "desc" => "100/90-19"
                      ],
                      [
                        "title" => "задна гума",
                        "desc" => "150/70R17"
                      ],
                      [
                        "title" => "предна суспензија",
                        "desc" => "Marzocchi Inverted Fork 45mm"
                      ],
                      [
                        "title" => "задна суспензија",
                        "desc" => "Marzocchi задна суспензија со систем за подесување"
                      ],
                      [
                        "title" => "предни сопирачки",
                        "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                      ],
                      [
                        "title" => "задна сопирачка",
                        "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                      ],
                      [
                        "title" => "инструментна плочка",
                        "desc" => "5 TFT екран"
                      ]
                    ],
                    "dimension" => [
                      [
                        "title" => "ширина на волан",
                        "desc" => "830 mm"
                      ],
                      [
                        "title" => "висина без ретровизори",
                        "desc" => "1410-1460 mm"
                      ],
                      [
                        "title" => "Solar height",
                        "desc" => "820-840 mm"
                      ],
                      [
                        "title" => "мегу-осовинско растојание ",
                        "desc" => "1556 mm"
                      ],
                      [
                        "title" => "Custer Corner",
                        "desc" => "24.6 º"
                      ],
                      [
                        "title" => "Trace",
                        "desc" => "133.3 mm"
                      ],
                      [
                        "title" => "Тежина",
                        "desc" => "192 kg"
                      ],
                      [
                        "title" => "капацитет на резервоар",
                        "desc" => "20 L"
                      ]
                    ],
                    "fuelConsumption" => [
                      [
                        "title" => "Потрошувачка",
                        "desc" => "5.2l /100km"
                      ],
                      [
                        "title" => "CO2 загадување",
                        "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                      ]
                    ]
                  ],
                  "grayCarousell" => [
                    [
                      "id" => "carouselItem1",
                      "title" => "Возбудливи Перформанси",
                      "desc" => "Двоцилиндричниот мотор Bonneville 900cc. на нивниот Speed ​​​​Twin 900 е познат по својата моќност на вртежен момент и перформанси.",
                      "image" => "/images/classics/speedTwin900/speedTwin900Caro1.avif"
                    ],
                    [
                      "id" => "carouselItem2",
                      "title" => "Модерен “custom“ дизајн",
                      "desc" => "Прекрасен современ изглед со безвременски пристап, надграден за 2021 година во луксузен финиш и детали",
                      "image" => "/images/classics/speedTwin900/speedTwin900Caro2.avif"
                    ],
                    [
                      "id" => "carouselItem3",
                      "title" => "Возачко искуство кое инспирира самодоверба",
                      "desc" => "Ниско седло од 765 mm и динамично, лесно ракување и уште поудобно рамно седло.",
                      "image" => "/images/classics/speedTwin900/speedTwin900Caro3.avif"
                    ],
                    [
                      "id" => "carouselItem4",
                      "title" => "Опрема од високи стандарди",
                      "desc" => "Четириклипните предни клешти на Brembo и вилушката со патрон од 41 мм се комбинираат за да обезбедат одлична контрола на возачот и моќ на сопирање.",
                      "image" => "/images/classics/speedTwin900/speedTwin900Caro4.avif"
                    ],
                    [
                      "id" => "carouselItem5",
                      "title" => "Високо ниво на технологија",
                      "desc" => "Програми за возење на пат и дожд, ABS, деактивирање на контрола на тракцијата, помош на спојката и LED задно светло.",
                      "image" => "/images/classics/speedTwin900/speedTwin900Caro5.avif"
                    ]

                  ],
                  "specNumbers" => [
                    [ "data" => "900", "info" => "cc Мотор" ],
                    [ "data" => "80", "info" => "Nm обртен момент" ],
                    [ "data" => "65", "info" => "PS - Максимална Сила" ],
                    [ "data" => "16,000", "info" => "КМ Сервисен Интервал" ]
                  ],
                  "audioSection" => [
                    "title" => "Уживајте во звукот на Speed Twin 900",
                    "desc" => "Слушнете го препознатливиот, уникатен звук на моторот со два цилиндри Triumph Bonneville.",
                    "audio" => "/images/classics/speedTwin900/speedTwin900Audio.mp3"
                  ],
                  "youtubeVideosCarousellItems" => [[
                    "src" => "https://www.youtube.com/embed/Yq47k_ZJUz4",
                    "title" => "Introducing the ALL-NEW Triumph Speed Twin 900 Green Stealth Edition"
                  ],
                  [
                    "src" => "https://www.youtube.com/embed/30qKRVyb4OM",
                    "title" => "New Bonneville Street Twin Features and Benefits"
                  ],
                  [
                    "src" => "https://www.youtube.com/embed/zQT9lJKPPNY",
                    "title" => "New Bonneville Street Twin Gold Line Features and Benefits"
                  ],
                  [
                  "src" => "https://www.youtube.com/embed/DFPZcQjEdgI",
                  "title" => "Bonneville 2021 – Global Reveal"
                  ],
                  [
                    "src" => "https://www.youtube.com/embed/W11Zkx35eGg",
                    "title" => "Bonneville 2021 | British Icons. Beautifully Evolved"
                  ]]
                ],
                "shortSpecInfo" => [
                  "info2" => "Новата Thriumph Stealth Серија е достапна"
                ],
                "reasonsToDrive" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "зошто баш Speed 400 !?",
                    "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                  ],
                  "reasons" => [
                    [
                      "title" => "Безвременски и Автентичен Стил",
                      "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                      "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                    ],
                    [
                      "title" => "Нов Мотор",
                      "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                      "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                    ],
                    [
                      "title" => "Сериозна Забава",
                      "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                      "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                    ],
                    [
                      "title" => "Направен за Вас",
                      "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                    ],
                    [
                      "title" => "Модерна Технологија",
                      "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                    ]
                  ]
                ],
                "accessory" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "Додајте ваш белег врз Speed 400",
                    "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                  ],
                  "accessoryTypes" => [
                    [
                      "title" => "Стил и Комфорт",
                      "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                      "itemsList" => [
                        "Bullet type LED flash",
                        "Штитници за колена",
                        "Комфортно Седло"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                        "alt" => "Speed 400 On The Road"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                        "alt" => "Speed 400 PaintJob"
                      ]
                    ],
                    [
                      "title" => "Багаж",
                      "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                      "itemsList" => [
                        "Цврсти Куфери за Багаж",
                        "Држач за Багаж",
                        "Најлонска торба за на резервоар",
                        "Најлонска Торба Roll "
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                        "alt" => "Speed 400 Luggage"
                      ]
                    ],
                    [
                      "title" => "Заштита ",
                      "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                      "itemsList" => [
                        "Гелатин",
                        "Заштита за ладник",
                        "Решетка за светло",
                        "Алуминиумска заштита",
                        "Заштита од Кал",
                        "Цевки за Заштита на Мотор (Горни и Долни)"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                        "alt" => "Speed 400 Head"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                        "alt" => "speed 400 Accessory Radiator Protection"
                      ]
                    ]
                  ]
                ],
                "gallery" => [
                  "modelImage" => [
                    "src" => "/images/classics/speedTwin900.png",
                    "alt" => "Speed Twin 900 Range Model Image"
                  ],
                  "subFamilyHeroVideo" => [
                    "src" => "/images/classics/speedTwin900/speedTwin900HeroVideo.webm",
                    "alt" => "Speed Twin 900"
                  ],
                  "subFamilyTopSectionImage" => [
                    "src" => "/images/classics/speedTwin900/speedTwin900TopSectionImage.avif",
                    "alt" => "Speed Twin 900 Top Section Image"
                  ],
                  "subFamilyTopSectionBGImage" => [
                    "src" => "/images/classics/speedTwin900/speedTwin900TopSectionImageBG.avif",
                    "alt" => "Speed Twin 900 Top Section Image BG"
                  ]
                ]
            ],
            "bonneville-bobber"  => [
                "id" => 4,
                "subFamilyName" => "bonneville-bobber",
                "title" => "Bonneville Bobber",
                "price" => 16290,
                "url" => "/motorcycles/classics/bonneville-bobber",
                "shortDesc" => "Највозбуливиот Bobber, успешно ги краде погледите благодарејки на некговиот мускулест изглед и агилност.",
                "subFamilyPageInfo" => [
                  "desc1" => ""
                ],
                "reasonsToDrive" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "зошто баш Speed 400 !?",
                    "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                  ],
                  "reasons" => [
                    [
                      "title" => "Безвременски и Автентичен Стил",
                      "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                      "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                    ],
                    [
                      "title" => "Нов Мотор",
                      "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                      "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                    ],
                    [
                      "title" => "Сериозна Забава",
                      "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                      "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                    ],
                    [
                      "title" => "Направен за Вас",
                      "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                    ],
                    [
                      "title" => "Модерна Технологија",
                      "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                    ]
                  ]
                ],
                "accessory" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "Додајте ваш белег врз Speed 400",
                    "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                  ],
                  "accessoryTypes" => [
                    [
                      "title" => "Стил и Комфорт",
                      "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                      "itemsList" => [
                        "Bullet type LED flash",
                        "Штитници за колена",
                        "Комфортно Седло"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                        "alt" => "Speed 400 On The Road"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                        "alt" => "Speed 400 PaintJob"
                      ]
                    ],
                    [
                      "title" => "Багаж",
                      "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                      "itemsList" => [
                        "Цврсти Куфери за Багаж",
                        "Држач за Багаж",
                        "Најлонска торба за на резервоар",
                        "Најлонска Торба Roll "
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                        "alt" => "Speed 400 Luggage"
                      ]
                    ],
                    [
                      "title" => "Заштита ",
                      "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                      "itemsList" => [
                        "Гелатин",
                        "Заштита за ладник",
                        "Решетка за светло",
                        "Алуминиумска заштита",
                        "Заштита од Кал",
                        "Цевки за Заштита на Мотор (Горни и Долни)"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                        "alt" => "Speed 400 Head"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                        "alt" => "speed 400 Accessory Radiator Protection"
                      ]
                    ]
                  ]
                ],
                "shortSpecInfo" => [
                  "info2" => "Новата Thriumph Stealth Серија е достапна"
                ],
                "gallery" => [
                  "modelImage" => [
                    "src" => "/images/classics/bonnevilleBobber.avif",
                    "alt" => "Bonneville Bobber Range Model Image"
                  ]
                ]
              ],
              "scrambler-1200" => [
                "id" => 5,
                "subFamilyName" => "scrambler-1200",
                "title" => "Scrambler 1200",
                "price" => 15990,
                "url" => "/motorcycles/classics/scrambler-1200",
                "shortDesc" => "Автентичен Scrambler стајлинг со авантуристички спецификации кои се најдобри во класата. Scrambler 1200 е најдобриот мотор во својата класа.",
                "subFamilyPageInfo" => [
                  "desc1" => ""
                ],
                "shortSpecInfo" => [
                  "info1" => "1,200cc Bonneville дво-цилинричен мотор",
                  "info2" => "Максимална јачина - 90 PS",
                  "info3" => "Максимален вртежен момент - 110 Nm"
                ],
                "gallery" => [
                  "modelImage" => [
                    "src" => "/images/classics/scrambler1200.webp",
                    "alt" => "Scrambler 1200 Range Model Image"
                  ]
                ],
                "accessory" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "Додајте ваш белег врз Speed 400",
                    "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                  ],
                  "accessoryTypes" => [
                    [
                      "title" => "Стил и Комфорт",
                      "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                      "itemsList" => [
                        "Bullet type LED flash",
                        "Штитници за колена",
                        "Комфортно Седло"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                        "alt" => "Speed 400 On The Road"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                        "alt" => "Speed 400 PaintJob"
                      ]
                    ],
                    [
                      "title" => "Багаж",
                      "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                      "itemsList" => [
                        "Цврсти Куфери за Багаж",
                        "Држач за Багаж",
                        "Најлонска торба за на резервоар",
                        "Најлонска Торба Roll "
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                        "alt" => "Speed 400 Luggage"
                      ]
                    ],
                    [
                      "title" => "Заштита ",
                      "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                      "itemsList" => [
                        "Гелатин",
                        "Заштита за ладник",
                        "Решетка за светло",
                        "Алуминиумска заштита",
                        "Заштита од Кал",
                        "Цевки за Заштита на Мотор (Горни и Долни)"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                        "alt" => "Speed 400 Head"
                      ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                        "alt" => "speed 400 Accessory Radiator Protection"
                      ]
                    ]
                  ]
                ],
                "reasonsToDrive" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                  ],
                  "infoText" => [
                    "title" => "зошто баш Speed 400 !?",
                    "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                  ],
                  "reasons" => [
                    [
                      "title" => "Безвременски и Автентичен Стил",
                      "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                      "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                    ],
                    [
                      "title" => "Нов Мотор",
                      "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                      "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                    ],
                    [
                      "title" => "Сериозна Забава",
                      "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                      "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                    ],
                    [
                      "title" => "Направен за Вас",
                      "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                    ],
                    [
                      "title" => "Модерна Технологија",
                      "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                    ]
                  ]
                ]
              ],

              "bonneville-speedmaster" =>  [
                "id" => 6,
                "subFamilyName" => "bonneville-speedmaster",
                "title" => "Bonneville Speedmaster",
                "price" => 16290,
                "url" => "/motorcycles/classics/bonneville-speedmaster",
                "shortDesc" => "Класичен 'custom' став, со комфортна позиција за возење за крузирање и 'premium' спецификации, сега веќе еволуирани.",
                "subFamilyPageInfo" =>  [
                  "desc1" => ""
                ],
                "reasonsToDrive" =>  [
                  "banner" =>  [
                    "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                  ],
                  "infoText" =>  [
                    "title" => "зошто баш Speed 400 !?",
                    "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                  ],
                  "reasons" => [
                     [
                      "title" => "Безвременски и Автентичен Стил",
                      "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                      "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                    ],
                     [
                      "title" => "Нов Мотор",
                      "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                      "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                    ],
                     [
                      "title" => "Сериозна Забава",
                      "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                      "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                    ],
                     [
                      "title" => "Направен за Вас",
                      "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                    ],
                     [
                      "title" => "Модерна Технологија",
                      "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                    ]
                  ]
                ],
                "accessory" =>  [
                  "banner" =>  [
                    "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                  ],
                  "infoText" =>  [
                    "title" => "Додајте ваш белег врз Speed 400",
                    "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                  ],
                  "accessoryTypes" => [
                     [
                      "title" => "Стил и Комфорт",
                      "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                      "itemsList" => [
                        "Bullet type LED flash",
                        "Штитници за колена",
                        "Комфортно Седло"
                      ],
                      "image1" =>  [
                        "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                        "alt" => "Speed 400 On The Road"
                      ],
                      "image2" =>  [
                        "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                        "alt" => "Speed 400 PaintJob"
                      ]
                    ],
                     [
                      "title" => "Багаж",
                      "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                      "itemsList" => [
                        "Цврсти Куфери за Багаж",
                        "Држач за Багаж",
                        "Најлонска торба за на резервоар",
                        "Најлонска Торба Roll "
                      ],
                      "image1" =>  [
                        "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                        "alt" => "Speed 400 Luggage"
                      ]
                    ],
                     [
                      "title" => "Заштита ",
                      "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                      "itemsList" => [
                        "Гелатин",
                        "Заштита за ладник",
                        "Решетка за светло",
                        "Алуминиумска заштита",
                        "Заштита од Кал",
                        "Цевки за Заштита на Мотор (Горни и Долни)"
                      ],
                      "image1" =>  [
                        "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                        "alt" => "Speed 400 Head"
                      ],
                      "image2" =>  [
                        "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                        "alt" => "speed 400 Accessory Radiator Protection"
                      ]
                    ]
                  ]
                ],
                "shortSpecInfo" =>  [
                  "info2" => "Новата Thriumph Stealth Серија е достапна"
                ],
                "gallery" =>  [
                  "modelImage" =>  [
                    "src" => "/images/classics/bonnevilleSpeedmasterStealth.avif",
                    "alt" => "Bonneville Speedmaster Range Model Image"
                  ]
                ]
              ],
              "speed-twin-1200" => [
                "id" => 7,
                "subFamilyName" => "speed-twin-1200",
                "title" => "Speed Twin 1200",
                "price" => 14190,
                "url" => "/motorcycles/classics/speed-twin-1200",
                "shortDesc" => "Модерно-класичен приспособен 'roadster' со динамични способности, целосно лесен за управување, многу напредна технологија, возбудлива испорака на вртежен момент со препознатлив британски звук.",
                "subFamilyPageInfo" => [
                  "desc1" => ""
                    ],
                "reasonsToDrive" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                    ],
                  "infoText" => [
                    "title" => "зошто баш Speed 400 !?",
                    "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                    ],
                  "reasons" => [
                    [
                      "title" => "Безвременски и Автентичен Стил",
                      "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                      "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                        ],
                    [
                      "title" => "Нов Мотор",
                      "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                      "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                        ],
                    [
                      "title" => "Сериозна Забава",
                      "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                      "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                        ],
                    [
                      "title" => "Направен за Вас",
                      "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                    [
                      "title" => "Модерна Технологија",
                      "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                        ]
                  ]
                    ],
                "accessory" => [
                  "banner" => [
                    "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                    ],
                  "infoText" => [
                    "title" => "Додајте ваш белег врз Speed 400",
                    "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                    ],
                  "accessoryTypes" => [
                    [
                      "title" => "Стил и Комфорт",
                      "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                      "itemsList" => [
                        "Bullet type LED flash",
                        "Штитници за колена",
                        "Комфортно Седло"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                        "alt" => "Speed 400 On The Road"
                        ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                        "alt" => "Speed 400 PaintJob"
                        ]
                        ],
                    [
                      "title" => "Багаж",
                      "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                      "itemsList" => [
                        "Цврсти Куфери за Багаж",
                        "Држач за Багаж",
                        "Најлонска торба за на резервоар",
                        "Најлонска Торба Roll "
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                        "alt" => "Speed 400 Luggage"
                        ]
                        ],
                    [
                      "title" => "Заштита ",
                      "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                      "itemsList" => [
                        "Гелатин",
                        "Заштита за ладник",
                        "Решетка за светло",
                        "Алуминиумска заштита",
                        "Заштита од Кал",
                        "Цевки за Заштита на Мотор (Горни и Долни)"
                      ],
                      "image1" => [
                        "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                        "alt" => "Speed 400 Head"
                        ],
                      "image2" => [
                        "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                        "alt" => "speed 400 Accessory Radiator Protection"
                        ]
                        ]
                  ]
                    ],
                "shortSpecInfo" => [
                  "info2" => "Новата Thriumph Stealth Серија е достапна"
                    ],
                "gallery" => [
                  "modelImage" => [
                    "src" => "/images/classics/speedTwin1200.png",
                    "alt" => "Speed Twin 1200 Speedmaster Range Model Image"
                    ]
                    ]
                ],

                "scrambler-900" => [
                    "id" => 8,
                    "subFamilyName" => "scrambler-900",
                    "title" => "Scrambler 900",
                    "price" => 11890,
                    "url" => "/motorcycles/classics/scrambler-900",
                    "shortDesc" => "Еден од најприфатените мотори на Triumph, кој благодарејки на преубавиот стајлинг и 'off-road' карактер, си доби висока репутација без никаков преседан.",
                    "subFamilyPageInfo" => [
                      "desc1" => ""
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "зошто баш Speed 400 !?",
                        "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                      ],
                      "reasons" => [
                        [
                          "title" => "Безвременски и Автентичен Стил",
                          "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                          "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                        ],
                        [
                          "title" => "Нов Мотор",
                          "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                          "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                        ],
                        [
                          "title" => "Сериозна Забава",
                          "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                          "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                        ],
                        [
                          "title" => "Направен за Вас",
                          "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                        [
                          "title" => "Модерна Технологија",
                          "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Стил и Комфорт",
                          "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                          "itemsList" => [
                            "Bullet type LED flash",
                            "Штитници за колена",
                            "Комфортно Седло"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                            "alt" => "Speed 400 On The Road"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                            "alt" => "Speed 400 PaintJob"
                          ]
                        ],
                        [
                          "title" => "Багаж",
                          "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                          "itemsList" => [
                            "Цврсти Куфери за Багаж",
                            "Држач за Багаж",
                            "Најлонска торба за на резервоар",
                            "Најлонска Торба Roll "
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                            "alt" => "Speed 400 Luggage"
                          ]
                        ],
                        [
                          "title" => "Заштита ",
                          "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                          "itemsList" => [
                            "Гелатин",
                            "Заштита за ладник",
                            "Решетка за светло",
                            "Алуминиумска заштита",
                            "Заштита од Кал",
                            "Цевки за Заштита на Мотор (Горни и Долни)"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                            "alt" => "Speed 400 Head"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                            "alt" => "speed 400 Accessory Radiator Protection"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info2" => "Новата Thriumph Stealth Серија е достапна"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/classics/scrambler900.png",
                        "alt" => "Scrambler 900 Speedmaster Range Model Image"
                      ]
                    ]
                  ],

                  "bonneville-t100"  => [
                    "id" => 9,
                    "subFamilyName" => "bonneville-t100",
                    "title" => "Bonneville T100",
                    "price" => 11690,
                    "url" => "/motorcycles/classics/bonneville-t100",
                    "shortDesc" => "T100 е модерен класик. Доаѓа како наследик на Bonneville '59 со сега веќе перфектни финиши и детали.",
                    "subFamilyPageInfo" => [
                      "desc1" => ""
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "зошто баш Speed 400 !?",
                        "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                      ],
                      "reasons" => [
                        [
                          "title" => "Безвременски и Автентичен Стил",
                          "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                          "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                        ],
                        [
                          "title" => "Нов Мотор",
                          "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                          "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                        ],
                        [
                          "title" => "Сериозна Забава",
                          "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                          "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                        ],
                        [
                          "title" => "Направен за Вас",
                          "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                        [
                          "title" => "Модерна Технологија",
                          "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Стил и Комфорт",
                          "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                          "itemsList" => [
                            "Bullet type LED flash",
                            "Штитници за колена",
                            "Комфортно Седло"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                            "alt" => "Speed 400 On The Road"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                            "alt" => "Speed 400 PaintJob"
                          ]
                        ],
                        [
                          "title" => "Багаж",
                          "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                          "itemsList" => [
                            "Цврсти Куфери за Багаж",
                            "Држач за Багаж",
                            "Најлонска торба за на резервоар",
                            "Најлонска Торба Roll "
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                            "alt" => "Speed 400 Luggage"
                          ]
                        ],
                        [
                          "title" => "Заштита ",
                          "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                          "itemsList" => [
                            "Гелатин",
                            "Заштита за ладник",
                            "Решетка за светло",
                            "Алуминиумска заштита",
                            "Заштита од Кал",
                            "Цевки за Заштита на Мотор (Горни и Долни)"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                            "alt" => "Speed 400 Head"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                            "alt" => "speed 400 Accessory Radiator Protection"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info2" => "Новата Thriumph Stealth Серија е достапна"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/classics/bonnevilleT100.png",
                        "alt" => "Bonneville T100 Speedmaster Range Model Image"
                      ]
                    ]
                  ],

                  "bonneville-t120" => [
                    "id" => 10,
                    "subFamilyName" => "bonneville-t120",
                    "title" => "Bonneville T120",
                    "price" => 14290,
                    "url" => "/motorcycles/classics/bonneville-t120",
                    "shortDesc" => "Т120 и Т120 Black се вистински потомци на Bonneville моторите но со модерни перформанси, технологија и можности кои сепак го поседуваат оној автентичен Британски стил и карактер.",
                    "subFamilyPageInfo" => [
                      "desc1" => ""
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "зошто баш Speed 400 !?",
                        "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                      ],
                      "reasons" => [
                        [
                          "title" => "Безвременски и Автентичен Стил",
                          "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                          "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                        ],
                        [
                          "title" => "Нов Мотор",
                          "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                          "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                        ],
                        [
                          "title" => "Сериозна Забава",
                          "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                          "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                        ],
                        [
                          "title" => "Направен за Вас",
                          "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                        [
                          "title" => "Модерна Технологија",
                          "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Стил и Комфорт",
                          "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                          "itemsList" => [
                            "Bullet type LED flash",
                            "Штитници за колена",
                            "Комфортно Седло"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                            "alt" => "Speed 400 On The Road"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                            "alt" => "Speed 400 PaintJob"
                          ]
                        ],
                        [
                          "title" => "Багаж",
                          "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                          "itemsList" => [
                            "Цврсти Куфери за Багаж",
                            "Држач за Багаж",
                            "Најлонска торба за на резервоар",
                            "Најлонска Торба Roll "
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                            "alt" => "Speed 400 Luggage"
                          ]
                        ],
                        [
                          "title" => "Заштита ",
                          "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                          "itemsList" => [
                            "Гелатин",
                            "Заштита за ладник",
                            "Решетка за светло",
                            "Алуминиумска заштита",
                            "Заштита од Кал",
                            "Цевки за Заштита на Мотор (Горни и Долни)"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                            "alt" => "Speed 400 Head"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                            "alt" => "speed 400 Accessory Radiator Protection"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info2" => "Новата Thriumph Stealth Серија е достапна"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/classics/bonnevilleT120.png",
                        "alt" => "Bonneville T120 Speedmaster Range Model Image"
                      ]
                    ]
                  ],

                  "thruxton-rs" => [
                    "id" => 11,
                    "subFamilyName" => "thruxton-rs",
                    "title" => "Thruxton RS",
                    "price" => 14290,
                    "url" => "/motorcycles/classics/thruxton-rs",
                    "shortDesc" => "Новиот Thruxton RS комбинира оригинален стил и напредни перформанси со автентичен 'cafe-racer' дизајн.",
                    "subFamilyPageInfo" => [
                      "desc1" => ""
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400ReasonsBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "зошто баш Speed 400 !?",
                        "desc" => "Време е да се разбудите од досадните соништа со Tiger Sport 660. Ова е најпристапниот мотор од Tiger фамилијата на Triumph и е спремен за секојдневни авантури.Tiger Sport 660 е дизајниран да ги надмине вашите очекувања, од авантуристички тури па се до дневни обврски. Кај нас во Triumph се е во знак на возење, а еве и зошто =>"
                      ],
                      "reasons" => [
                        [
                          "title" => "Безвременски и Автентичен Стил",
                          "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                          "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                        ],
                        [
                          "title" => "Нов Мотор",
                          "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                          "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                        ],
                        [
                          "title" => "Сериозна Забава",
                          "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                          "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                        ],
                        [
                          "title" => "Направен за Вас",
                          "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                        [
                          "title" => "Модерна Технологија",
                          "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Стил и Комфорт",
                          "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                          "itemsList" => [
                            "Bullet type LED flash",
                            "Штитници за колена",
                            "Комфортно Седло"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                            "alt" => "Speed 400 On The Road"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                            "alt" => "Speed 400 PaintJob"
                          ]
                        ],
                        [
                          "title" => "Багаж",
                          "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                          "itemsList" => [
                            "Цврсти Куфери за Багаж",
                            "Држач за Багаж",
                            "Најлонска торба за на резервоар",
                            "Најлонска Торба Roll "
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                            "alt" => "Speed 400 Luggage"
                          ]
                        ],
                        [
                          "title" => "Заштита ",
                          "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                          "itemsList" => [
                            "Гелатин",
                            "Заштита за ладник",
                            "Решетка за светло",
                            "Алуминиумска заштита",
                            "Заштита од Кал",
                            "Цевки за Заштита на Мотор (Горни и Долни)"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                            "alt" => "Speed 400 Head"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                            "alt" => "speed 400 Accessory Radiator Protection"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "1,200cc Thruxton Серија",
                      "info2" => "Автентичен Cafe Racer Дизајн",
                      "info3" => "Oдлично управување и дизајн"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/classics/truxtonRs.avif",
                        "alt" => "Thruxton RS Speedmaster Range Model Image"
                      ]
                    ]
                ],
          ],
        ];

        $familyDataThree = [
            "id" => 3,
            "type" => "roadsters",
            "shortDesc" => "Мотори кои ги менуваат правилата за 'Naked Bike'. Препознатливите 3-цилиндрични мотори на Triumph се дизајнирани за моќност, вртежен момент и моментален одговор.",
            "familyPageBannerVideo" => "roadsters/roadsterHeroVideo.webm",
            "configPageInfo" => [
                "desc" => "Triumph создава револуционерни мотоцикли и неверојатни трицилиндрични мотори со акцент на моќноста, вртежен момент и моменталната реакција.",
                "link" => "/configure/families/roadsters"
              ],
              "configFamilyPageInfo" => [
                "image" => [
                  "src" => "/images/roadsters/configFamilyBanner.avif",
                  "alt" => "Adventure Bikes Banner"
                ],
                "title" => "Додајте аксесоари на вашиот мотор",
                "link" => "/configure/bikes"
              ],
              "audioSection" => [
                "audio" => "/images/roadsters/audio.mp3",
                "title" => "Длабок Богат Три-Цилиндричен Звук",
                "desc" => "Speed Triple RS моторциклот, има чист, префинет звук благодарејки на двојниот катализаторски систем и карбонскиот врв на издувната цевка.",
                "logo" => "/images/roadsters/logoAudioSection.png"
              ],
              "promo" => [
                [
                  "title" => "НОВИОТ STREET TRIPLE 765",
                  "subFamilyType" => "street-triple-765",
                  "desc" => "Подкрепнат од еволуциран Moto2™ тркачки мотор. новата Speed Triple серија е високо перформантна, со висока спецификација и прилагодлива за секого. Цени од => €12,290.00",
                  "image" => "/images/roadsters/roadstersPromoSpeedTriple765.avif",
                  "btnBlack" => true
                ],

                [
                  "title" => "TRIDENT 660",
                  "subFamilyType" => "trident-660",
                  "desc" => "Компетативни цени, спорстки, стилски, возбудлив и прилагодлив - новиот Trident 660 може се. Вашата Tri-Reel Advantage ви е на располагање и чека на вас. Цени од €8,690.00.",
                  "image" => "/images/roadsters/roadstersPromoTrident660.avif",
                  "btnBlack" => false
                ],
                [
                  "title" => "НОВИОТ SPEED TRIPLE 1200 RR",
                  "subFamilyType" => "speed-triple-1200-rr/speed-triple-1200-rr",
                  "desc" => "Колку повозбудливо изгледа толку е повозбудлив за возење, притоа со највисокото ниво на спецификации. Цени од €20,990.00.",
                  "image" => "/images/roadsters/roadstersPromoSpeedRR.avif",
                  "btnBlack" => false
                ],
                [
                  "title" => "НАЈНОВИОТ SPEED TRIPLE 1200 RS",
                  "subFamilyType" => "speed-triple-1200/speed-triple-1200-rs",
                  "desc" => "Најмоќниот, динамичен и технолошки напреден Speed Triple мотор некогаш изработен. Цени од  €18,990.00.",
                  "image" => "/images/roadsters/roadstersPromoSpeedRS.avif",
                  "btnBlack" => false
                ],
                [
                  "title" => "3-ЦИЛИНДРИЧЕН MOTO2™ МОТОР",
                  "subFamilyType" => "/for-the-ride/racing/moto2/engine",
                  "desc" => "Потрагата по  подобар квалитет не доведе до изработна на нови 'street' мотори кои се карактеризираат со неверојатна моќност, врвни перформанси и фукнционалност. Резултат на сето ова е нај-напредната серија на 'naked' мотори кои некогаш сме ги изработиле, дизајнирани за забава и на патека и на нормални патишта.",
                  "image" => "/images/roadsters/roadstersPromoMoto2.avif",
                  "btnBlack" => false
                    ]
                 ],
                 "subFamilies" => [
                 "street-triple-765"  => [
                    "id" => 1,
                    "subFamilyName" => "street-triple-765",
                    "title" => "Street Triple 765",
                    "price" => 12290,
                    "url" => "/motorcycles/roadsters/street-triple-765",
                    "shortDesc" => "Со легендарен карактер, а со големо засилување во перформанси и технологија оваа серија го доби префиксот 'definitive streetfighter'. ",
                    "subFamilyPageInfo" => [
                      "heroSlogans" => [
                        "Перфектен",
                        "спортски моторцикл",
                        "со тркачки мотор"
                      ],
                      "topSection" => [
                        "title" => "Врвни Перформанси ",
                        "desc" => "Подкрепнат од еволуција на Moto2™ тркачки мотор, Speed Triple 765 е мотор со врвни перформанси и висока спецификација.",
                        "subtitle" => "Најдобриот “naked“ моторцикл - на пат и на тркачка патека."
                      ],
                      "youtubeVideo" => "https://www.youtube.com/embed/Hd3QZKRIT0Y",
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, 12 вентили, 2EEK, линиски 3-цилиндри"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "765 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "78.0 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "53.4 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "13.25 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "120-130 (130 за Street Triple 765 R & Mото2™ Edition)"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "80 Nm @ 9,500 rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Sequential multi-point electronic injection with electronic throttle"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "X-ring chain"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Liquid, multi-disc, assisted glide"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "Double-beam aluminum with 2-piece high-pressure die-cast subframe"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "17 x 3.5' леан алуминиум со 5 краци"
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "17 x 3.5' леан алуминиум со 5 краци"
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "120/70 ZR 17"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "180/55 ZR 17"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Showa Big Piston 115мм inverted вилушка со прилагодувања за компресија, враќање и претходно оптоварување"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Showa piggyback monoshock 133.5mm задна суспензија со систем за прилагодувања за компресија, враќање и претходно оптоварување"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Дупли дискови од 310m"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Еден диск од 220mm, Brembo клешта со ABS"
                          ],
                          [
                            "title" => "инструментна плочка",
                            "desc" => "Мултифункционален TFT екран"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "792 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1047 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "826 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1402 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "23.7º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "97.8 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "192 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "15 L"
                          ],
                          [
                            "title" => "Tежина при полн резервозар",
                            "desc" => "189 kg"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "52.8 mpg (5.4 литри / 100 km)"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "120g/km - Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                          ],
                          [
                            "title" => "Сервисен Интервал",
                            "desc" => "10.000km / 12 месеци"
                          ]
                        ]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "Најновиот и Првенец во класата на “Streetfighter“ Моторцикли",
                          "desc" => "Сега, уште повеќе сила благодарејки на Мото2 моторот со неверојатна агилност, агресивен изглед и електронска технологија која поставува нови стандарди.",
                          "image" => "/images/roadsters/streetTriple765/streetTriple765GrayCaro1.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "Новиот Репер Во класата на “naked“ моторцикли",
                          "desc" => "ТНови технолошки унапредувања, агилност, највисока запирачка спецификација и новиот репер во смисла на моќност во класата.",
                          "image" => "/images/roadsters/streetTriple765/streetTriple765GrayCaro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Нај-моќната серија досега",
                          "desc" => "Со голем чекор напред во развивање на Мото2 моторот, Street Triple серијата се закити со уште повеќе обртен момент и сила - 120 РЅ за R верзијата и 130 РЅ за RS Verzijata.",
                          "image" => "/images/roadsters/streetTriple765/streetTriple765GrayCaro3.avif"
                        ]
                      ],
                      "youtubeVideosCarousellItems" => [[
                          "src" => "https://www.youtube.com/embed/cDNnqoRB50w",
                          "title" => "Triumph Street Triple Launch Valencia 2022"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/A6MwjE782iI",
                          "title" => "Web | Street Triple R Hero"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/Qj9dxotylh0",
                          "title" => "Web | Street Triple RS Hero"
                        ],
                        [
                        "src" => "https://www.youtube.com/embed/--p8YSQxEp0",
                        "title" => "Web | Engine In Motion Street Triple 765"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/JR-wXQFKG2Q",
                          "title" => "Web - DE | Street Triple R | Features and Benefits"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/cDNnqoRB50w",
                          "title" => "Triumph Street Triple Launch Valencia 2022"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/kP7FA3k6Hv8",
                          "title" => "New Street Triple 765 RS | Features and Benefits"
                        ]
                      ],
                      "audioSection" => [
                        "audio" => "/images/roadsters/streetTriple765/streetTriple765Sound.mp3",
                        "title" => "Три-цилиндречен звук кој го тресе земјиното тло.",
                        "desc" => "Новиот издувен систем го испорачува оној препознатлив три-цилиндарски звук на моторот.",
                        "logo" => null
                      ],
                      "specNumbers" => [
                        [ "data" => "765", "info" => "cc Мотор" ],
                        [ "data" => "80", "info" => "Nm обртен момент" ],
                        [ "data" => "120-130", "info" => "PS - Максимална Сила" ],
                        [ "data" => "10.000", "info" => "КМ Сервисен Интервал" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/roadsters/streetTriple765/streetTriple765ReasonsBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Причини зошто да ja оберете Street Triple 765 серијата."

                      ],
                      "reasons" => [
                        [
                          "title" => "Мотор",
                        "desc" => "Користејќи го знаењето стекнато од програмата за тркачки мотори Moto2™, Street Triple R сега произведува 120 КС при 11.500 вртежи во минута, додека RS и Moto2™ Edition испорачуваат максимални 130 КС при 12.000 вртежи во минута. Овие подобрувања беа направени без да се загрози репутацијата на Street Triple за доверливост, една од многуте причини поради кои организаторите на Moto2™ неодамна го продолжија договорот за користење на трицилиндричен мотор од 765 кубици. до крајот на 2024 година. Повисокиот сооднос на компресија, новите клипови, поврзувачките шипки и игличките на клипот, усогласени со новите оптимизирани комори за согорување нудат зголемено ограничување на притисокот во цилиндарот и на крајот поголема моќност. Новите вентили и брегасти вратила даваат зголемено подигање. Вентил за подобрени перформанси за внесување, согорување и издувни гасови, додека новите соодноси на менувачот носат подобрена ефикасност и одговор, што на крајот обезбедува побрзо забрзување, што значи дека оваа нова генерација е најострата и најживата досега. Значително ревидиран и ажуриран за да произведе повеќе моќ од кога било досега, моторот од 765 кубици. добиен од Moto2™ го испорачува препознатливиот Street Triple звук. Правејќи го тврдото отворање на гасот уште позависно, ревидираниот довод на воздух дава застрашувачки татнеж. А, со зголемена компресија и поефикасно согорување, звукот создаден од новиот издувен систем и послободниот заден дел е чиста Moto2™ магија.",
                          "video" => "https://www.youtube.com/embed/QKxDQhOaI0U"
                        ],
                        [
                          "title" => "Шасија",
                          "desc" => "Изграден со одлично управување за сигурно возење во сите сценарија, новиот Street Triple е вистинска радост за возење на патеката. Висококвалитетните сопирачки на Brembo заедно со врвната Showa и Öhlins суспензија и неверојатните Pirelli Supercorsa SP V3* гуми ја обезбедуваат способноста потребна за да се вози блиску до лимитот со сигурност. Брзиот менувач со помош на менувачот за менување на брзини без спојка е стандарден кај сите модели на Street Triple, како и оптимизиран ABS во свиоци и контрола на тракцијата. Во зависност од избраниот возач, овие технолошки напредни системи нудат исклучителни нивоа на помош на возачот за побезбедно возење со помалку наметливи поставки достапни за дополнителна способност за фокусирање на патеката. * само кај изданијата RS и Moto2™, R се одликува со пневматиците Continental ContiRoad кои се повеќе фокусирани на патот. Пластиката, резервоарот за гориво од 15 литри, капаците на ладилникот и финишот на фаровите се редизајнирани за поостар, поагресивен изглед, јасно задржувајќи ја иконската дизајнерска ДНК на Street Triple.nОвој нов, спуштен нос со почисти, поостри линии и тие препознатливи двојни фарови доаѓа рака под рака со целото познато неутрално и неверојатно агилно управување на Street Triple.",
                          "video" => "https://www.youtube.com/embed/Ppx4BokT26o"

                        ],
                        [
                          "title" => "Направен за Вас",
                          "desc" => "Оптоварена со технологија фокусирана на возачот, дизајнирана да го подобри возењето, најновиот опсег на Street Triple има придобивки од големата надградба на електрониката.Новиот Optimized Cornering ABS и исклучувачкиот Optimized Cornering Traction Control System обезбедуваат оптимални перформанси за сопирање и влечење под кој било агол, и на патот и на патеката, во сите услови на возење. Надградени се и режимите на возење со нови мапи за гас. Лесно може да се избере преку интуитивното мени од 5 инчи TFT и ергономски оптимизираниот Возачите се исто така надградени со нови мапи за гас. Лесно може да се избере преку интуитивното мени со TFT екран од 5' и ергономски оптимизираните прекинувачи, совршената поставка е секогаш на дофат. Функција на Bluetooth како додаток, целосно LED осветлување, со дневни светла на RS и Moto2TM Edition... има дури и практичен USB приклучок под седлото за полнење телефони и периферни уреди.",
                          "video" => "https://www.youtube.com/embed/xHNIjTSIRiA"
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/roadsters/streetTriple765/streetTriple765TopSectionImageBG.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Технологија",
                          "desc" => "Веќе преполна со иновации, најновата генерација Street Triple има неколку полиња за штиклирање во однос на технологијата.Новата контрола на патувањето е совршен додаток за возачите кои поминуваат многу време на автопати и/или возат во области со зголемена брзина. Одржувањето на поставената брзина ја подобрува економичноста на горивото и го намалува заморот, давајќи и на десната рака поголема слобода да се наведнува на долги растојанија.За целосно искористување на способноста за Bluetooth на 5' TFT дисплејот, достапна е единица за целосно поврзување My Triumph. Ова овозможува ракување со телефонот и музиката и нуди навигација чекор-по-сврт.Тркалачките LED индикатори комбинираат стил со технологија и нудат персонализација, како и дополнително подобрување на видливоста на другите учесници во сообраќајот.",
                          "itemsList" => [
                            "Темпомат",
                            "My Triumph Bluetooth Уред",
                            "LED Трапкачи"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/streetTriple765/streetТriple765АccessoriesCruiseControl.avif",
                            "alt" => "Street Тriple 765 Cruise Control"
                          ],
                          "image2" => [
                            "src" => "/images/roadsters/streetTriple765/streetТriple765АccessoriesTFTl.avif",
                            "alt" => "Street Тriple 765 TFT"
                          ]
                        ],
                        [
                          "title" => "Заштита и Комфорт",
                          "desc" => "Одржувањето на вашата нова Street Triple безбедна од оштетување, штитниците за рамката и за нишање ги надополнуваат овие карактеристични и агресивни линии, додека штитниците на капакот на моторот, дизајнирани да одговараат совршено, нудат дискретно, но ефективно ублажување на оштетувањето во случај на пад.Достапен е елегантен визир за да се намали ветерот и да се подобри удобноста на долги растојанија, додека возачите за сите временски услови можат да уживаат во зимскиот пат со топли раце без жици да им пречат на рачките, со внатрешно жичените грејни рачки. Достапни се и рачки за држење на патници за дополнителна удобност и безбедност.Завртките за монтирање на тркачки штанд додаваат удобност за задачите за рутинско одржување, а премиум марката Triumph ќе обезбеди вашиот велосипед да остане чист и подготвен за следното возење.",
                          "itemsList" => [
                            "Штитиници на шасија",
                            "Штитници за вилушки",
                            "Штитници за мотор",
                            "Греачи на волан",
                            "Рачки за држење на совозач",
                            "Брендирана Triumph Покривка",
                            "Предна Маска",
                            "Штрафови за тркачка ногарка"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/streetTriple765/streetТriple765АccessoriesPassengerGrabs.avif",
                            "alt" => "Street Triple 765 Passenger Grabs"
                          ]
                        ],
                        [
                          "title" => "Стил и Детали",
                          "desc" => "Иако Street Triple е несомнено прекрасен велосипед, со толку многу различни стилски додатоци достапни, персонализирањето и правењето на вашата Street Triple навистина ваше никогаш не било полесно. Определите вклучуваат долен капак на опашката и бел LED систем за задни светла за почист заден дел. За помалите, но не помалку важни детали се води сметка и со високо обработените компоненти, како што е резервоарот за течност за сопирачките.",
                          "itemsList" => [
                            "Завршен Детал на крајот од моторот (Држач Регистрација)",
                            "Бели LED задни светла",
                            "Машинско Изработени Резервоари за Течност за Сопирачки "
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/streetTriple765/streetТriple765АccessoriesMask.avif",
                            "alt" => "Street Triple 765 Mask"
                          ],
                          "image2" => [
                            "src" => "/images/roadsters/streetTriple765/streetТriple765АccessoriesTailKit.avif",
                            "alt" => "Street Triple 765 Tail Kit"
                          ]
                        ],
                        [
                          "title" => "Багаж",
                          "desc" => "Забавниот и динамичен карактер на Street Triple го прави секое возење пријатно, од долги рекреативни возења до патувања до работа за сите временски услови. Дополнително на неговата практичност, стилската дополнителна водоотпорна торба со резервоар и опашката торбичка може брзо да се откачат од велосипедот за лесно користење и секојдневна практичност..",
                          "itemsList" => [
                            "Торба за Резервоар",
                            "Торба за Багажник"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/streetTriple765/streetТriple765АccessoriesTailBag.avif",
                            "alt" => "Street Triple 765 Tail Bag"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "765cc мотор",
                      "info2" => "Максимална јачина од 120-130 PS",
                      "info3" => "10000 км сервисен интервал"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/roadsters/streetTriple765.png",
                        "alt" => "Street Triple 765 Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/roadsters/streetTriple765/streetTriple765SubFamHeroVideo.webm",
                        "alt" => "Street Triple 765 Video"
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/roadsters/streetTriple765/streetTriple765TopSectionImage.avif",
                        "alt" => "Street Triple 765 Motorcycle"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/roadsters/streetTriple765/streetTriple765TopSectionImageBG.avif",
                        "alt" => "Street Triple 765 Motorcycle BG"
                      ]
                    ]
                  ],

                  "street-triple-moto2" => [
                    "id" => 2,
                    "subFamilyName" => "street-triple-765",
                    "title" => "Street Triple 765",
                    "price" => 12290,
                    "url" => "/motorcycles/roadsters/street-triple-765",
                    "shortDesc" => "Со легендарен карактер, а со големо засилување во перформанси и технологија оваа серија го доби префиксот 'definitive streetfighter'. ",
                    "subFamilyPageInfo" => [
                      "heroSlogans" => [
                        "Перфектен",
                        "спортски моторцикл",
                        "со тркачки мотор"
                      ],
                      "topSection" => [
                        "title" => "Врвни Перформанси Во Класата",
                        "desc" => "Подкрепнат од еволуција на Moto2™ тркачки мотор, ова е нај-версатилниот, најмоќниот Стреет Трипле мотор досега.",
                        "subtitle" => "Најдобриот “naked“ моторцикл - на пат и на тркачка патека."
                      ],
                      "youtubeVideo" => "//www.youtube.com/embed/l5B_Rd4cgHE",
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "660 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "74.04 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "51.1 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "11.95 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "64 Nm @ 6,250 rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "X-ring chain"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Wet, multi-plate, slip"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "тубуларна челична шасија"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "19 x 2.5' die-cast легура "
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "17 x 4.25' die-cast легура "
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "100/90-19"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "150/70R17"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Marzocchi Inverted Fork 45mm"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Marzocchi задна суспензија со систем за подесување"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                          ],
                          [
                            "title" => "инструментна плочка",
                            "desc" => "5 TFT екран"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "830 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1410-1460 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "820-840 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1556 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "24.6 º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "133.3 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "192 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "20 L"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "5.2l /100km"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                          ]
                        ]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "Вашиот MOTO2™ тркач за на пат",
                          "desc" => "Лимитирано на 765 парчиња во секој од тркачки инспирираните дизајни, со сила која е лидер во својата класа и со потполно прилагодливи Öhlins вилушки.",
                          "image" => "/images/roadsters/moto2/streetTripleMoto2GrayCaro3.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "Новиот Репер Во класата на “naked“ перформантни моторцикли",
                          "desc" => "Нови технолошки унапредувања, агилност, највисока запирачка спецификација и новиот репер во смисла на моќност во класата.",
                          "image" => "/images/roadsters/moto2/streetTripleMoto2GrayCaro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Нај-моќната серија досега",
                          "desc" => "Со голем чекор напред во развивање на Мото2 моторот, Street Triple серијата се закити со уште повеќе обртен момент и сила - 120 РЅ за R верзијата и 130 РЅ за RS Verzijata.",
                          "image" => "/images/roadsters/moto2/streetTripleMoto2GrayCaro3.avif"
                        ]
                      ],
                      "youtubeVideosCarousellItems" => [[
                          "src" => "//www.youtube.com/embed/cDNnqoRB50w",
                          "title" => "Triumph Street Triple Launch Valencia 2022"
                        ],
                        [
                          "src" => "//www.youtube.com/embed/csViBxs5FSQ",
                          "title" => "Street Triple Moto2TM Edition | First Ride at Valencia"
                        ],
                        [
                          "src" => "//www.youtube.com/embed/cDNnqoRB50w",
                          "title" => "Triumph Street Triple Launch Valencia 2022"
                        ],
                        [
                        "src" => "//www.youtube.com/embed/PT4txMuuBBs",
                        "title" => "New Street Triple 765 Moto2 Edition | Features and Benefits"
                        ],
                        [
                          "src" => "//www.youtube.com/embed/l5B_Rd4cgHE",
                          "title" => "Web | Street Triple Moto2 Edition"
                        ],
                        [
                          "src" => "//www.youtube.com/embed/--p8YSQxEp",
                          "title" => "Web | Engine In Motion Street Triple 765"
                        ]
                      ],
                      "audioSection" => [
                        "audio" => "/images/roadsters/streetTriple765/streetTriple765Sound.mp3",
                        "title" => "Три-цилиндречен звук кој го тресе земјиното тло.",
                        "desc" => "Новиот издувен систем го испорачува оној препознатлив три-цилиндарски звук на моторот.",
                        "logo" => null
                      ],
                      "specNumbers" => [
                        [ "data" => "765", "info" => "cc Мотор" ],
                        [ "data" => "80", "info" => "Nm обртен момент" ],
                        [ "data" => "130", "info" => "PS - Максимална Сила" ],
                        [ "data" => "10.000", "info" => "КМ Сервисен Интервал" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/roadsters/streetTriple765/streetTriple765TopSectionImageBG.avif"
                      ],
                      "infoText" => [
                        "title" => "Причини зошто да ja оберете Street Triple 765 серијата",
                        "desc" => "Доделена од печатот и од сопствениците од нејзиното лансирање во 2007 година, оваа нова генерација Street Triple се одликува со специфичен нов стил, подобрена ергономија и ревидирана геометрија што дава уште подобра агилност. Најмоќната серија Street Triple досега, со надградби на моторот добиени директно од рекордната програма за трки со мотори Moto2™, во комбинација со шасијата Street Triple светски позната по прецизно управување.Изграден според највисоките спецификации досега, со значителен напредок во суспензијата, сопирачките и технологијата, гамата Street Triple од 2023 година поставува нов репер за спортски велосипеди со голи перформанси.Веќе Уникатниот карактер на Street Triple е дополнително подобрен со серија надградби и поагресивен нов изглед.Подобрени перформанси на моторот, напредок во технологијата фокусирана на возачот, подобрена ергономија на возачот и суспензија и сопирачки со повисоки спецификации, плус целокупниот груб звук во доводот на Street Triple и нови комбинирани издувни гасови со послободно течење за да се постави нов репер во Street Triple моќност и управување. и забава."
                      ],
                      "reasons" => [
                        [
                          "title" => "Безвременски и Автентичен Стил",
                          "desc" => "Conceived and designed in Hinckley, UK, the Speed ​​400 has been built with the same meticulous attention to detail as every Triumph model. This stunning motorcycle combines timeless design DNA with modern performance. The unmistakable Triumph roadster silhouette, distinctive sculpted fuel tank and classic engine profile echo legends of the past and with exquisite details such as the distinctive cylinder head with radiators, concealed liquid cooling, traditional exhaust header clamps and modern anode muffler, the dazzling blend of retro and modern styling embodies the unique charm of Triumph's famous Modern Classic range.",
                          "image" => "/images/classics/speed400/speed400ReasonsStyle.avif"
                        ],
                        [
                          "title" => "Нов Мотор",
                          "desc" => "The brand new 398cc single cylinder engine. fuel-injected combines modern classic Triumph styling with state-of-the-art technology to deliver 40bhp and 37.5Nm of peak torque with a rich, signature exhaust note from the twin-pipe muffler. Technical features include a four-valve, 2EEK cylinder head and a crankshaft that is perfectly weighted and balanced to optimize inertia for low-speed driving. A rocker arm valvetrain with low reciprocating mass and friction-reducing DLC ​​coatings also contribute to the incredible performance of this nimble yet supple engine. The six-speed gearbox offers a light, precise gear selection with ratios perfectly spread out to get the most out of this exciting, characterful and torque-rich engine. ",
                          "image" => "/images/classics/speed400/speed400ReasonsMotorImage.avif"
                        ],
                        [
                          "title" => "Сериозна Забава",
                          "desc" => "The Speed ​​400 is all about having fun. The comfortable and attractive riding position gives the ideal balance of weight between the three points of contact for that 'just right' feel, which has become synonymous with Triumph. Riders of all sizes feel right at home on the Speed ​​400 from the very first ride, thanks to the light and compact 398cc engine. and the slim waist makes the 790mm seat height even more approachable, for a confidence-inspiring ride and easy on-the-spot maneuvering.",
                          "image" => "/images/classics/speed400/speed400ReasonsFun.avif"
                        ],
                        [
                          "title" => "Направен за Вас",
                          "desc" => "No two riders are the same, so you can personalize your Tiger Sport 660 with a choice of three special colors and graphics and over 40 genuine Triumph accessories. From built-in luggage to a central case that holds 2 helmets, you'll be inspired by the options to suit your adventure. When everyday flexibility is your goal, you shouldn't be left behind. The bike is designed with the rider in mind - make it your own."
                        ],
                        [
                          "title" => "Модерна Технологија",
                          "desc" => "The Speed ​​400 is equipped with technology designed to improve every ride. The Torque Assist Clutch is an intelligent system that reduces the force on the clutch lever to improve ease of use and rider comfort when stopping/starting, and reducing travel fatigue. wheel for greater performance and safety.."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/classics/speed400/speed400AccessoryBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Стил и Комфорт",
                          "desc" => "Choose from a range of parts that will make the Speed ​​400 just the way you want it. Direct replacement bullet turn signals a subtle new look and premium touch with their satin black body and machined aluminum bezels.. Or maybe you want to remodel the tank with different knee pads? A comfortable saddle with a stitched and quilted finish makes a style statement and, together with plug and play heated grips, offers luxury on longer rides..",
                          "itemsList" => [
                            "Bullet type LED flash",
                            "Штитници за колена",
                            "Комфортно Седло"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400SAccesoryStyleImage1.avif",
                            "alt" => "Speed 400 On The Road"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryStyleImage2.avif",
                            "alt" => "Speed 400 PaintJob"
                          ]
                        ],
                        [
                          "title" => "Багаж",
                          "desc" => "A full range of Speed ​​400-specific luggage has been created to add some practicality to the fun. The Speed ​​400 is the perfect touring bike, and outfitting it to handle your load really couldn't be easier. Choose from sturdy side or rigid and semi-rigid panniers, each with their own special mounting system or, for those who prefer to travel light, a simple luggage rack, nylon tank bag or roll-on bag could be the perfect choice .",
                          "itemsList" => [
                            "Цврсти Куфери за Багаж",
                            "Држач за Багаж",
                            "Најлонска торба за на резервоар",
                            "Најлонска Торба Roll "
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryLuggageImage.avif",
                            "alt" => "Speed 400 Luggage"
                          ]
                        ],
                        [
                          "title" => "Заштита ",
                          "desc" => "Both your protection from the elements and that of the Speed ​​400 have been taken care of. A visor with a special fitting kit is also available to deflect the wind to reduce rider fatigue on longer rides. Easy to fit and with style to match, it's a must-have addition for distance riders.To keep the Speed ​​400 out of harm's way on rougher roads, there's an aluminum skid plate, a radiator guard and a headlight mask, which comes with its own bezel for easy fitting, and offers excellent protection from rocks and debris. All-weather riders may want to add the mudguard kit which consists of front and rear mudguard extensions and a rear wing. These combine nicely to protect against water spray and extend the life of the rear shock in extreme conditions.Upper and lower engine guards are also available — these provide excellent protection against drops and spills, a must-have addition for city and country driving.",
                          "itemsList" => [
                            "Гелатин",
                            "Заштита за ладник",
                            "Решетка за светло",
                            "Алуминиумска заштита",
                            "Заштита од Кал",
                            "Цевки за Заштита на Мотор (Горни и Долни)"
                          ],
                          "image1" => [
                            "src" => "/images/classics/speed400/speed400AccessoryProtectionImage1.avif",
                            "alt" => "Speed 400 Head"
                          ],
                          "image2" => [
                            "src" => "/images/classics/speed400/speed400AccessoryRadiatorProtection.avif",
                            "alt" => "speed 400 Accessory Radiator Protection"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "765cc мотор",
                      "info2" => "Максимална јачина од 120-130 PS",
                      "info3" => "10000 км сервисен интервал"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/roadsters/streetTriple765.png",
                        "alt" => "Street Triple 765 Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/roadsters/moto2/streetTripleMoto2HeroVideo.mp4",
                        "alt" => "Street Triple 765 Moto2 image"
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/roadsters/moto2/streetТriple765TopSectionImage.avif",
                        "alt" => "Street Triple 765 Moto2 image"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/roadsters/moto2/streetТriple765TopSectionImageBG.avif",
                        "alt" => "Street Triple 765 Moto2 image BG"
                      ]
                    ]
                  ],
                  "trident-660" => [
                    "id" => 3,
                    "subFamilyName" => "trident-660",
                    "title" => "Trident 660",
                    "price" => 8690,
                    "url" => "/motorcycles/roadsters/trident-660",
                    "shortDesc" => "И спортски, и стилски, и возбудлив и со конкурентна цена - сето ова го може новиот Trident 660.",
                    "subFamilyPageInfo" => [
                      "heroSlogans" => [
                        "Перфектен",
                        "спортски моторцикл",
                        "со тркачки мотор"
                      ],
                      "topSection" => [
                        "title" => "Забавата е загарантирана",
                        "desc" => "Три-цилиндарски перформанси, технологија и спецификации кои се лидери во класата - сето ова со компетативна цена.",
                        "subtitle" => "...возбудливo, флексибилно и динамично однесување на пат со технологија по која секој ќе завидува - Lee Morisson менаџер на сите каскадери на James Bond."
                      ],
                      "youtubeVideo" => "https://www.youtube.com/embed/Po5n-cI9EQw",
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "660 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "74.04 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "51.1 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "11.95 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "64 Nm @ 6,250 rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "X-ring chain"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Wet, multi-plate, slip"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "тубуларна челична шасија"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "19 x 2.5' die-cast легура "
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "17 x 4.25' die-cast легура "
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "100/90-19"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "150/70R17"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Marzocchi Inverted Fork 45mm"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Marzocchi задна суспензија со систем за подесување"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                          ],
                          [
                            "title" => "инструментна плочка",
                            "desc" => "5 TFT екран"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "830 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1410-1460 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "820-840 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1556 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "24.6 º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "133.3 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "192 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "20 L"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "5.2l /100km"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                          ]
                        ]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "660сс три-цилиндричени перформанси",
                          "desc" => "Три-цилиндарскиот мотор од 66сс, ви нуди перфектен баланс помеѓу обртен момент на низок обртај и возбудлива сила и респонзивност при високи обртаи.",
                          "image" => "/images/roadsters/trident660/trident660GrayCaro1.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "технологија",
                          "desc" => "Лидер во класата по технологија, TFT инструментна плоча, LED расвета, 2 мода на работа, АВЅ и систем за пролизгување за подобра сигурност и контрола.",
                          "image" => "/images/roadsters/trident660/trident660GrayCaro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Стил",
                          "desc" => "Препознатливиот минималистичен изглед и спортката силуета го краси Trident и му дава карактер и стил.",
                          "image" => "/images/roadsters/trident660/trident660GrayCaro3.avif"
                        ]
                      ],
                      "youtubeVideosCarousellItems" => [
                        [
                          "src" => "https://www.youtube.com/embed/JHUeNjilnXA",
                          "title" => "New Triumph Trident 660 Engine Story"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/4qnpPzumJTs",
                          "title" => "New Triumph Trident 660 - Live Launch Even"
                        ],
                        [
                        "src" => "https://www.youtube.com/embed/lLNvbwE0rfo",
                        "title" => "New Triumph Trident 660 Features and Benefits"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/L429P5w78HM",
                          "title" => "The New Triumph Trident 660 - Web"
                        ]
                      ],
                      "audioSection" => [
                        "audio" => "/images/roadsters/streetTriple765/streetTriple765Sound.mp3",
                        "title" => "Три-цилиндречен звук кој го тресе земјиното тло.",
                        "desc" => "Новиот издувен систем го испорачува оној препознатлив три-цилиндарски звук на моторот.",
                        "logo" => null
                      ],
                      "specNumbers" => [
                        [ "data" => "660", "info" => "cc Мотор" ],
                        [ "data" => "64", "info" => "Nm обртен момент" ],
                        [ "data" => "81", "info" => "PS - Максимална Сила" ],
                        [ "data" => "16.000", "info" => "КМ Сервисен Интервал" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/roadsters/trident660/trident660TopSectionImageBG.avif"
                      ],
                      "infoText" => [
                        "title" => "Trident 660"
                      ],
                      "reasons" => [
                        [
                          "title" => "Возбудлив Три-Цилиндарски Мотор со Оцлични Перформанси",
                          "desc" => "Централно место за моќта, разновидноста и возбудливите перформанси на Trident 660 е неговиот мотор од 660 кубика. Трицилиндричен Triumph мотор кој нуди совршена рамнотежа на силен вртежен момент (очигледен од низок до висок), кој достигнува врв на 67 Nm @ 8.000 вртежи во минута и возбудлива моќ што достигнува врвни 80 КС @ 8.900 вртежи во минута.nКога станува збор за квалитетот на возењето, има чувство без напор во Trident 660. Мазниот и остар менувач со 6 брзини е оптимизиран за забавно и лесно возење, додека спојката со помош на влечки обезбедува лесно вклучување што го намалува заморот, овозможувајќи ви да уживате во тоа извонреден мотоцикл подолго.",
                          "image" => "/images/roadsters/trident660/trident660Reason1.avif"
                        ],
                        [
                          "title" => "Лидерска Технологија во Класата која доаѓа како СТАНДАРД",
                          "desc" => "Мултифункционалните инструменти на Trident 660 со TFT дисплеј во боја ги обезбедуваат сите основни информации во компактен и компактен дизајн за лесна и брза интеракција додека возите. Дисплејот е специјално дизајниран за опционалниот систем за поврзување што одговара на додатоците кој овозможува навигација „сврт по свиок“, контрола на GoPro, како и интеракција со телефонот и музиката преку прекинувачот на воланот - сето тоа јасно се прикажува на TFT екранот. Новиот Trident 660 има корист од најсовремената електроника, вклучително и програмите за возење на патот и дождот, кои ги прилагодуваат мапите за гас и контрола на тракцијата на мотоциклот за максимална контрола на возачот (со режимот Дожд кој се одликува со помека карта за подобрена безбедност), возење со гас -по жица за остар, прецизен одговор на вбризгувањето, прилагодлива контрола на тракцијата која управува со моќноста и вртежниот момент кога влечењето се губи и најновата генерација на ABS на Triumph за дополнителна безбедност на возачот. Целосното LED осветлување произведува подобри перформанси за максимална безбедност на возачот. Новиот препознатлив 7-инчен LED фар е уникатно дизајниран за Trident 660, додека компактното и интегрирано задно светло е усогласено со обликот на задната опашка. Суптилните само-поништувачки LED трепкачи додаваат на високото ниво на удобност на возачот на Trident 660 (може да важат ограничувања на локалниот пазар)."
                        ],
                        [
                          "title" => "Флексибилен, спортски со возачко искуство кое буди самодоверба",
                          "desc" => "Како Triumph мотоцикл, Trident нуди чувство на самодоверба за возење со лесно и неверојатно смирувачко управување, возбудливи перформанси и фантастична сигурност. Со малата тежина на рачките, имате стабилен мотоцикл кој е лесен и забавен за возење, додека суспензијата и сопирачките со високи спецификации се совршено комбинирани со лесните спортски алуминиумски тркала од 17 инчи за максимална маневрирање. Веднаш штом ќе се качите на овој мотоцикл, ќе ја забележите опуштената ергономија на возење, бидејќи сè за Trident 660 е дизајнирано да биде вашето совршено секојдневно искуство во возењето. Удобното и практично двојно седло има пристапна висина од 805 mm, додека тесната ширина на велосипедот инспирира самодоверба при стоење, со лесен пристап до стапките и прилагодлива рачка на сопирачките за дополнителна, подолготрајна удобност. Супериорната комбинација на суспензија, гуми и сопирачки на Trident 660 за удобно и сигурно возење вклучува => Систем за суспензија Showa со високи спецификации (црна превртена вилушка со 120мм патување на тркалата и прилагодлив заден амортизер однапред со 133,5мм патување на тркалата) Повеќедимензионални гуми Michelin „Road 5“ вградени стандардно, обезбедувајќи перформанси и доверба во влажни и суви услови. Голема моќ на запирање од системот за сопирање Nissin (предни пловечки клешти со 2 клипови со двојни дискови од 310 mm и единечен заден дебеломер и диск)"
                        ],
                        [
                          "title" => "Одлична Вредност",
                          "desc" => "Технолошкиот стандард на највисоко ниво на Trident 660, суспензијата со високи спецификации, сопирачките и гумите, агилното и сигурно возење, возбудливите перформанси на трицилиндричниот мотор, уникатниот стил и многу конкурентната цена го прават совршен избор на мотоцикли од средна класа. класа - и совршен влез во палетата Triumph. Врвниот сервисен интервал од 16.000 km (или 12 месеци) исто така придонесува за неверојатно ниската цена на сопственоста."
                        ],
                        [
                          "title" => "Препознатлив Стил",
                          "desc" => "Вклучувајќи ја дизајнерската ДНК на Triumph со чисти динамични линии, ова е навистина неверојатен мотоцикл со препознатлива спортска и мускулеста силуета и карактер. Trident 660 е достапен во четири различни комбинации на бои => кристално бела или црна сафир, двете со контрастни налепници или две опции за двојна боја Matt Jet Black & Matt Silver Ice или Silver Ice & Diablo Red. Велосипедот е дизајниран со карактеристики кои го истакнуваат препознатливиот изглед на Trident 660, вклучувајќи дизајн на резервоарот за гориво од 14 литри со извајани вдлабнатини на колената, црни тркала од лесно легура со пет краци и минималистичка опашка со држач за регистарски таблички и трепкач со ножици. Контрастно обоени капачиња за радијатори, мостови за виљушка и штитници за пети, заострените алуминиумски рачки и ретровизори со солзи, сето тоа придонесува за извонредното ниво на завршница на овој велосипед. Луксузната ознака Triumph додава одлични допири. Значка од алуминиумски влошки Trident 660 со натписи со дијамантски исечени натписи, ефектот на обработка со дијамант е надополнет со механичка значка Triumph на капачето за полнење гориво, значка Triumph на фарот и задното светло, брендирана клешта за рачката на Triumph и ознака Triumph на мотоциклот TFT дисплеј на инструменти лице (може да се применуваат пазарни ограничувања)."
                        ]
                        ,
                        [
                          "title" => "Оригинални Аксесоари",
                          "desc" => "Можете да го персонализирате вашиот нов Trident 660 со избирање од цела палета на оригинални Triumph додатоци, развиени заедно со самиот велосипед и подложни на истиот ригорозен квалитет и процедури за тестирање. Со преку 45 достапни додатоци, вклучително и новите Trident 660, системот за поврзување My Triumph (за навигација, контрола на GoPro, телефон и музика) и додатоци кои нудат уште поголема удобност, заштита и стил, можете да го подобрите Trident 660 со неколку начини. Trident 660 може да биде опремен со опционален комплет за конверзија А2 кој ги ограничува перформансите на нивоа погодни за имателите на лиценца А2. Ова вклучува специјален држач за APS за A2 и специјална програма за моторот, ограничувајќи ја максималната моќност и максималниот вртежен момент. Овластена работилница на Triumph може да го врати мотоциклот со целосна моќност. Оригиналните додатоци на Triumph стандардно доаѓаат со двегодишна неограничена километарска гаранција."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/roadsters/trident660/trident660AccessoriesBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Подобрен Изглед",
                          "desc" => "Можете да додадете удобност и стил со маската вбризгувана. Дизајниран да го намали заморот од ветер, тој е подготвен да додаде нови мазни линии на вашиот Trident. Со централната плоча што одговара на бојата на велосипедот, без видливи држачи и црна врежана надворешност, ќе даде беспрекорен изглед за дополнителна заштита од ветер. Надградете го вашиот заден вид со обработени крилни ретровизори. Нивниот лесен алуминиумски црн анодизиран финиш, со CNC контра-сечење, ќе ги подобри линиите на Trident. Додадете ја алуминиумската кара за да добиете подобрени панели за заштита од топлина за издувниот колектор, обезбедувајќи уште почисти линии и супериорна заштита од топлина. Прецизно изработени, овие делови го надополнуваат дизајнот на фаровите и минималистичките линии, подобрувајќи ја целокупната силуета додека го одржуваат чистиот изглед на Trident. Ласерското гравирање на логото го додава завршниот допир на горд изглед.",
                          "itemsList" => [
                            "Предна Маска - Исто боја како Моторциклот",
                            "Класични Ретровизори",
                            "Алуминиунмски Дотатоци на Моторот"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/trident660/trident660AccessoriesImg1.avif",
                            "alt" => "Trident 660"
                          ],
                          "image2" => [
                            "src" => "/images/roadsters/trident660/trident660AccessoriesImg2.avif",
                            "alt" => "Trident 660"
                          ]
                        ],
                        [
                          "title" => "Безбедност - за мирни и спокојни авантури",
                          "desc" => "Специјално дизајнирана за линиите на Trident, заштитата не мора да го загрозува стилот. Додадете ја потребната заштита за мир на умот при секое возење. Заштита на рамката, штитници на предната оска, комплет за капак на моторот и подлога на резервоарот. Целиот бренд Triumph, базиран на уникатниот стил на Trident, заштитата ќе ве исполни со самодоверба.",
                          "itemsList" => [
                            "Заштитник на шасија",
                            "Заштитник на предна осовина",
                            "Комплет заштита за мотор",
                            "Заштитна покривка на резервоар"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/trident660/trident660AccessoriesImg3.avif",
                            "alt" => "Trident 660 Safety"
                          ],
                          "image2" => [
                            "src" => "/images/roadsters/trident660/trident660AccessoriesImg4.avif",
                            "alt" => "Trident 660 Safety"
                          ]
                        ],
                        [
                          "title" => "Интегрирана Технологија - TFT Инструментна Плоча",
                          "desc" => "Модерното поврзување оди рака под рака со мотоциклите Triumph. Модулот за поврзување Triumph овозможува интегрирано работење со паметни телефони. Искористете ги придобивките од деталната навигација од вашиот телефон и известувањата канализирани преку паметниот дизајн на екранот TFT на вашиот инструмент. Безбедно комуницирајте со повиците и пуштете ја саканата музика со чистиот екран, контролиран од прекинувачот на воланот.Снимањето на авантурите стана полесно од кога било. Triumph се здружи со GoPro, лидерот во авантурата. Со Accessory Fit можете да го поврзете вашиот GoPro и лесно да го контролирате, задржувајќи го вашиот фокус на патот додека ги снимате авантурите за подоцна.Нема повеќе неред, целосна интеграција за функциите што ви се потребни, кога ви се потребни. Додајте го USB полначот за да бидете сигурни дека вашата технологија никогаш нема да остане без батерија кога ви е потребна. Приклучокот за полнење USB може дискретно да се инсталира под седлото за крајна удобност при полнење во движење.",
                          "itemsList" => [
                            "Уред за поврзување со инструментна плоча",
                            "USB влез за полнач"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/trident660/trident660AccessoriesImg5.avif",
                            "alt" => "Trident 660 Safety"
                          ]
                        ],
                        [
                          "title" => "Екстра Технологија ",
                          "desc" => "Со оглед на тоа што сите светла се LED, дополнително подобрете го вашето присуство на патот со тркалачките LED индикатори. Дизајниран да осветлува со насочено осветлување и докажан како поефективен за другите учесници во сообраќајот. 7-те високомоќни LED светла сместени во леано алуминиумско куќиште со сјајно црн финиш и обликуваното лого Triumph ќе го додадат тој дополнителен допир на стил и безбедност.Заборавете на заморот при возење со користење на спојката благодарение на помошта за промена на брзината. Оваа технологија за приклучување и игра овозможува префрлување без користење на куплунгот. Идеален за урбани средини или долги денови на возење, поедноставувајќи го патувањето. Добијте дополнително уверување со Triumph Track + одобрена од Тачам. Со откривање на манипулации на батеријата и антената и активирање на движење, ќе знаете дека вашиот Trident е безбеден користејќи A-GPS, GLONAS и 4G SIM за да ве информираме. Ако некој ви упадне во велосипедот, 24/7 мониторинг ќе бидете сигурни дека вие сте првиот што ќе го дознае тоа (ограничувањата важат по пазар). Вашата безбедност и безбедноста на вашиот мотоцикл се во првите редови на овие оригинални додатоци на Triumph. Се е до возење.",
                          "itemsList" => [
                            "Асистенција при менување степен на пренос",
                            "Rolling Трепкачи",
                            "Track +"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/trident660/trident660AccessoriesImg6.avif",
                            "alt" => "Trident 660 Safety"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "660cc мотор (Euro 5 Стандарди)",
                      "info2" => "2 мода на работа (Road Mode и Rain Mode)",
                      "info3" => "10000 милји / 12 месеци сервисен интервал"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/roadsters/trident660Model.png",
                        "alt" => "Trident 660 Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/roadsters/trident660/trident660HeroVideo.webm",
                        "alt" => "Trident 660 Video"
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/roadsters/trident660/trident660TopSectionImage.avif",
                        "alt" => "Trident 660"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/roadsters/trident660/trident660TopSectionImageBG.avif",
                        "alt" => "Trident 660 BG"
                      ]
                    ]
                  ],
                  "speed-triple-1200-rs" => [
                    "id" => 4,
                    "subFamilyName" => "speed-triple-1200-rs",
                    "title" => "Speed Triple 1200 RS",
                    "price" => 18990,
                    "url" => "/motorcycles/roadsters/speed-triple-1200-rs",
                    "shortDesc" => "Најмоќниот, најдинамичниот и технолошки најнапредниот Speed Triple некогаш направен.",
                    "subFamilyPageInfo" => [
                      "heroSlogans" => [
                        "Автентична",
                        "Три-Цилиндарска",
                        "Перфекција"
                      ],
                      "topSection" => [
                        "title" => "Сосема нов од секој агол",
                        "desc" => "Ја воведува врвната револуција во силина, перформанси, управување и Speed Triple технологија.",
                        "subtitle" => "Новиот репер за тоа како треба да се спојат сите коцки за да се добијат врвни перформанси на “naked-sports“ мотор."
                      ],
                      "youtubeVideo" => "https://www.youtube.com/embed/vuSogrXazi0",
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "660 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "74.04 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "51.1 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "11.95 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "64 Nm @ 6,250 rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "X-ring chain"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Wet, multi-plate, slip"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "тубуларна челична шасија"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "19 x 2.5' die-cast легура "
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "17 x 4.25' die-cast легура "
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "100/90-19"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "150/70R17"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Marzocchi Inverted Fork 45mm"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Marzocchi задна суспензија со систем за подесување"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                          ],
                          [
                            "title" => "инструментна плочка",
                            "desc" => "5 TFT екран"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "830 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1410-1460 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "820-840 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1556 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "24.6 º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "133.3 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "192 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "20 L"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "5.2l /100km"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                          ]
                        ]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "Револуција во перформансите",
                          "desc" => "Најмоќниот Speed Triple, со најмногу обртен момент и најбрза забрзување досега со сосема новиот три-цилиндарски мотор од 1160сс мотор.",
                          "image" => "/images/roadsters/speedTriple1200RS/speedTripleRSGrayCaro1.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "Револуција во однесување на пат",
                          "desc" => "Нај-флексибилниот, прецизе, динамичен и нај-респонзивниот Speed Triple некогаш изработен.",
                          "image" => "/images/roadsters/speedTriple1200RS/speedTripleRSGrayCaro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Револуција во технологија",
                          "desc" => "Пагетен, остар и технолошки нај-напредниот Speed Triple некогаш изработен.",
                          "image" => "/images/roadsters/speedTriple1200RS/speedTripleRSGrayCaro3.avif"
                        ],
                        [
                          "id" => "carouselItem4",
                          "title" => "Револуција во стајлингот",
                          "desc" => "Поставена е нова дефиниција на вистинска Speed Triple агресивност, карактер и стил.",
                          "image" => "/images/roadsters/speedTriple1200RS/speedTripleRSGrayCaro4.avif"
                        ]
                      ],
                      "youtubeVideosCarousellItems" => [[
                          "src" => "https://www.youtube.com/embed/vuSogrXazi0",
                          "title" => "Web - All-New Speed Triple 1200 RS"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/jWsjDF88QMo",
                          "title" => "Web - Track Riding | All-New Speed Triple 1200 RS"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/qeGu-JP7B40",
                          "title" => "Web - Road focused. Track ready | All-New Speed Triple 1200 RS"
                        ],
                        [
                        "src" => "https://www.youtube.com/embed/VczRFwgIYgo",
                        "title" => "All-New Speed Triple 1200 RS Features and Benefits"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/oQ2C2v-dQtU",
                          "title" => "Web - All-New Speed Triple 1200 RS  | Accessories"
                        ]
                      ],
                      "audioSection" => [
                        "audio" => "/images/roadsters/speedTriple1200RS/speedTriple 1200RS.mp3",
                        "title" => "Најдобриот звук...",
                        "desc" => "...на било кој Speed Triple мотор досега, мистичен, богат и возбудлив звук за возубудливо патување",
                        "logo" => null
                      ],
                      "specNumbers" => [
                        [ "data" => "1160", "info" => "cc Мотор" ],
                        [ "data" => "180", "info" => "Nm обртен момент" ],
                        [ "data" => "125", "info" => "PS - Максимална Сила" ],
                        [ "data" => "198", "info" => "Kg - Тежина при полн резервоар" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/roadsters/speedTriple1200RS/speedTripleReasonsHeroBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Генерациска Трансформација",
                        "desc" => "ВРЕМЕ Е ЗА БРЗИНА ТРОЈНА РЕВОЛУЦИЈА. ВО СЕКОЈ НАЧИН, SPEED TRIPLE 1200 RS Е ДИЗАЈНИРАН ДА ПОСТАВИ РЕПЕР ЗА КАКО СЕ СЕ СЕ ЗАЕДНУВА ЗА КРАЈН МОТОЦИКЛ ОД ГОЛИ ПЕРФОРМАНСИ - НА ПАТОТ И НА ПАТЕКАТА. ДОБРЕДОЈДОВТЕ ВО СУПЕРИОРНАТА БРЗИНА ТРОЈКА.."
                      ],
                      "reasons" => [
                        [
                          "title" => "Фокусиран на патиштата, но спремен за тркање",
                          "desc" => "Трансформирајте го вашето искуство во возењето со врвни перформанси со тројна брзина. Специјално дизајниран од нула за да го испорача врвното искуство на возење на патиштата, а сепак да биде неверојатно способен на патеката. Speed ​​​​Triple е врвна комбинација на перформанси, управување, технологија фокусирана на возачот, опрема за спецификација на трка и агресивен нов стил.",
                          "image" => "/images/roadsters/speedTriple1200RS/speedТripleReasons1.avif"
                        ],
                        [
                          "title" => "Нај-моќниот Speed Triple Досега",
                          "desc" => "Завртете го гасот и почувствувајте дека целосно новиот Speed ​​​​Triple ве забрзува напред со трицилиндричен мотор со највисок капацитет од 1160cc. Со максимална моќност од 180 КС, 30 КС повеќе од претходната Speed ​​​​Triple и максимален вртежен момент од 125 Nm, ќе почувствувате како вашите сетила се палат. Поголеми вртежи, со уште подобар звук со три цилиндри, лесен за возење, возбудлив - најагилниот и најбрзо забрзувачки Speed ​​​​Triple некогаш направен. ",
                          "image" => "/images/roadsters/speedTriple1200RS/speedТripleReasons2.avif"

                        ],
                        [
                          "title" => "Нај-лесниот и Нај-агилниот Speed Tripel Досега",
                          "desc" => "Дизајниран да ве воодушевува на секој чекор, новиот Speed ​​​​Triple 1200 RS е најлесниот и најдобро ракувачкиот Speed ​​​​Triple таму. Тој е полесен за 10 килограми од претходната генерација со само 198 килограми подготвен за возење, со целосно нова лесна рамка, целосно нова ергономија на возачот и покомандувачка и фокусирана позиција на возење. Резултатот е велосипед кој е позатегнат, потониран, со подобра распределба на масата, за поагилно, прецизно и динамично возење. Опремата за врвна патека вклучува нови Brembo Stylema® сопирачки, гуми Pirelli Diablo Supercorsa V3 и Öhlins перформанс суспензија, сите дотерани за врвно спортско возење со голи коски. Новиот Speed ​​​​Triple не е ништо помалку од револуција во управувањето."

                        ],
                        [
                          "title" => "Перфектна Комбинација на технологија",
                          "desc" => "Напредната технологија за напојување „ride-by-wire“ го опремува Speed ​​​​Triple 1200 RS со 3 различни мапи за гас и 4 оптимизирани мапи за контрола на тракцијата за да ви го дадат одговорот што ви треба, без оглед на условите. 5-те приспособливи режими на возење (дожд, пат, спорт, патека и приспособлив од возачот) се менуваат преку посебно копче на рачката и го прилагодуваат карактерот на велосипедот со специфичен одговор на гас и поставки за контрола на тракцијата ABS. ABS, оптимизиран за агол, ABS и контрола на тракција оптимизирана за исклучување, обезбедуваат одлична прогресивност и контрола во сите услови со постојано следење на аголот на потпирање на велосипедот, додека подобрениот нов режим Track е дизајниран да ги направи електронските интервенции речиси невидливи при брзо возење, оставајќи ве да се фокусира на следниот свиок."
                        ],
                        [
                          "title" => "Модерна Технологија",
                          "desc" => "Опремен со технологија за целосно поврзано возење, новиот Speed ​​​​Triple 1200 RS има сосема нови 5 TFT инструменти за лесно читање информации на прв поглед. Поврзете го вашиот паметен телефон со стандардниот систем за поврзување My Triumph за навигација на Google, контрола на GoPro, музика и друго. Подобрениот нов Triumph Shift Assist систем за брзо менување брзини се одликува со подобрен сензор за брзо менување на брзините и непречено, прецизно спуштање без спојка. Целосно ново, целосно LED осветлување со впечатливи нови предни светла, препознатливи дневни светла и извајано задно светло го трансформираат стилот и способноста за осветлување на 1200 RS, со побела, посветла и неверојатно карактеристична нова комбинација.",
                          "image" => "/images/roadsters/speedTriple1200RS/speedТripleReasons3.avif"
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/roadsters/speedTriple1200RS/speedTripleRSAccessoriesHero.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Сигурност и Самодоверба",
                          "desc" => "Дизајнирана специјално за агресивните линии Speed ​​​​Triple, заштитата не мора да го загрози стилот. Додадете ја заштитата што ви е потребна за да бидете сигурни при секое возење. Без разлика дали се работи за дополнителна заштита од паѓање или издржливи штитници за спречување гребнатини и абење, сè е дизајнирано специјално за Speed ​​​​Triple. Палетата вклучува комплети за заштита на рамката, штитници за вилушка и влошки за резервоарот. Сè со брендирањето Triumph, засновано на уникатниот стил на Speed ​​​​Triple, ќе ви даде единствена самодоверба.",
                          "itemsList" => [
                            "Заштита на шасија",
                            "Заштита на вилушки",
                            "Заштита од гребаници за резервоар"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/speedTriple1200RS/streetTriple1200RSAccessory1.avif",
                            "alt" => "Speed Triple 1200"
                          ],
                          "image2" => [
                            "src" => "/images/roadsters/speedTriple1200RS/streetTriple1200RSAccessory2.avif",
                            "alt" => "Speed Triple 1200"
                          ]
                        ],
                        [
                          "title" => "Подобрен Изглед",
                          "desc" => "Можете да додадете удобност и стил со специјално конструираната маска со инјектирање. Дизајниран да го намали заморот од ветерот, тој е подготвен да додаде мазни линии во Speed ​​​​Triple. Во бојата на велосипедот со налепница RS и без видливи држачи, ќе понуди беспрекорен изглед и дополнителна заштита од ветер. За уште поголема заштита од ветер, има и затемнет гел за маска. Надградете го вашиот заден вид со спортските фалсификувани крилни ретровизори. Лесниот црн алуминиумски анодизиран финиш, со CNC контра-резен профил, ќе ги подобри линиите на Speed ​​​​Triple. Променете ги резервоарите за течноста за сопирачките во CNC алуминиум, со отвори за затемнети стакла и ласерски гравирани детали за дополнително да го подобрите вашиот стил. Прецизно дизајнирани, овие компоненти го надополнуваат агресивниот дизајн кој плени, подобрувајќи го целокупниот изглед, одржувајќи ја чистата линија на Speed ​​​​Triple. Ласерско врежано брендирање го додава завршниот допир на горд изглед. Додатоци за прикажување, автентични и спремни за употреба.",
                          "itemsList" => [
                            "Предна Маска во боја на моторот",
                            "Затемнет Ветробран",
                            "Алуминиумски Ретровизори",
                            "Преден и заден резервоар за течност за сопирачки"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/speedTriple1200RS/streetTriple1200RSAccessory3.avif",
                            "alt" => "Speed Triple 1200 "
                          ]
                        ],
                        [
                          "title" => "Екстра Додатоци",
                          "desc" => "Подобрете го вашето присуство на патот со тркалачки LED индикатори. 7-те LED диоди со висока моќност сместени во леано алуминиумско тело со сјајна црна завршница и обликуваното лого Triumph ќе го додадат тој дополнителен допир на стил и безбедност.Додадете ги тие дополнителни доработки со облогата на алуминиумската оска означена со Triumph, со црни контрастни елоксирани детали и детали за Triumph оцртани со ласер. Бидете дел од револуцијата со уште повеќе стил, заштита, удобност и безбедност за да ги одразуваат вашите сопствени потреби за возење. Сите додатоци се достапни за монтирање кај вашиот локален продавач на Triumph.",
                          "image1" => [
                            "src" => "/images/roadsters/speedTriple1200RS/streetTriple1200RSAccessory4.avif",
                            "alt" => "Speed Triple 1200 "
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "Нов 1160cc со 180PS",
                      "info2" => "198kg тежина и спремен за на патека",
                      "info3" => "Најмодерна технологија фокусирана на возачот"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/roadsters/speedTriple1200RsModel.png",
                        "alt" => "Speed Triple 1200 RS Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/roadsters/speedTriple1200RS/speedTripleRSHeroVideo.webm",
                        "alt" => "Speed Triple 1200RS Video"
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/roadsters/speedTriple1200RS/speedTripleRSTopSectionImage.avif",
                        "alt" => "Speed Triple 1200RS Motorcycle"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/roadsters/speedTriple1200RS/speedTripleRSTopSectionImageBG.avif",
                        "alt" => "Speed Triple 1200RS Motorcycle BG"
                      ]
                    ]
                  ],
                  "speed-triple-1200-rr" => [
                    "id" => 5,
                    "subFamilyName" => "speed-triple-1200-rr",
                    "title" => "Speed Triple 1200 RR",
                    "price" => 20990,
                    "url" => "/motorcycles/roadsters/speed-triple-1200-rr",
                    "shortDesc" => "Колку повозбудливо изгледа толку повозбудлив е за возење. Најновиот Speed Triple 1200 RR со досега најдобрата спецификација.",
                    "subFamilyPageInfo" => [
                      "heroSlogans" => [
                        "Автентична",
                        "Три-Цилиндарска",
                        "Перфекција"
                      ],
                      "topSection" => [
                        "title" => "Чиста елеганција, перформанси и карактер",
                        "desc" => "Нај-фокусираниот Speed Triple досега. Преубав дизајн, одлично чувство на поврзаност помеѓу возачот и моторот.",
                        "subtitle" => "Нов репер за убавина, софистицирано инжињерство и фокусиран карактер и врвот на Speed Triple перформанси и управување."
                      ],
                      "youtubeVideo" => "https://www.youtube.com/embed/DmPPgMjUD1o",
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, 12 вентили, DOHC, линиски 3-цилиндри, 240° редослед на есклпозии"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "660 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "74.04 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "51.1 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "11.95 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "81 PS / 80 bhp (59.6 kW) @ 10,250 rpm"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "64 Nm @ 6,250 rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Multipoint sequential electronic fuel injection with electronic throttle control"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "X-ring chain"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Wet, multi-plate, slip"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "тубуларна челична шасија"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "19 x 2.5' die-cast легура "
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "17 x 4.25' die-cast легура "
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "100/90-19"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "150/70R17"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Marzocchi Inverted Fork 45mm"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Marzocchi задна суспензија со систем за подесување"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Dual 320mm дискови, 4-piston monobloc Brembo Stylema calipers. Front radial pump, ABS"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Еден 255 mm диск. Brembo single piston floating caliper, ABS"
                          ],
                          [
                            "title" => "инструментна плочка",
                            "desc" => "5 TFT екран"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "830 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1410-1460 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "820-840 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1556 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "24.6 º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "133.3 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "192 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "20 L"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "5.2l /100km"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "Euro 5 Стандарди измерени според Регулатива 168/2013/EC. Резултатите се добиени во специјални тест средини и се на располагање само за споредба. Вистинските резултат може да варираат врз различни средини."
                          ]
                        ]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "Револуционирање на однесувањето на патиштата",
                          "desc" => "Новиот Street Tirple направи голем чекор напред кога е во прашање управувањето со тоа што на возачот му понудива по-директна позиција за возење.",
                          "image" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRGrayCaro1.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "Нови луксузни спецификации",
                          "desc" => "Новите Öhlins Smart EC 2.0. електорнско подесувачки полу-активни елементи на суспензијата понудуваат високо ниво на перформанси, комфорт и контрола врз моторот.",
                          "image" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRGrayCaro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Нови пневматици специјализирани за на патека",
                          "desc" => "Опремен со Pirelli Diablo Supercorsa V3 пневматици, Streeт Triple буквално се лепи на подлогата.",
                          "image" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRGrayCaro3.avif"
                        ]
                        ,
                        [
                          "id" => "carouselItem4",
                          "title" => "Високо Перформантни Сопирачки",
                          "desc" => "Brembo Stylema® dual radial monobloс клештите во пар со 320mm дискови доставуваат неверојатна презиност и перформанси кога е во прашање сопирањето.",
                          "image" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRGrayCaro4.avif"
                        ]
                        ,
                        [
                          "id" => "carouselItem5",
                          "title" => "Три-Цилиндарска Револуција",
                          "desc" => "Експлозивни перформанси и перфектна респонзивност се на располагање, изработени од моторот од 1160сс - 180РЅ и 125Nm обртен момент.",
                          "image" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRGrayCaro5.avif"
                        ]
                      ],
                      "youtubeVideosCarousellItems" => [[
                          "src" => "https://www.youtube.com/embed/DSO4IahvOXk",
                          "title" => "New Triumph Speed Triple 1200 RR – Global Revea"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/DmPPgMjUD1o",
                          "title" => "New Speed Triple 1200 RR - Web"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/0oHPkxbwt70",
                          "title" => "Track Riding | New Speed Triple 1200 R"
                        ],
                        [
                        "src" => "https://www.youtube.com/embed/d8tbBPBEtdw",
                        "title" => "New Speed Triple 1200 RR  | Accessories"
                        ],
                        [
                          "src" => "https://www.youtube.com/embed/Wkl9OAfK5XQ",
                          "title" => "New Speed Triple 1200 RR Features and Benefit"
                        ]
                      ],
                      "audioSection" => [
                        "audio" => "/images/roadsters/speedTriple1200RR/speedTriple 1200RR.mp3",
                        "title" => "Пуштете глас и уживајте.",
                        "desc" => null,
                        "logo" => null
                      ],
                      "specNumbers" => [
                        [ "data" => "1160", "info" => "cc Мотор" ],
                        [ "data" => "180", "info" => "Nm обртен момент" ],
                        [ "data" => "125", "info" => "PS - Максимална Сила" ],
                        [ "data" => "15.000", "info" => "КМ Сервисен Интервал" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRReasonsBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "Speed Triple 1200RR",
                        "desc" => "Во 2021 година, 1200 RS направи апсолутна револуција во тежината, моќта, управувањето, технологијата и Speed ​​​​Triple стилот. Сега за 2022 година, барот е подигнат уште повеќе со новиот врвен опсег 1200 RR, дизајниран да испорача неверојатна и рафинирана нова изјава во стил на Speed ​​​​Triple, во комбинација со најфокусираното, возбудливо и динамично возење досега. Посветен, со највисоки спецификации, RR се одликува со нов прекрасно обликуван кокпит со рачки со прицврстување и уште пофокусирана ергономија на возачот. Преполн со најсовремена технологија и суспензија со врвни спецификации, сопирачки и гуми, RR е удобен на патеката како и на патот."
                      ],
                      "reasons" => [
                        [
                          "title" => "Перформанси",
                          "desc" => "Speed ​​​​Triple 1200 RS го зафати светот во јануари 2021 година со својот пргав и моќен трицилиндричен мотор од 180 КС и 1160 кубици. ниска инерција. Сега, истата компактна и лесна единица го напојува Speed ​​​​Triple 1200 RR давајќи уште повозбудливо искуство со Speed ​​Triple возење, благодарение на пофокусираната ергономија и надградбите на спецификациите. Избришената опашка од нерѓосувачки челик со црн конус гарантира дека звукот за овој нов британски еп е совршен.",
                          "image" => "/images/roadsters/speedTriple1200RR/speedТriple1200RRReasonsImage1.avif"
                        ],
                        [
                          "title" => "Автентична Ергономија и Управување",
                          "desc" => "Дизајниран со исклучително внимание на деталите, RR е најфокусираната Speed ​​​​Triple некогаш направена, со рачки со прицврстување и прекрасно ново обложување, што му дава чисто рафинирана спортска агресивна позиција на возење.Опремен со најновата електронски прилагодлива полуактивна вилушка Öhlins Smart EC 2.0 и заден амортизер, Speed ​​​​Triple 1200 RR се одликува со најнапредната сериска Öhlins суспензија на располагање. Сопирачките Brembo развиени на трка вклучуваат целосно прилагодлива рачка, радијално монтирани Stylema® клешти и лесни дискови од 320 mm. Новите гуми Pirelli Diablo Supercorsa SP V3 со високи перформанси, лесната лиена алуминиумска рамка и оптимизираниот центар на гравитација нудат нов репер за прецизно ракување и агилност.",
                          "image" => "/images/roadsters/speedTriple1200RR/speedТriple1200RRReasonsImage2.avif"
                        ],
                        [
                          "title" => "Технологија која е фокусирана на унапредување на перформансите",
                          "desc" => "Континуираната еволуција ја трансформираше технологијата што му помага на возачот и Speed ​​​​Triple 1200 RR е совршен пример. Оптимизираниот ABS во свијоци и оптимизираниот систем за контрола на тракцијата при свиоци нудат најсовремен безбедносен систем за возење во сите услови. И оваа помош никогаш не е наметлива или рестриктивна, тенката линија помеѓу перформансите и безбедноста е секогаш совршено избалансирана. Triumph Shift Assist за нагорни менувања работи совршено при секоја брзина и оптоварување на моторот, оптимизирајќи ги промените на брзините, одржувајќи ја позицијата на гасот, помагајќи да се зголеми фокусот на патеката или на патот. Последната генерација на контрола за подигнување на предните тркала користи напредни алгоритми за да овозможи ненаметливо непречено возење со конзистентен, позитивен гас"
                        ],
                        [
                          "title" => "Помалку напор, повеќе забава",
                          "desc" => "Покрај напредните електронски помагала за возење што ги подобруваат перформансите и безбедноста, Speed ​​​​Triple 1200 RR има голем број внимателни допири кои го подобруваат возењето. 5-инчниот TFT дисплеј има силен фокус на брзината, односот на менувачот и тахометарот, кој може да се конфигурира за да одговара на преференциите на возачот - информациите што ви се потребни за да возите на пат често се разликуваат од информациите што ги сакате на полето за екранот. патеката. Системот за поврзување My Triumph доаѓа стандардно, со вградена Bluetooth единица за лесни телефонски повици и репродукција на музика на системот на вашата кацига, заедно со детална навигација и GoPro контрола. Достапно преку лесни за користење прекинувачи на воланот со системи со мени кои се интуитивни и прифатливи за корисниците, сите информации за возењето што ви се потребни никогаш не се далеку.",
                          "image" => "/images/roadsters/speedTriple1200RR/speedТriple1200RRReasonsImage3.avif"
                        ],
                        [
                          "title" => "5 мода на работа",
                          "desc" => "Петте режими на возење (дожд, пат, спорт, патека и приспособлив за возач) може лесно да се изберат во лет, преку посебно копче на левата страна на рачката. Овие различни програми се развиени преку интензивно тестирање за да се даде совршен одзив на гас, контрола на тракцијата и поставки за ABS за да одговараат на широк опсег на временски услови и услови на патот. Се разбира, сите ние имаме свои преференции како возачи, така што опцијата Приспособлива програма овозможува секој параметар да биде дотерување за да одговара на вашиот стил. ."
                        ],
                        [
                          "title" => "Карактер",
                          "desc" => "Новиот RR го зема целокупниот мускулест став и Speed ​​​​Triple стил на новата генерација RS и ги носи на сосема ново ниво со мноштво одлични карактеристики и допири. Агресивната, слаба и мускулеста градба на Speed ​​​​Triple е дополнително засилена со неверојатната нова обвивка со едно предно светло што ја повторува дизајнерската ДНК на Triumph. Додадете на ова исклучително внимание на деталите на RR, луксузната висококвалитетна завршница од јаглеродни влакна и впечатливите комбинации на бои на Црвениот бункер и кристално белата боја и ќе го имате врвот на Speed ​​​​Triple карактер и стил."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRAccessoriesHero.avif"
                      ],
                      "infoText" => [
                        "title" => "Додајте ваш белег врз Speed 400",
                        "desc" => "На располагање ви е селекција од преку 20 оригинални Triupmh аксесоари за оваа серија на мотори. Аксесоарите кои ќе ги додадете може да бидат додадени на вашиот мотор во фабриката. Aксесоарите се дизајнирани од истиот тим кој го креираше Speed 400 и доаѓаат со две-годишна гаранција."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Технологија",
                          "desc" => "Speed ​​​​Triple 1200 RR е еден од најнапредните велосипеди на пазарот - но има простор да се додаде уште повеќе технологија, прилагодена за вашиот Triump",
                          "itemsList" => [
                            "Мониторинг на пневматици (Притиок во пневматици)",
                            "Греачи на волан",
                            "LED Трепкачи со анимација",
                            "Triumph Protect - Аларм, Triumph Locator - Локатор"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRAccesory1.avif",
                            "alt" => "Speed Triple 1200RR On The Road"
                          ],
                          "image2" => [
                            "src" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRAccesory2.avif",
                            "alt" => "Speed Triple 1200RR PaintJob"
                          ]
                        ],
                        [
                          "title" => "Додатоци",
                          "desc" => "Додека фокусираната, посветена позиција на возење инспирира духовно возење - а можеби и зависност од патеката - Speed ​​​​Triple 1200 RR е исто така удобен на растојанија, со одлична заштита од ветер од облогата и фокусирана, но ергономска позиција на возење. Опсегот на водоотпорен багаж со држачи за брзо ослободување вклучува посебна торба за резервоар и пакет за опашка за дополнителна практичност. Заштитниците на рамката и вилушката, заедно со гумената подлога за резервоарот, ќе го одржат вашиот велосипед чист, помагајќи да се спречи оштетување",
                          "image1" => [
                            "src" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRAccesory3.avif",
                            "alt" => "Speed Triple 1200RR Luggage"
                          ],
                          "image2" => [
                            "src" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRAccesory4.avif",
                            "alt" => "Speed Triple 1200RR Luggage"
                          ]
                        ]]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "Нов 1160cc со 180PS",
                      "info2" => "198kg тежина и спремен за на патека",
                      "info3" => "Најмодерна технологија фокусирана на возачот"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/roadsters/speedTriple1200RrModel.png",
                        "alt" => "Speed Triple 1200 RR Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/roadsters/speedTriple1200RR/speedTripleRRHeroVideo.webm",
                        "alt" => "Speed Triple 1200RR Video"
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRTopSectionImage.avif",
                        "alt" => "Speed Triple 1200RR Motorcycle"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/roadsters/speedTriple1200RR/speedTriple1200RRTopSectionImageBG.avif",
                        "alt" => "Speed Triple 1200RR Motorcycle BG"
                      ]
                    ]
                  ]
              ]
        ];


        $familyDataFour = [
            "id" => 4,
            "type" => "rocket-3",
            "shortDesc" => "Опремен со најголемиот сериски мотор во светот и со најголем вртежен момент, ова е врвниот мускулен родстер со високи перформанси.",
            "configPageInfo" => [
                "desc" => "Опремен со најголемиот сериски мотор во светот и со најголем вртежен момент, ова е врвниот мускулен родстер со високи перформанси.",
                "link" => "/configure/families/rocket-3"
            ],
            "configFamilyPageInfo" => [
                "image" => [
                  "src" => "/images/rocket-3/configFamilyBanner.avif",
                  "alt" => "Adventure Bikes Banner"
                ],
                "title" => "Додајте аксесоари на вашиот мотор",
                "link" => "/configure/bikes"
              ],
              "subFamilies" => [
                "rocket-3" => [
                    "id" => 4,
                    "subFamilyName" => "rocket-3",
                    "title" => "Rocket 3",
                    "price" => 25290,
                    "url" => "/motorcycles/rocket-3/rocket-3",
                    "shortDesc" => "Со мускулестиот изглед, прекрасениот стил и највисокото ниво на спецификации и технологија, Rocket-3 серијата изгледа енормно на патот но сепак е лесно управлива.",
                    "subFamilyPageInfo" => [
                      "heroSlogans" => [
                        "Лидерски",
                        "Перформанси",
                        "на светско ниво"
                      ],
                      "topSection" => [
                        "title" => "Ракета",
                        "desc" => "Опремен со најголемиот мотор некогаш ставен во продукциски мотор, Rockеt 3 серијата со нејзиниот 2500сс мотор, продуцира највисок обртен момент и невидено забрзување во светот и тоа со смиреност и превидливост при апликација на гас. Rocket-3 серијата си седи во посебна класа сам за себе.",
                        "subtitle" => "Го искусуваме раѓањето на нова ултимативна генерациска Triumph легенда."
                      ],
                      "youtubeVideo" => "https =>//www.youtube.com/embed/7pRH-6UTgu8",
                      "fullSpecs" => [
                        "engineTransmission" => [
                          [
                            "title" => "Тип на Мотор",
                            "desc" => "водно ладење, DOHC, линиски 3-цилиндри"
                          ],
                          [
                            "title" => "капацитет",
                            "desc" => "2458 cc"
                          ],
                          [
                            "title" => "диаметар",
                            "desc" => "110.2 mm"
                          ],
                          [
                            "title" => "рута",
                            "desc" => "85.9 mm"
                          ],
                          [
                            "title" => "компресија",
                            "desc" => "10.8 =>1"
                          ],
                          [
                            "title" => "Мах. Коњски Сила",
                            "desc" => "167PS /165 bhp (123 kW) @ 6,000rpm"
                          ],
                          [
                            "title" => "Мах. Обртен Момент",
                            "desc" => "221Nm @ 4,000rpm"
                          ],
                          [
                            "title" => "Систем за убризгување",
                            "desc" => "Ride-by-Wire, fuel injected"
                          ],
                          [
                            "title" => "Систем за Издувни гасови",
                            "desc" => "3 во 1 не-раѓосувачки челик / CAT Box"
                          ],
                          [
                            "title" => "Финална Трансмисија",
                            "desc" => "Shaft, bevel box"
                          ],
                          [
                            "title" => "Квачило",
                            "desc" => "Wet, multi-plate hydraulically operated, torque assist"
                          ],
                          [
                            "title" => "Менувачка Кутија",
                            "desc" => "6 брзини"
                          ]
                        ],
                        "frame" => [
                          [
                            "title" => "шасија",
                            "desc" => "целосно алуминиумска шасија"
                          ],
                          [
                            "title" => "вилушка",
                            "desc" => "алуминиум"
                          ],
                          [
                            "title" => "предно тркало",
                            "desc" => "17 x 3.5in cast aluminium "
                          ],
                          [
                            "title" => "задно тркало",
                            "desc" => "16 x 7.5in cast aluminium"
                          ],
                          [
                            "title" => "предна гума",
                            "desc" => "150/80 R17 V"
                          ],
                          [
                            "title" => "задна гума",
                            "desc" => "240/50 R16 V"
                          ],
                          [
                            "title" => "предна суспензија",
                            "desc" => "Showa 47mm upside-down 1 1 cartridge front forks, compression and rebound adjuster. 120mm travel"
                          ],
                          [
                            "title" => "задна суспензија",
                            "desc" => "Fully adjustable Showa piggyback reservoir RSU with remote hydraulic preload adjuster, 107mm rear wheel travel"
                          ],
                          [
                            "title" => "предни сопирачки",
                            "desc" => "Dual 320mm discs, Brembo M4.30 Stylema® 4-piston radial monobloc calipers, Cornering ABS"
                          ],
                          [
                            "title" => "задна сопирачка",
                            "desc" => "Single 300mm disc, Brembo M4.32 4-piston monobloc caliper, Cornering ABS"
                          ],
                          [
                            "title" => "инструментна плочка",
                            "desc" => "TFT мулти функционален екран со дигитален брзинометар, trip компјутер, дигитален тахометар, индикатор за брзина, индикатор за гориво, сервисен индикатор, амбиентална температура и бозалки модови (Дожд/Пат/Спорт/Custom) - Triumph TFT Connectivity Системот може да биде додаден со Bluetooth модул"
                          ]
                        ],
                        "dimension" => [
                          [
                            "title" => "ширина на волан",
                            "desc" => "889 mm"
                          ],
                          [
                            "title" => "висина без ретровизори",
                            "desc" => "1065 mm"
                          ],
                          [
                            "title" => "Solar height",
                            "desc" => "773 mm"
                          ],
                          [
                            "title" => "мегу-осовинско растојание ",
                            "desc" => "1677 mm"
                          ],
                          [
                            "title" => "Custer Corner",
                            "desc" => "27.9º"
                          ],
                          [
                            "title" => "Trace",
                            "desc" => "134.9 mm"
                          ],
                          [
                            "title" => "Тежина",
                            "desc" => "291 kg"
                          ],
                          [
                            "title" => "капацитет на резервоар",
                            "desc" => "18 L"
                          ]
                        ],
                        "fuelConsumption" => [
                          [
                            "title" => "Потрошувачка",
                            "desc" => "7.0 l/100km"
                          ],
                          [
                            "title" => "CO2 загадување",
                            "desc" => "EURO 5 Standard => 158g/km"
                          ]
                        ]
                      ],
                      "grayCarousell" => [
                        [
                          "id" => "carouselItem1",
                          "title" => "Најновиот и Првенец во класата на “Streetfighter“ Моторцикли",
                          "desc" => "Сега, уште повеќе сила благодарејки на Мото2 моторот со неверојатна агилност, агресивен изглед и електронска технологија која поставува нови стандарди.",
                          "image" => "/images/roadsters/streetTriple765/streetTriple765GrayCaro1.avif"
                        ],
                        [
                          "id" => "carouselItem2",
                          "title" => "Новиот Репер Во класата на “naked“ моторцикли",
                          "desc" => "ТНови технолошки унапредувања, агилност, највисока запирачка спецификација и новиот репер во смисла на моќност во класата.",
                          "image" => "/images/roadsters/streetTriple765/streetTriple765GrayCaro2.avif"
                        ],
                        [
                          "id" => "carouselItem3",
                          "title" => "Нај-моќната серија досега",
                          "desc" => "Со голем чекор напред во развивање на Мото2 моторот, Street Triple серијата се закити со уште повеќе обртен момент и сила - 120 РЅ за R верзијата и 130 РЅ за RS Verzijata.",
                          "image" => "/images/roadsters/streetTriple765/streetTriple765GrayCaro3.avif"
                        ]
                      ],
                      "youtubeVideosCarousellItems" => [[
                          "src" => "https =>//www.youtube.com/embed/cDNnqoRB50w",
                          "title" => "Triumph Street Triple Launch Valencia 2022"
                        ],
                        [
                          "src" => "https =>//www.youtube.com/embed/A6MwjE782iI",
                          "title" => "Web | Street Triple R Hero"
                        ],
                        [
                          "src" => "https =>//www.youtube.com/embed/Qj9dxotylh0",
                          "title" => "Web | Street Triple RS Hero"
                        ],
                        [
                        "src" => "https =>//www.youtube.com/embed/--p8YSQxEp0",
                        "title" => "Web | Engine In Motion Street Triple 765"
                        ],
                        [
                          "src" => "https =>//www.youtube.com/embed/JR-wXQFKG2Q",
                          "title" => "Web - DE | Street Triple R | Features and Benefits"
                        ],
                        [
                          "src" => "https =>//www.youtube.com/embed/cDNnqoRB50w",
                          "title" => "Triumph Street Triple Launch Valencia 2022"
                        ],
                        [
                          "src" => "https =>//www.youtube.com/embed/kP7FA3k6Hv8",
                          "title" => "New Street Triple 765 RS | Features and Benefits"
                        ]
                      ],
                      "audioSection" => [
                        "audio" => "/images/roadsters/streetTriple765/streetTriple765Sound.mp3",
                        "title" => "Три-цилиндречен звук кој го тресе земјиното тло.",
                        "desc" => "Новиот издувен систем го испорачува оној препознатлив три-цилиндарски звук на моторот.",
                        "logo" => null
                      ],
                      "specNumbers" => [
                        [ "data" => "2500", "info" => "cc Мотор" ],
                        [ "data" => "221", "info" => "Nm обртен момент" ],
                        [ "data" => "167", "info" => "PS - Максимална Сила" ],
                        [ "data" => "40", "info" => "Kg ПОЛЕСЕН" ]
                      ]
                    ],
                    "reasonsToDrive" => [
                      "banner" => [
                        "image" => "/images/rocket-3/heroBanner.avif"
                      ],
                      "infoText" => [
                        "title" => "зошто баш Rocket-3 !?",
                        "desc" => "Rocket-3 серијата еволуираше и на свет го донесе првиот продукциски мотор со најголема зафатнина на моторот од 2500сс. Истион испорачува не-спорелив обртен момент притоа има мускулест изглед, комбиниран со високо технолошко ниво и препознатливo Triumph чувство кога го возите. Rocket 3 R е врвниот високо перформантен роадстер а Rocket 3 GT уште повеќе го зголемува комфортот и го намалува заморот при возење што обезбедува уште подолга авантура. Еве зошто треба веднаш да ги тестирате ...!"
                      ],
                      "reasons" => [
                        [
                          "title" => "2,500cc - Првиот продукциски моторцикл со толкава зафатнина на моторот",
                          "desc" => "Претходната генерација на Rocket-3 веќе го држеше овој рекорд во своја сопственост со 2,300сс зафатнина на моторот, но најновата генерација го надмина и тоа и постави нов рекорд со 2,500сс зафатнина на моторот која нуди уште повеќе перформанси. Дизајнерите во Triumph и покрај зголемувањето на зафатнината успејаа да ја намалат вкупната тежина на моторо за 18кг и се погрижија самиот мотор да биде елегантен и уште поубав за очи.",
                          "image" => "/images/rocket-3/rocket3ReasonsMotor.avif"
                        ],
                        [
                          "title" => "Досега невидено забрзување и обртен момент ",
                          "desc" => "Најновата генерација на Rocekt 3 уште повеќе ги унапредија перформансите. Со силина од 167PS @ 6,000rpm, оваа генерација е за 11% помоќна од претходната Rocekt генерација. Со обртен момент од 221Nm at 4,000rpm Rocket-3 е светски лидер и нуди дури 71% повеќе обртен момент од најблискиот негов конкурент. Сепак зборуваме за бројка од 2.8 секунди од 0 до 100km/h."
                        ],
                        [
                          "title" => "Одлично Управување",
                          "desc" => "Екстремните перформанси на Rocket 3 се парирани со одлично управување, суспензија и сопирачки. Rocket 3 е составен од Showa предна и задна суспензија, Brembo систем за запирање. Целата шасија на Rocket 3 е создадена од алуминиум кој ја прави истат полесна и заштедува 40кг од претходната серија. Како додаток на ова моторот е опремен со врвна ABS технологија и систем за пролизгување кој е изработен во соработка со Continental."
                        ],
                        [
                          "title" => "Чувство на доминација",
                          "desc" => "Мислиме дека на секој му е јасно дека Rocket 3 серијата е доминантна секаде. Со својот мускулест изглед и стил, и опремен со ситни детали докажува дека лидер во својата категорија и кога е во прашање и изгледот. Со својата витка ергономија Rocket 3 серијата не само што е комфортна за возење туку и убава за гледање."
                        ],
                        [
                          "title" => "Технологија",
                          "desc" => "Rocket 3 серијата воведува нова технологија кога е во прашање функционалност и возачкото искуство. Втората генерација TFT екрани инкорпорира минималистички дизајн и дво-димензионален информациски систем кој е изработен со возачот во прв план, односно дозволува возачот да си го персонализира својата инструментна табла. Како додаток на сета сигурносна опрема, Rocekt 3 серијата е опремена со повеќе модови на работа како => Road, Road, Sport и Custom , hill-assist, темпомат, keyless и ситни детали како греачи на волан како стандардна опција кај Rocekt 3 GT (можност за опремување и кај R верзијата)."
                        ],
                        [
                          "title" => "My Triumph Connectivity System",
                          "desc" => "My Triumph Connectivity System му овозможува на возачот лесна конекција со GoPro камера чии операции се наведени на TFT екранот. Исто така овој систем на возачот му овозможува од turn-by-turn навигација па се до планер за возење и интегрирана конекција за телефон кој овозможува да контролирате со музика.",
                          "image" => "/images/rocket-3/rocket3ReasonsConectivity.avif"
                        ],
                        [
                          "title" => "Импозанта Става",
                          "desc" => "Секој мотор од Rocket 3 серијата ужива во својатса силуета и дизајн. Специјални Avon Cobra Chrome гуми се изработени специјанлно за Rocket 3 серијата. Самата димензија на гумите додава посебен мускулест изглед на моторот. Моден додаток на моторите е и задната вилушка која е видлива само од левата страна моторот на чиј крај се наоѓа лесно алуминиумско тркало со 20 краци."
                        ],
                        [
                          "title" => "Препознатливи Дизајн Елементи",
                          "desc" => "За подобрувањето на естетиката на Rocket 3 се заслужни и мноштво врвни детали и препознатливи дизајнерски карактеристики кои го максимизираат мускулестото присуство на моторот, вклучувајќи => иновативно извајани издувни цевки кои овозможуваат да се нагласи импозантната големина на моторот, препознатлив двоен LED фар* со прекрасно брендирање на триаголник со ознака на производителот Triumph, уникатно седиште за секој мотор со удобни извајани седишта за возач и сопатник со посебно приспособено седло што создава течна линија низ моторот – со GT варијантата која се одликува со прилагодлив четкан алуминиумски потпирач за грб – и целосно LED осветлување* со карактеристично дневно Светла* за максимална видливост.."
                        ],
                        [
                          "title" => "Прекрасни Детали и Боја",
                          "desc" => "Палетата на мотоцикли Rocket 3 има високо ниво на завршна обработка и детали што ја дефинира завршната фаза заслужна за неговиот прекрасен стил. Овие прекрасни карактеристики вклучуваат мускулест извајан резервоар за гориво со препознатливата дизајнерска ДНК на Triumph, четкана лента на резервоарот од не'рѓосувачки челик и алуминиумско капаче во стилот на Монца, брусен алуминиумски капак на воздушната кутија, брусен алуминиум за ладење и капачиња за масло во стилот на Монца, обработени перки на картерот, четкани топлински штитови од издувните гасови и завршни капачиња и скриени потпирачи за нозе на преклопување со уникатен дизајн."
                        ]
                      ]
                    ],
                    "accessory" => [
                      "banner" => [
                        "image" => "/images/rocket-3/rocket3AccessoryBaner.avif"
                      ],
                      "infoText" => [
                        "title" => "Rocket-3",
                        "desc" => "Rocket 3 R & GT може целосно да се прилагоди на преференциите на нивните сопственици со повеќе од педесет оригинални приспособени додатоци на Triumph, кои се дизајнирани, изградени и тестирани заедно со еволуцијата на овој велосипед. Додатоци кои го подобруваат капацитетот за носење багаж, удобноста, практичноста, стилот и заштитата на моделите Rocket 3. Дизајниран и изграден во тандем со еволуцијата на мотоциклите и сите достапни кај овластените дилери. Има и комплет за инспирација „Highway“, кој е совршен начин веднаш да додадете ново ниво на способност за турнеи на Rocket 3, со однапред избрана палета на оригинални Triumph додатоци."
                      ],
                      "accessoryTypes" => [
                        [
                          "title" => "Инспирација",
                          "desc" => "За да ги прикажеме обемните можности за турнеи на серијата Rocket 3, ги препорачуваме овие специјално избрани оригинални додатоци на Triumph за врвна конфигурација за турнеи =>",
                          "itemsList" => [
                            "Спортски Страничен Багаж",
                            "Држачи за Багаж кои се лесни за Одстранување",
                            "Вграден Централен Алуминиумски Држач за Багаж",
                            "Машински Изработени Ретровизори",
                            "Triumph Shift Assist",
                            "Triumph TFT connectivity ситем"
                          ],
                          "image1" => [
                            "src" => "/images/rocket-3/rocket3Accessory1.avif",
                            "alt" => "Rocket - 3"
                          ]
                        ],
                        [
                          "title" => "Стил",
                          "desc" => "Персонализирајте го стилот на вашиот Rocket 3 со прилагодени додатоци. Вклучува спортски ретровизори, класични ретровизори и (за прв пат на сериски велосипед) лизгачки LED трепкач* со црно тело од алуминиумска легура и црн хром внатрешен ретровизор *Може да важат регионални ограничувања.",
                          "image1" => [
                            "src" => "/images/rocket-3/rocket3Accessory2.avif",
                            "alt" => "Rocket 3 Passenger Grabs"
                          ]
                        ],
                        [
                          "title" => "Технологија",
                          "desc" => "Опсегот на додатоци од високата класа го вклучува системот за поврзување Triumph TFT, кој овозможува навигација чекор по свиок, управување со телефонски повици, работа со GoPro камера и многу повеќе. Исто така, Triumph Track+ (уредот за следење заедно со 24/7 контрола од мобилниот телефон на сопственикот) и Triumph Protect+ (систем за аларм одобрен од Triumph Thtcham) ја подигнуваат заштитата на ново ниво и му обезбедуваат доверба на сопственикот.",
                          "image1" => [
                            "src" => "/images/rocket-3/rocket3Accessory3.avif",
                            "alt" => "Rocket 3 Speedo"
                          ]
                        ],
                        [
                          "title" => "Сигурност",
                          "desc" => "За поголема заштита, во соработка со Artago развивме серија безбедносни производи, кои ќе му понудат поголема безбедност на вашиот Triumph. Овие производи целосно ги исполнуваат безбедносните спецификации Sold Secure и SRA. (Куката за заземјување ја исполнува само спецификацијата Sold Secure). Опсегот вклучува =>",
                          "itemsList" => [
                            "Катанец и Ланец",
                            "Катанец на Сопирачки",
                            "Horseshoe lock",
                            "Ground hook",
                            "Disc brake lock with alarm (120dB)"
                          ],
                          "image1" => [
                            "src" => "/images/roadsters/streetTriple765/streetТriple765АccessoriesTailBag.avif",
                            "alt" => "Street Triple 765 Tail Bag"
                          ]
                        ]
                      ]
                    ],
                    "shortSpecInfo" => [
                      "info1" => "2500cc Rocket Мотор",
                      "info2" => "'Ultimate high performance roadster'"
                    ],
                    "gallery" => [
                      "modelImage" => [
                        "src" => "/images/rocket/rocket3Model.png",
                        "alt" => "Rocket 3 Range Model Image"
                      ],
                      "subFamilyHeroVideo" => [
                        "src" => "/images/rocket-3/rocket3SubFamHeroVideo.webm",
                        "alt" => "Rocket 3 "
                      ],
                      "subFamilyTopSectionImage" => [
                        "src" => "/images/rocket-3/rocket-3TopSectionImage.avif",
                        "alt" => "Rocket 3"
                      ],
                      "subFamilyTopSectionBGImage" => [
                        "src" => "/images/rocket-3/rocket-3TopSectionImageBG.avif",
                        "alt" => "Rocket 3"
                      ]
                    ]
                  ]
              ]
        ];




        $familyData = array_merge($familyData, [
            'configPageInfo' => [
                'desc' => 'Истражете го светот на авантурите, со мотоцикли изградени за секогаш да стигнат до крајот на патот.',
                'link' => '/configure/families/adventure',
            ],
        ]);


        Families::create($familyData);
        Families::create($familyDataTwo);
        Families::create($familyDataThree);
        Families::create($familyDataFour);

    }
}
